#Область ПеренесеноСДоработками

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Форма спецификации открывается в разных режимах. Это зависит от места откуда была открыта форма спецификации:
	// - если форма была открыта из номенклатуры (по гиперссылке в карточке номенклатуры или из списка спецификаций номенклатуры),
	//   то форма откроется в режиме Блокировка владельца, чтобы было понятно, к какой продукции она относится.
	// - если форма была открыта из общего списка спецификации, то режим открытия будет Независимый. 
	//   Продукция, к которой она относится, отображается на форме.
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ФормироватьНаименованиеПолноеАвтоматически = УстановитьФлагФормироватьНаименованиеПолноеАвтоматически(Объект.НаименованиеПолное,Объект.Наименование);
	
	// Обработчик подсистемы "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	
	Если Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Параметры.ТекстЗаполнения) И ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	
	ИспользоватьСкрытиеНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьСкрытиеНоменклатуры");
	
	Если Параметры.Ключ.Пустая() 
		И Параметры.Свойство("ЗначенияЗаполнения") Тогда
		
		Штрихкоды = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.ЗначенияЗаполнения, "Штрихкоды");
		
		КодСтраны = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.ЗначенияЗаполнения, "СтранаПроисхожденияКод");
		Если ЗначениеЗаполнено(КодСтраны) Тогда
			Объект.СтранаПроисхождения = УправлениеКонтактнойИнформацией.СтранаМираПоКодуИлиНаименованию(КодСтраны);
		КонецЕсли;
		
		ПроверитьНоменклатуруВАрхиве(ЭтотОбъект);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Штрихкоды) Тогда
		Штрихкоды = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Штрихкоды");
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая()
		И Параметры.Свойство("АлкогольнаяПродукцияЕГАИС")
		И ЗначениеЗаполнено(Параметры.АлкогольнаяПродукцияЕГАИС) Тогда
		
		Объект.Наименование       = Параметры.НаименованиеНоменклатурыЕГАИС;
		Объект.НаименованиеПолное = Параметры.ПолноеНаименованиеНоменклатурыЕГАИС;
		
		Если ЗначениеЗаполнено(Параметры.ИмпортерЕГАИС) Тогда
			ИмпортерЕГАИС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ИмпортерЕГАИС, "Контрагент");
			Если ТипЗнч(ИмпортерЕГАИС) = Тип("СправочникСсылка.Контрагенты") Тогда
				Объект.Импортер = ИмпортерЕГАИС;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Параметры.ПроизводительЕГАИС) Тогда
			ПроизводительЕГАИС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ПроизводительЕГАИС, "Контрагент");
			Если ТипЗнч(ПроизводительЕГАИС) = Тип("СправочникСсылка.Контрагенты") Тогда
				Объект.Производитель = ПроизводительЕГАИС;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьСведенияОбАлкогольнойПродукции = Истина;
		Объект.ВидМаркировки = Перечисления.ВидыПродукцииИС.Алкогольная;
		Если ЗначениеЗаполнено(Параметры.ВидАлкогольнойПродукцииЕГАИС) Тогда
			ВидАлкогольнойПродукцииЕГАИС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ВидАлкогольнойПродукцииЕГАИС, "Код, Наименование, Маркируемый");
			КодВидаАлкогольнойПродукции = ВидАлкогольнойПродукцииЕГАИС.Код;
			НаименованиеВидаАлкогольнойПродукции = ВидАлкогольнойПродукцииЕГАИС.Наименование;
		КонецЕсли;
			
		КоэффПересчетаДал = Параметры.ОбъемЕГАИС;
				
	КонецЕсли;
	
	ОсновнаяСтавкаНДС = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяСтавкаНДС");
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ВидСтавкиНДС = ?(ЗначениеЗаполнено(ОсновнаяСтавкаНДС),
		Перечисления.ВидыСтавокНДС.ВидСтавки(ОсновнаяСтавкаНДС),
		Объект.ВидСтавкиНДС);
	КонецЕсли;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Услуга") Тогда
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Услуга", Параметры.ЗначенияЗаполнения.Услуга);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.ВидНоменклатуры.ПараметрыВыбора = НовыеПараметры;
		
	КонецЕсли;
	
	Если Объект.Услуга Тогда
		Объект.СтатьяЗатрат = Неопределено;
		ОсновнойВидНоменклатуры = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию(
			"ОсновнойВидНоменклатурыУслуга");
		Если Не ЗначениеЗаполнено(ОсновнойВидНоменклатуры) Тогда
			ОсновнойВидНоменклатуры = Справочники.ВидыНоменклатуры.ЭлементВидНоменклатурыПоУмолчанию(Истина);
		КонецЕсли;
	Иначе
		ОсновнойВидНоменклатуры = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию(
			"ОсновнойВидНоменклатуры");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
		ВидНоменклатурыПриИзмененииНаСервере();
	КонецЕсли;
	
	Элементы.СтатьяЗатрат.Видимость = ПравоДоступа("Чтение", Метаданные.Справочники.СтатьиЗатрат);
	
	ИспользуетсяПростойИнтерфейс = ОбщегоНазначенияБПВызовСервера.ЭтоПростойИнтерфейс();
	
	ИспользуютсяНесколькоСкладов = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоСкладовБухгалтерскийУчет")
		И ВедетсяСкладскойУчет();
		
	ИнтеграцияИСМПБП.ЗаполнитьСписокВыбораВидовПродукцииИС(Элементы.ВидМаркировки.СписокВыбора);
	ЕстьДоступныеВидыМаркировки          = Элементы.ВидМаркировки.СписокВыбора.Количество() > 1;
	ВедетсяУчетПрослеживаемыхТоваров     = ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров");
	ИспользоватьКомплектациюНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьКомплектациюНоменклатуры");
		
	ПрочитатьСрокиИспользованияСпецодежды();
	ПрочитатьСведенияОбАлкогольнойПродукции();
	
	РаздельныйУчетНДС = УчетНДСРаздельный.ЕстьУчетнаяПолитикаСРаздельнымУчетомНДС();
	КлассификацияНоменклатурПоОперациям0 = УчетНДС.ЕстьКлассификацияНоменклатурПоОперациям0();
	ВИсторииЕстьСтавкаБезНДС = Справочники.Номенклатура.ВИсторииЕстьСтавкаБезНДС(Объект.Ссылка);
	ЕстьИсторияВидовСтавокНДС = Справочники.Номенклатура.ЕстьИсторияВидовСтавокНДС(Объект.Ссылка);
	ТекущаяДатаПользователя = ОбщегоНазначения.ТекущаяДатаПользователя();
	ВидСтавкиНДСНаДату = Справочники.Номенклатура.ВидСтавкиНДСНаДату(Объект.Ссылка, ТекущаяДатаПользователя);

	ЗаполнитьАктуальнуюСтавкуНДС(ВидСтавкиНДСНаДату);
	
	Элементы.СкрыватьВСписках.Видимость = НЕ ПомеченныеНаУдалениеСервер.СкрыватьПомеченныеНаУдаление() 
		И Пользователи.РолиДоступны("СкрытиеНоменклатуры");
	
	ЗаполнитьПолеНаименованияКода("ОКВЭД");
	ЗаполнитьПолеНаименованияКода("ОКВЭД2");
	ЗаполнитьПолеНаименованияКода("ТНВЭД");
	ЗаполнитьПолеНаименованияКода("ОКП");
	ЗаполнитьПолеНаименованияКода("ОКПД2");
	ЗаполнитьПолеНаименованияКода("НоменклатурнойКлассификацииККТ");
	
	РегистрыСведений.СведенияОбАлкогольнойПродукции.СписокВидовПродукции(Элементы.КодВидаАлкогольнойПродукции.СписокВыбора);
	УстановитьУчетПодконтрольнойПродукции();
	
	Элементы.ГруппаЭлектронныеСертификаты.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьОплатуСертификатамиНСПК");
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьФискальныйРегистратор") 
		ИЛИ НЕ Объект.ПризнакПредметаРасчета.Пустая() Тогда
		
		Элементы.ПризнакПредметаРасчета.Видимость = Истина;
		ПодготовитьСписокСведенияОПредметеРасчета();
	КонецЕсли;
	
	ПолучитьСвойстваВидаНоменклатуры();
	УправлениеФормой(ЭтаФорма);
	
	ЕстьУчетПодакцизныхТоваров = ПолучитьФункциональнуюОпцию("ИмпортПодакцизныхТоваров")
		Или ПолучитьФункциональнуюОпцию("ПроизводствоПодакцизныхТоваров");
	
	Если ЕстьУчетПодакцизныхТоваров Тогда
		Если ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
			ВидТовара = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидНоменклатуры, "ВидПодакцизногоТовара");
			Если Объект.Ссылка.Пустая() Тогда
				УчетАкцизов.ЗаполнитьКодВидаПодакцизногоТовараПоУмолчанию(ВидТовара, Объект.КодВидаПодакцизногоТовара);
				Если ЗначениеЗаполнено(Объект.КодВидаПодакцизногоТовара) Тогда
					УчетАкцизовВызовСервера.ПолучитьЕдиницуИзмеренияПоСтавкеАкциза(Объект.КодВидаПодакцизногоТовара, Объект.ЕдиницаИзмеренияДляРасчетаАкциза);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		НастроитьВидимостьГруппыАкцизы();
		НастроитьВидимостьКоэффициентаПересчетаПоАкцизам();
	Иначе
		НастроитьВидимостьГруппыАкцизы();
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	ОбработкаНовостейПереопределяемый.КонтекстныеНовости_ПриСозданииНаСервере(
		ЭтаФорма,
		"БП.Справочник.Номенклатура",
		"ФормаЭлемента",
		НСтр("ru='Новости: Номенклатура'"),
		ИдентификаторыСобытийПриОткрытии
	);
	// Конец ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	
	ЗаполнитьПодсказкуПечатиАртикула();
	
	Если Объект.Ссылка.Пустая() Тогда
		ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
		ВалютаЦены         = ВалютаРегламентированногоУчета;
		ВалютыЦеныБезВалют = ВалютаРегламентированногоУчета;
		
		ОтобразитьОсновнуюСпецификацию();
		
	КонецЕсли;
	
	НастройкиУчетаМСФО.НастроитьФормуОбъектаУчета(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Перечисления.СтавкиНДС.ЗаполнитьСписокВыбораСтавокНДС(ЭтотОбъект, "СтавкаНДС");
	
	УточнитьПредставлениеСтавкиНДСПриУСН();
	
	// ЭлектронноеВзаимодействие.СопоставлениеНоменклатурыКонтрагентов
	СопоставлениеНоменклатурыКонтрагентов.ПриСозданииФормыНоменклатуры(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.СопоставлениеНоменклатурыКонтрагентов
	
	// ЭлектронноеВзаимодействие.РаботаСНоменклатурой
	НастроитьЭлементыУправленияРаботаСНоменклатурой();
	// Конец ЭлектронноеВзаимодействие.РаботаСНоменклатурой
	
	//БгосИС 1.1.29.3
	Если Не Параметры.Ключ.Пустая() Тогда
		//Если используются упаковки номенклатуры
		ЕстьУпаковки = ?(ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры"),
					     УпаковкиВызовСервера.СписокУпаковокНоменклатуры(Объект.Ссылка).Количество() > 0, Ложь); 
		
		ВывестиОписаниеМаркируемогоТовараНаСервере();
	КонецЕсли;
	// 
	ТекущаяЕдиница = Объект.ЕдиницаИзмерения;
	// Типы оборудования которые надо подключать при открытии формы
	ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
	ТипыОборудования.СканерШтрихкода = НЕ ТолькоПросмотр;
	ТипыОборудования.ПринтерЭтикеток = Истина;
	
	МенеджерОборудования.ПриСозданииНаСервере(ЭтаФорма, ТипыОборудования);
	ЗаполнитьАктуальныеЦены();
	
	МобильныйКлиентАдаптацияФормы();
	
	#Вставка
	//++ #Б6906 смарт: Шляпников 19.05.2026 / Маркировка. Дополнительные реквизиты в 1С БП
	События = Новый Структура;
	События.Вставить("ПриИзменении", "смартОбязательнаяМаркировкаПриИзменении");
	
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартОбязательнаяМаркировка", "ГруппаДополнительныеРеквизиты",, 2, "Объект.смартОбязательнаяМаркировка",, События);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартДатаНачалаОбязательнойМаркировки", "ГруппаДополнительныеРеквизиты",, 1, "Объект.смартДатаНачалаОбязательнойМаркировки");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартПроверкаПроведенаМаркировкаНеТребуется", "ГруппаДополнительныеРеквизиты",, 2, "Объект.смартПроверкаПроведенаМаркировкаНеТребуется",, События);
	
	УстановитьВидимостьПолейМаркировки();
	//-- #Б6906 смарт: Шляпников 19.05.2026
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++ #Б6906 смарт: Шляпников 19.05.2026 / Маркировка. Дополнительные реквизиты в 1С БП
&НаКлиенте
Процедура смартОбязательнаяМаркировкаПриИзменении(Элемент)
	
	УстановитьВидимостьПолейМаркировки();
	
КонецПроцедуры

//++ #Б6906 смарт: Шляпников 19.05.2026 / Маркировка. Дополнительные реквизиты в 1С БП
&НаСервере
Процедура УстановитьВидимостьПолейМаркировки()
	
	Элементы.смартДатаНачалаОбязательнойМаркировки.ТолькоПросмотр = НЕ Объект.смартОбязательнаяМаркировка;
	Элементы.смартОбязательнаяМаркировка.ТолькоПросмотр = Объект.смартПроверкаПроведенаМаркировкаНеТребуется;
	Элементы.смартПроверкаПроведенаМаркировкаНеТребуется.ТолькоПросмотр = Объект.смартОбязательнаяМаркировка;
	
	Если НЕ Объект.смартОбязательнаяМаркировка Тогда
		Объект.смартДатаНачалаОбязательнойМаркировки = Дата(1, 1, 1);
	КонецЕсли;
	
КонецПроцедуры

#конецОбласти