
#Область ПеренесеноСДоработкамиСмарт

&Перед("ВывестиСчетФактуруВТабличныйДокумент")
Процедура смарт_ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаСФ, ЭтоУниверсальныйПередаточныйДокумент)
	//смарт+ Вахов Владимир /484 / 30.03.2021
	ДанныеШапки   = ВыборкаСФ.ДанныеШапки;
	Грузополучатель = 	ДанныеШапки.Грузополучатель;
	
	Если ТипЗнч(Грузополучатель) <> Тип("Строка") Тогда	
		СведенияОГрузополучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Грузополучатель, ДанныеШапки.Дата);
		ПредставлениеГрузополучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
		СведенияОГрузополучателе, "НаименованиеДляПечатныхФорм,ФактическийАдрес,");
		ДанныеШапки.Вставить("ПредставлениеГрузополучателя", ПредставлениеГрузополучателя);
	КонецЕсли;
	//смарт- Вахов Владимир /484 / 30.03.2021
	
	// ЯшниковДА 20180322 +++
	// Доверенность руководителя
	Если ДанныеШапки.Свойство("Руководитель") Тогда
		ДолжностьРуководителя = Справочники.Должности.НайтиПоНаименованию("Генеральный директор");
		СтруктураДоверенностьРуководителя = смартПолучитьДоверенностьОтветственногоЛица(ДанныеШапки.Поставщик, ДанныеШапки.Руководитель, ДолжностьРуководителя);
	
		Если Не СтруктураДоверенностьРуководителя = Неопределено Тогда
			ДанныеШапки.ФИОРуководителя	= ДанныеШапки.ФИОРуководителя + Символы.ПС + СтруктураДоверенностьРуководителя.Доверенность;	
		КонецЕсли;
	КонецЕсли;
	
	// Доверенность главного бухгалтера
	Если ДанныеШапки.Свойство("ГлавныйБухгалтер") Тогда
		ДолжностьГлБух = Справочники.Должности.НайтиПоНаименованию("Главный бухгалтер");
		СтруктураДоверенностиГлБух = смартПолучитьДоверенностьОтветственногоЛица(ДанныеШапки.Поставщик, ДанныеШапки.ГлавныйБухгалтер, ДолжностьГлБух);
	
		Если Не СтруктураДоверенностиГлБух = Неопределено Тогда
			ДанныеШапки.ФИОГлавногоБухгалтера	= ДанныеШапки.ФИОГлавногоБухгалтера + Символы.ПС + СтруктураДоверенностиГлБух.Доверенность;	
		КонецЕсли;
	КонецЕсли;
	// ЯшниковДА 20180322 ---
	
	//++ #6670  смарт: Тимофеева 27.04.2026 / Маркировка радиоэлектронной продукции. Блокировка Печати в документах РТУ. УчБазы 1С УТ и БП РФ.
	ДатаНачалаКонтроляОтгрузкиМаркированнойПродукции = Справочники.смартПредопределенныеЗначения.ДатаНачалаКонтроляОтгрузкиМаркированнойПродукции.Значение;
	Если ЗначениеЗаполнено(ДатаНачалаКонтроляОтгрузкиМаркированнойПродукции) 
		И ДанныеШапки.Дата >= ДатаНачалаКонтроляОтгрузкиМаркированнойПродукции Тогда
		//++ #6892 смарт: Тимофеева 15.05.2026 / Печать документов за поставщика в БП. Ошибка
		//МассивТоваров = ВыборкаСФ.ТаблицаДокумента.ВыгрузитьКолонку("Товар");
		МассивТоваров = Новый Массив;
		Для Каждого Строка Из ВыборкаСФ.ТаблицаДокумента Цикл
			Если ТипЗнч(Строка.Товар) = Тип("СправочникСсылка.Номенклатура") Тогда
				МассивТоваров.Добавить(Строка.Товар);
			КонецЕсли;
		КонецЦикла;
		//++ #6892 смарт: Тимофеева 15.05.2026
		
		ЗначениеРеквизитаОбъектов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивТоваров, "ВидМаркировки");
		МассивМаркированнойПродукции = Новый Массив;
		Для каждого КлючИЗначение Из ЗначениеРеквизитаОбъектов Цикл
			Если ЗначениеЗаполнено(КлючИЗначение.Значение)
				И МассивМаркированнойПродукции.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
				МассивМаркированнойПродукции.Добавить(КлючИЗначение.Ключ);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивМаркированнойПродукции.Количество() > 0 Тогда 
			ТекстИсключения = СтрШаблон("В документе содержится маркируемый товар: %1. Документ подписывается только по ЭДО!", 
			СтрСоединить(МассивМаркированнойПродукции, ", "));
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
    КонецЕсли;
	//-- #6670  смарт: Тимофеева 27.04.2026
КонецПроцедуры

&После("ВывестиСчетФактуруВТабличныйДокумент")
Процедура смарт_ВывестиСчетФактуруВТабличныйДокументПосле(ТабДокумент, Макет, ВыборкаСФ, ЭтоУниверсальныйПередаточныйДокумент)  
	
	//++ смарт:Подкин # 07.02.2022 17:52:48
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаСФ.Ссылка,"ДокументОснование") Тогда  
		//-- смарт:Подкин # 07.02.2022 17:52:48
		Если ТипЗнч(ВыборкаСФ.Ссылка.ДокументОснование) = ТипЗнч(Документы.ПередачаТоваров.Пустаяссылка()) Тогда
			//на шапку
			Рис = ТабДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			Рис.Высота=55;
			Рис.Ширина=155;
			Рис.Верх = 20;
			Рис.Лево = 80;
			Рис.РазмерКартинки = РазмерКартинки.Пропорционально; 
			Рис.ВыводитьНаПечать = Истина;
			Рис.Узор = ТипУзораТабличногоДокумента.БезУзора;
			Рис.ГраницаСверху = Ложь;
			Рис.ГраницаСнизу = Ложь;
			Рис.ГраницаСлева = Ложь;
			Рис.ГраницаСправа = Ложь;
			Рис.Картинка = БиблиотекаКартинок.смарт_КартинкаБезвозмезднаяПередача;
			//на подписи
			//Рис = ТабДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			//Рис.Высота=55;
			//Рис.Ширина=155;
			//Рис.Верх = 140;
			//Рис.Лево = 80;
			//Рис.РазмерКартинки = РазмерКартинки.Пропорционально; 
			//Рис.ВыводитьНаПечать = Истина;
			//Рис.Узор = ТипУзораТабличногоДокумента.БезУзора;
			//Рис.ГраницаСверху = Ложь;
			//Рис.ГраницаСнизу = Ложь;
			//Рис.ГраницаСлева = Ложь;
			//Рис.ГраницаСправа = Ложь;
			//Рис.Картинка = БиблиотекаКартинок.смарт_КартинкаБезвозмезднаяПередача;
		КонецЕсли;
		//++ смарт:Подкин # 07.02.2022 17:52:48
	КонецЕсли;
	//-- смарт:Подкин # 07.02.2022 17:52:48

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт
	
// Яшников 20180322 +++
Функция смартПолучитьДоверенностьОтветственногоЛица(Организация, ФизическоеЛицо, Должность)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОснованияПраваПодписи.Организация КАК Организация,
		|	ОснованияПраваПодписи.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОснованияПраваПодписи.Представление КАК Представление
		|ИЗ
		|	Справочник.ОснованияПраваПодписи КАК ОснованияПраваПодписи
		|ГДЕ
		|	ОснованияПраваПодписи.ФизическоеЛицо = &ФизическоеЛицо
		|	И ОснованияПраваПодписи.Организация = &Организация
		|	И ОснованияПраваПодписи.Должность <> &Должность
		|	И НЕ ОснованияПраваПодписи.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОснованияПраваПодписи.ДатаНачала УБЫВ";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Должность", Должность);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаРезультата = Запрос.Выполнить().Выбрать();
	
	СтруктураВозврата = Новый Структура;
	
	Пока ВыборкаРезультата.Следующий() Цикл
		СтруктураВозврата.Вставить("Доверенность", ВыборкаРезультата.Представление); 
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти