
#Область ПеренесеноСДоработками

&Перед("ПередЗаписью")
Процедура РасшСмарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//смартКаратеев ++
	//Дозаполнение реквизитов после создания документа правилами обмена.
	//Изменения сделаны в этом модуле, чтобы не затрагивать типовые правила обмена EnterpriseData

	//Код независим
	//Реквизиты зависимы
	Если ОбменДанными.Загрузка
		И ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочееСписание
		И ЭтотОбъект.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("ЦБ-000040")
		И ЭтотОбъект.СубконтоДт1 = Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("ЦБ-Р00040")
		И СтрНачинаетсяС(ЭтотОбъект.НазначениеПлатежа,"Комиссия") Тогда
		
		ЭтотОбъект.СубконтоДт2 = ?(ЭтотОбъект.СубконтоДт2 = Неопределено,ЭтотОбъект.Контрагент,ЭтотОбъект.СубконтоДт2);
		ЭтотОбъект.СубконтоДт3 = ?(ЭтотОбъект.СубконтоДт3 = Неопределено,Справочники.Субконто.НайтиПоКоду("ОП-000008"),ЭтотОбъект.СубконтоДт3);
	ИначеЕсли ОбменДанными.Загрузка
		И ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет
		И ЭтотОбъект.СчетОрганизации.Владелец = ЭтотОбъект.СчетКонтрагента.Владелец 
		И (ЭтотОбъект.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка()
		ИЛИ ЭтотОбъект.СтатьяДвиженияДенежныхСредств = Неопределено) Тогда
		
		ЭтотОбъект.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("ЦБ-000030");
	КонецЕсли;
	//Каратеев --
	
КонецПроцедуры
	
#КонецОбласти 