
#Область ПеренесеноСДоработкамиСмарт

//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
&ИзменениеИКонтроль("ВремяДокументаПоУмолчанию")
Функция смарт_ВремяДокументаПоУмолчанию()
	
	#Удаление //++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
	Возврат Новый Структура("Часы, Минуты", 19, 0);
	#КонецУдаления
	
	#Вставка
	//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
	//++ смарт:Подкин #1135 09.08.2022 19:21:12
	Возврат Новый Структура("Часы, Минуты", Час(ТекущаяДатаСеанса()), Минута(ТекущаяДатаСеанса()));
	//-- смарт:Подкин #1135 09.08.2022 19:21:12
	//-- #Б-1828 смарт: Лопато 09.01.2025
	#КонецВставки

КонецФункции

#КонецОбласти