
#Область ПеренесеноСДоработкамиСмарт

//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
&ИзменениеИКонтроль("ПечатьАвансовогоОтчета")
Функция смарт_ПечатьАвансовогоОтчета(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АвансовыйОтчет_АвансовыйОтчет";
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов",  МассивОбъектов);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ПустойСчет",      ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АвансовыйОтчет.Ссылка КАК Ссылка,
	|	АвансовыйОтчет.МоментВремени КАК МоментВремени,
	|	АвансовыйОтчет.Номер КАК Номер,
	|	АвансовыйОтчет.Дата КАК ДатаДокумента,
	|	АвансовыйОтчет.ФизЛицо КАК ПодотчетноеЛицо,
	|	АвансовыйОтчет.ФизЛицо.Представление КАК ПредставлениеПодотчетногоЛица,
	|	АвансовыйОтчет.Организация КАК Руководители,
	|	АвансовыйОтчет.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.ПодразделениеОрганизации.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА АвансовыйОтчет.ПодразделениеОрганизации.Наименование
	|		ИНАЧЕ АвансовыйОтчет.ПодразделениеОрганизации.НаименованиеПолное
	|	КОНЕЦ КАК ПредставлениеПодразделения,
	|	АвансовыйОтчет.ПодразделениеОрганизации.Код КАК КодПодразделения,
	|	АвансовыйОтчет.Организация КАК Организация,
	|	АвансовыйОтчет.СчетЗатрат КАК СчетЗатрат,
	|	АвансовыйОтчет.НазначениеАванса КАК НазначениеАванса,
	|	АвансовыйОтчет.ВалютаДокумента КАК ВалютаДокумента,
	|	АвансовыйОтчет.КурсРассчитывается КАК КурсРассчитывается,
	|	АвансовыйОтчет.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	АвансовыйОтчет.ВалютаДокумента.Представление КАК ПредставлениеВалюты,
	|	АвансовыйОтчет.СуммаДокумента КАК СуммаДокумента,
	|	АвансовыйОтчет.КоличествоДокументов КАК КоличествоДокументов,
	|	АвансовыйОтчет.КоличествоЛистов КАК КоличествоЛистов
	|ИЗ
	|	Документ.АвансовыйОтчет КАК АвансовыйОтчет
	|ГДЕ
	|	АвансовыйОтчет.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	АвансовыйОтчет.Ссылка";
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АвансовыйОтчетВыданныеАвансы.Ссылка КАК АвансовыйОтчет,
	|	АвансовыйОтчетВыданныеАвансы.ДокументАванса КАК ДокументАванса,
	|	АвансовыйОтчетВыданныеАвансы.ДокументАванса.Дата КАК ДокументАвансаДата,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчетВыданныеАвансы.ДокументАванса ССЫЛКА Документ.СписаниеСРасчетногоСчета
	|			ТОГДА ""БАНК""
	|		ИНАЧЕ ""КАССА""
	|	КОНЕЦ КАК ТипДокумента,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчетВыданныеАвансы.СуммаИзрасходованногоАванса > 0
	|			ТОГДА АвансовыйОтчетВыданныеАвансы.СуммаИзрасходованногоАванса
	|		ИНАЧЕ АвансовыйОтчетВыданныеАвансы.ДокументАванса.СуммаДокумента
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	Документ.АвансовыйОтчет.ВыданныеАвансы КАК АвансовыйОтчетВыданныеАвансы
	|ГДЕ
	|	АвансовыйОтчетВыданныеАвансы.Ссылка В(&МассивОбъектов)";
	
	ДокументыАвансов = Запрос.Выполнить().Выбрать();
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
	Если ДанныеДокументов.ЕстьВалютные Тогда
		
		Запрос.УстановитьПараметр("НачалоПериода",    ДанныеДокументов.НачалоПериода);
		Запрос.УстановитьПараметр("ОкончаниеПериода", ДанныеДокументов.ОкончаниеПериода);
		Запрос.УстановитьПараметр("Организации",      ДанныеДокументов.Организации);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаДт,
		|	0 КАК СуммаКт,
		|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			Регистратор,
		|			СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
		|			СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВал),
		|			,
		|			Организация В (&Организации)
		|				И ВалютаКт <> &ВалютаРеглУчета
		|				И ВЫРАЗИТЬ(СубконтоДт1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.КурсовыеРазницы)) КАК ХозрасчетныйОборотыДтКт
		|ГДЕ
		|	ХозрасчетныйОборотыДтКт.Регистратор В(&МассивОбъектов)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	0,
		|	ХозрасчетныйОборотыДтКт.СуммаОборот,
		|	ХозрасчетныйОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|			&НачалоПериода,
		|			&ОкончаниеПериода,
		|			Регистратор,
		|			СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВал),
		|			,
		|			СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
		|			Организация В (&Организации)
		|				И ВалютаДт <> &ВалютаРеглУчета
		|				И ВЫРАЗИТЬ(СубконтоКт1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.КурсовыеРазницы)) КАК ХозрасчетныйОборотыДтКт
		|ГДЕ
		|	ХозрасчетныйОборотыДтКт.Регистратор В(&МассивОбъектов)";
		
		ЗапросПоВалютнымПроводкам = Запрос.Выполнить().Выбрать();
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Хозрасчетный.Регистратор КАК Регистратор,
	|	Хозрасчетный.СчетДт КАК СчетДт,
	|	Хозрасчетный.СчетКт КАК СчетКт,
	|	МИНИМУМ(Хозрасчетный.НомерСтроки) КАК НомерСтроки,
	|	СУММА(Хозрасчетный.Сумма) КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Регистратор В(&МассивОбъектов)
	|	И НЕ(Хозрасчетный.СчетДт.Забалансовый
	|				ИЛИ Хозрасчетный.СчетКт.Забалансовый)
	|
	|СГРУППИРОВАТЬ ПО
	|	Хозрасчетный.Регистратор,
	|	Хозрасчетный.СчетДт,
	|	Хозрасчетный.СчетКт
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ВыборкаПроводок = Запрос.Выполнить().Выбрать();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор КАК Регистратор,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего КАК Всего,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС КАК НДС,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС КАК НалоговаяБазаНДС
	|ПОМЕСТИТЬ РегистрСведенийРублевыеСуммыДокументовВВалюте
	|ИЗ
	|	РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|ГДЕ
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор,
	|	НомерСтрокиДокумента,
	|	ТабличнаяЧастьДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансовыйОтчет.Поставщик КАК Поставщик,
	|	АвансовыйОтчет.НомерВходящегоДокумента КАК ДокументНомер,
	|	АвансовыйОтчет.ДатаВходящегоДокумента КАК ДокументДата,
	|	АвансовыйОтчет.ВидДокВходящий КАК НаименованиеРасхода,
	|	СУММА(ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, ВЫБОР
	|				КОГДА АвансовыйОтчет.Ссылка.СуммаВключаетНДС
	|					ТОГДА ВЫБОР
	|							КОГДА АвансовыйОтчет.Ссылка.ВалютаДокумента = &ВалютаРеглУчета
	|								ТОГДА АвансовыйОтчет.Сумма
	|							ИНАЧЕ АвансовыйОтчет.Сумма * (АвансовыйОтчет.Ссылка.КурсДокумента / АвансовыйОтчет.Ссылка.КратностьДокумента)
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА АвансовыйОтчет.Ссылка.ВалютаДокумента = &ВалютаРеглУчета
	|							ТОГДА АвансовыйОтчет.Сумма + АвансовыйОтчет.СуммаНДС
	|						ИНАЧЕ (АвансовыйОтчет.Сумма + АвансовыйОтчет.СуммаНДС) * (АвансовыйОтчет.Ссылка.КурсДокумента / АвансовыйОтчет.Ссылка.КратностьДокумента)
	|					КОНЕЦ
	|			КОНЕЦ)) КАК ПоОтчету,
	|	СУММА(ВЫБОР
	|			КОГДА АвансовыйОтчет.Ссылка.ВалютаДокумента = &ВалютаРеглУчета
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА АвансовыйОтчет.Ссылка.СуммаВключаетНДС = ИСТИНА
	|						ТОГДА АвансовыйОтчет.Сумма
	|					ИНАЧЕ АвансовыйОтчет.Сумма + АвансовыйОтчет.СуммаНДС
	|				КОНЕЦ
	|		КОНЕЦ) КАК ПоОтчетуВВалюте,
	|	СУММА(ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, ВЫБОР
	|				КОГДА АвансовыйОтчет.Ссылка.ВалютаДокумента = &ВалютаРеглУчета
	|					ТОГДА АвансовыйОтчет.СуммаНДС
	|				ИНАЧЕ АвансовыйОтчет.СуммаНДС * (АвансовыйОтчет.Ссылка.КурсДокумента / АвансовыйОтчет.Ссылка.КратностьДокумента)
	|			КОНЕЦ)) КАК СуммаНДС,
	|	АвансовыйОтчет.СчетУчета.Код КАК СчетЗатрат,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.Ссылка.НДСНеВыделять
	|					И АвансовыйОтчет.СуммаНДС = 0
	|				ИЛИ АвансовыйОтчет.Ссылка.НДСВключенВСтоимость
	|					И (АвансовыйОтчет.СуммаНДС = 0
	|						ИЛИ АвансовыйОтчет.ПредъявленСФ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ АвансовыйОтчет.СчетУчетаНДС.Код
	|	КОНЕЦ КАК СчетНДС,
	|	АвансовыйОтчет.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДанныеАвансовогоОтчета
	|ИЗ
	|	Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО АвансовыйОтчет.Ссылка = РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор
	|			И АвансовыйОтчет.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары))
	|			И (АвансовыйОтчет.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	АвансовыйОтчет.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчет.Поставщик,
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	АвансовыйОтчет.ВидДокВходящий,
	|	АвансовыйОтчет.СчетУчета.Код,
	|	АвансовыйОтчет.Ссылка,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.Ссылка.НДСНеВыделять
	|					И АвансовыйОтчет.СуммаНДС = 0
	|				ИЛИ АвансовыйОтчет.Ссылка.НДСВключенВСтоимость
	|					И (АвансовыйОтчет.СуммаНДС = 0
	|						ИЛИ АвансовыйОтчет.ПредъявленСФ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ АвансовыйОтчет.СчетУчетаНДС.Код
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АвансовыйОтчет.Контрагент,
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	АвансовыйОтчет.ВидДокВходящий,
	|	СУММА(ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, ВЫБОР
	|				КОГДА АвансовыйОтчет.Ссылка.ВалютаДокумента = &ВалютаРеглУчета
	|					ТОГДА АвансовыйОтчет.Сумма
	|				ИНАЧЕ АвансовыйОтчет.СуммаВзаиморасчетов * (АвансовыйОтчет.КурсВзаиморасчетов / АвансовыйОтчет.КратностьВзаиморасчетов)
	|			КОНЕЦ)),
	|	СУММА(ВЫБОР
	|			КОГДА АвансовыйОтчет.Ссылка.ВалютаДокумента = &ВалютаРеглУчета
	|				ТОГДА 0
	|			ИНАЧЕ АвансовыйОтчет.СуммаВзаиморасчетов
	|		КОНЕЦ),
	|	СУММА(0),
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.СчетУчетаРасчетовСКонтрагентом.Код = АвансовыйОтчет.СчетУчетаРасчетовПоАвансам.Код
	|			ТОГДА АвансовыйОтчет.СчетУчетаРасчетовСКонтрагентом.Код
	|		ИНАЧЕ ВЫБОР
	|				КОГДА АвансовыйОтчет.СчетУчетаРасчетовСКонтрагентом = &ПустойСчет
	|					ТОГДА """"
	|				ИНАЧЕ АвансовыйОтчет.СчетУчетаРасчетовСКонтрагентом.Код
	|			КОНЕЦ + ВЫБОР
	|				КОГДА НЕ АвансовыйОтчет.СчетУчетаРасчетовСКонтрагентом = &ПустойСчет
	|						И НЕ АвансовыйОтчет.СчетУчетаРасчетовПоАвансам = &ПустойСчет
	|					ТОГДА "", ""
	|				ИНАЧЕ """"
	|			КОНЕЦ + ВЫБОР
	|				КОГДА АвансовыйОтчет.СчетУчетаРасчетовПоАвансам = &ПустойСчет
	|					ТОГДА """"
	|				ИНАЧЕ АвансовыйОтчет.СчетУчетаРасчетовПоАвансам.Код
	|			КОНЕЦ
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	АвансовыйОтчет.Ссылка
	|ИЗ
	|	Документ.АвансовыйОтчет.ОплатаПоставщикам КАК АвансовыйОтчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО АвансовыйОтчет.Ссылка = РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор
	|			И АвансовыйОтчет.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ОплатаПоставщикам))
	|			И (АвансовыйОтчет.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	АвансовыйОтчет.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчет.Контрагент,
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	АвансовыйОтчет.ВидДокВходящий,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.СчетУчетаРасчетовСКонтрагентом.Код = АвансовыйОтчет.СчетУчетаРасчетовПоАвансам.Код
	|			ТОГДА АвансовыйОтчет.СчетУчетаРасчетовСКонтрагентом.Код
	|		ИНАЧЕ ВЫБОР
	|				КОГДА АвансовыйОтчет.СчетУчетаРасчетовСКонтрагентом = &ПустойСчет
	|					ТОГДА """"
	|				ИНАЧЕ АвансовыйОтчет.СчетУчетаРасчетовСКонтрагентом.Код
	|			КОНЕЦ + ВЫБОР
	|				КОГДА НЕ АвансовыйОтчет.СчетУчетаРасчетовСКонтрагентом = &ПустойСчет
	|						И НЕ АвансовыйОтчет.СчетУчетаРасчетовПоАвансам = &ПустойСчет
	|					ТОГДА "", ""
	|				ИНАЧЕ """"
	|			КОНЕЦ + ВЫБОР
	|				КОГДА АвансовыйОтчет.СчетУчетаРасчетовПоАвансам = &ПустойСчет
	|					ТОГДА """"
	|				ИНАЧЕ АвансовыйОтчет.СчетУчетаРасчетовПоАвансам.Код
	|			КОНЕЦ
	|	КОНЕЦ,
	|	АвансовыйОтчет.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АвансовыйОтчет.Поставщик,
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	АвансовыйОтчет.ВидДокВходящий,
	|	СУММА(ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, ВЫБОР
	|				КОГДА АвансовыйОтчет.Ссылка.СуммаВключаетНДС
	|					ТОГДА ВЫБОР
	|							КОГДА АвансовыйОтчет.Ссылка.ВалютаДокумента = &ВалютаРеглУчета
	|								ТОГДА АвансовыйОтчет.Сумма
	|							ИНАЧЕ АвансовыйОтчет.Сумма * (АвансовыйОтчет.Ссылка.КурсДокумента / АвансовыйОтчет.Ссылка.КратностьДокумента)
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА АвансовыйОтчет.Ссылка.ВалютаДокумента = &ВалютаРеглУчета
	|							ТОГДА АвансовыйОтчет.Сумма + АвансовыйОтчет.СуммаНДС
	|						ИНАЧЕ (АвансовыйОтчет.Сумма + АвансовыйОтчет.СуммаНДС) * (АвансовыйОтчет.Ссылка.КурсДокумента / АвансовыйОтчет.Ссылка.КратностьДокумента)
	|					КОНЕЦ
	|			КОНЕЦ)),
	|	СУММА(ВЫБОР
	|			КОГДА АвансовыйОтчет.Ссылка.ВалютаДокумента = &ВалютаРеглУчета
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА АвансовыйОтчет.Ссылка.СуммаВключаетНДС = ИСТИНА
	|						ТОГДА АвансовыйОтчет.Сумма
	|					ИНАЧЕ АвансовыйОтчет.Сумма + АвансовыйОтчет.СуммаНДС
	|				КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, ВЫБОР
	|				КОГДА АвансовыйОтчет.Ссылка.ВалютаДокумента = &ВалютаРеглУчета
	|					ТОГДА АвансовыйОтчет.СуммаНДС
	|				ИНАЧЕ АвансовыйОтчет.СуммаНДС * (АвансовыйОтчет.Ссылка.КурсДокумента / АвансовыйОтчет.Ссылка.КратностьДокумента)
	|			КОНЕЦ)),
	|	АвансовыйОтчет.СчетЗатрат.Код,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.Ссылка.НДСНеВыделять
	|					И АвансовыйОтчет.СуммаНДС = 0
	|				ИЛИ АвансовыйОтчет.Ссылка.НДСВключенВСтоимость
	|					И (АвансовыйОтчет.СуммаНДС = 0
	|						ИЛИ АвансовыйОтчет.ПредъявленСФ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ АвансовыйОтчет.СчетУчетаНДС.Код
	|	КОНЕЦ,
	|	АвансовыйОтчет.Ссылка
	|ИЗ
	|	Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО АвансовыйОтчет.Ссылка = РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор
	|			И АвансовыйОтчет.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Прочее))
	|			И (АвансовыйОтчет.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
	|ГДЕ
	|	АвансовыйОтчет.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчет.Поставщик,
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	АвансовыйОтчет.ВидДокВходящий,
	|	АвансовыйОтчет.СчетЗатрат.Код,
	|	АвансовыйОтчет.Ссылка,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.Ссылка.НДСНеВыделять
	|					И АвансовыйОтчет.СуммаНДС = 0
	|				ИЛИ АвансовыйОтчет.Ссылка.НДСВключенВСтоимость
	|					И (АвансовыйОтчет.СуммаНДС = 0
	|						ИЛИ АвансовыйОтчет.ПредъявленСФ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ АвансовыйОтчет.СчетУчетаНДС.Код
	|	КОНЕЦ";
	
	Запрос.Выполнить();
	
	// Свертка сумм по документам, подтверждающим расходы.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеАвансовогоОтчета.Ссылка КАК Ссылка,
	|	ДанныеАвансовогоОтчета.Поставщик КАК Поставщик,
	|	ДанныеАвансовогоОтчета.ДокументНомер КАК ДокументНомер,
	|	ДанныеАвансовогоОтчета.ДокументДата КАК ДокументДата,
	|	ДанныеАвансовогоОтчета.НаименованиеРасхода КАК НаименованиеРасхода,
	|	СУММА(ДанныеАвансовогоОтчета.ПоОтчету) КАК ПоОтчету,
	|	СУММА(ДанныеАвансовогоОтчета.ПоОтчетуВВалюте) КАК ПоОтчетуВВалюте,
	|	СУММА(ДанныеАвансовогоОтчета.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	ДанныеАвансовогоОтчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеАвансовогоОтчета.Ссылка,
	|	ДанныеАвансовогоОтчета.Поставщик,
	|	ДанныеАвансовогоОтчета.ДокументНомер,
	|	ДанныеАвансовогоОтчета.ДокументДата,
	|	ДанныеАвансовогоОтчета.НаименованиеРасхода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументДата,
	|	ДокументНомер";
	
	ВыборкаПоТоварам = Запрос.Выполнить().Выбрать();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АвансовыйОтчет.Ссылка КАК Ссылка,
	|	АвансовыйОтчет.ЗаРубежом КАК ЗаРубежом,
	|	СУММА(АвансовыйОтчет.Сумма - АвансовыйОтчет.СуммаСверхНормы) КАК СуммаВПределахНормы,
	|	СУММА(АвансовыйОтчет.СуммаСверхНормы) КАК СуммаСверхНормы
	|ИЗ
	|	Документ.АвансовыйОтчет.Суточные КАК АвансовыйОтчет
	|ГДЕ
	|	АвансовыйОтчет.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчет.Ссылка,
	|	АвансовыйОтчет.ЗаРубежом
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	ВыборкаСуточные = Запрос.Выполнить().Выбрать();
	
	// Выборка уникальных счетов учета по документам, подтверждающим расходы
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеАвансовогоОтчета.Ссылка КАК Ссылка,
	|	ДанныеАвансовогоОтчета.Поставщик КАК Поставщик,
	|	ДанныеАвансовогоОтчета.ДокументНомер КАК ДокументНомер,
	|	ДанныеАвансовогоОтчета.ДокументДата КАК ДокументДата,
	|	ДанныеАвансовогоОтчета.НаименованиеРасхода КАК НаименованиеРасхода,
	|	ДанныеАвансовогоОтчета.СчетЗатрат КАК Счет
	|ИЗ
	|	ДанныеАвансовогоОтчета КАК ДанныеАвансовогоОтчета
	|ГДЕ
	|	ДанныеАвансовогоОтчета.СчетЗатрат <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеАвансовогоОтчета.Ссылка,
	|	ДанныеАвансовогоОтчета.Поставщик,
	|	ДанныеАвансовогоОтчета.ДокументНомер,
	|	ДанныеАвансовогоОтчета.ДокументДата,
	|	ДанныеАвансовогоОтчета.НаименованиеРасхода,
	|	ДанныеАвансовогоОтчета.СчетНДС
	|ИЗ
	|	ДанныеАвансовогоОтчета КАК ДанныеАвансовогоОтчета
	|ГДЕ
	|	ДанныеАвансовогоОтчета.СчетНДС <> НЕОПРЕДЕЛЕНО
	|
	|УПОРЯДОЧИТЬ ПО
	|	Счет";
	
	ВыборкаСчетов  = Запрос.Выполнить().Выбрать();
	ПервыйДокумент = Истина;
	
	Субсчета71     = БухгалтерскийУчетПовтИсп.СчетаВИерархии(
		ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами);
	Субсчета71Вал  = БухгалтерскийУчетПовтИсп.СчетаВИерархии(
		ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВал);
	
	Пока Шапка.Следующий() Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АвансовыйОтчет.ПФ_MXL_АвансовыйОтчет");

		#Вставка
		//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
		//++#1304 смарт: Демичев 01022023
		//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АвансовыйОтчет.ПФ_MXL_АвансовыйОтчет");
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АвансовыйОтчет.ПФ_MXL_смартАвансовыйОтчет");		
		//--#1304 смарт: Демичев 01022023
		//-- #Б-1828 смарт: Лопато 09.01.2025
		#КонецВставки
		
		// ТИТУЛЬНЫЙ ЛИСТ
		СтруктураРасчетаАванса = НовыеПараметрыРасчетаОстаткаАванса();
		ЗаполнитьЗначенияСвойств(СтруктураРасчетаАванса, Шапка);
		
		ДокументВВалюте = Шапка.ВалютаДокумента <> ВалютаРегламентированногоУчета;
		Если ДокументВВалюте Тогда
			СтруктураРасчетаАванса.Вставить("Субсчета71", Субсчета71Вал);
		Иначе
			СтруктураРасчетаАванса.Вставить("Субсчета71", Субсчета71);
		КонецЕсли;
		
		СуммаДоДокумента = ПредыдущийАвансПодотчетногоЛица(СтруктураРасчетаАванса);
		
		КурсыДокумента = Новый Структура("Курс, Кратность", 1, 1);
		КурсыДокумента.Курс = ЗаполнениеДокументов.КурсДокумента(Шапка.Ссылка, ВалютаРегламентированногоУчета);
		КурсыДокумента.Кратность = ЗаполнениеДокументов.КратностьДокумента(Шапка.Ссылка, ВалютаРегламентированногоУчета);
		
		Если Не ЗначениеЗаполнено(КурсыДокумента.Кратность) Тогда
			КурсыДокумента.Кратность = 1;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КурсыДокумента.Курс) Тогда
			КурсыДокумента.Курс = 1;
		КонецЕсли;
		
		ПолученоИзКассы = 0;
		ПолученоИзКассыПоКартам = 0;
		
		ПолученоИзКассыРуб = 0;
		ПолученоИзКассыПоКартамРуб = 0;
		
		ДокументыАвансов.Сбросить();
		Пока ДокументыАвансов.НайтиСледующий(Новый Структура("АвансовыйОтчет", Шапка.Ссылка)) Цикл
			ДобавленнаяСумма = ?(ЗначениеЗаполнено(ДокументыАвансов.Сумма), ДокументыАвансов.Сумма, 0);
			Если ДокументыАвансов.ТипДокумента = "КАССА" Тогда
				ПолученоИзКассы = ПолученоИзКассы + ДобавленнаяСумма;
			Иначе
				ПолученоИзКассыПоКартам = ПолученоИзКассыПоКартам + ДобавленнаяСумма;
			КонецЕсли;
			
			Если ДокументВВалюте Тогда
				Если Шапка.КурсРассчитывается Тогда
					КурсАванса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДокумента, ДокументыАвансов.ДокументАвансаДата);
				Иначе
					КурсАванса = КурсыДокумента;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(КурсАванса.Курс) Тогда
					КурсАванса.Курс = 1;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(КурсАванса.Кратность) Тогда
					КурсАванса.Кратность = 1;
				КонецЕсли;
				
				ДобавленнаяСуммаРуб = Окр(ДобавленнаяСумма * КурсАванса.Курс / КурсАванса.Кратность, 2, 1);
				Если ДокументыАвансов.ТипДокумента = "КАССА" Тогда
					ПолученоИзКассыРуб = ПолученоИзКассыРуб + ДобавленнаяСуммаРуб;
				Иначе
					ПолученоИзКассыПоКартамРуб = ПолученоИзКассыПоКартамРуб + ДобавленнаяСуммаРуб;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Титул");
		
		КурсНаДатуДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДокумента, Шапка.ДатаДокумента);
		ВалютныйОстатокПоАвансу = СтруктураВалютногоОстаткаПоАвансу(СтруктураРасчетаАванса, КурсНаДатуДокумента);
		
		КурсДокумента      = ВалютныйОстатокПоАвансу.Курс;
		КратностьДокумента = ВалютныйОстатокПоАвансу.Кратность;
		КурсоваяРазница = 0;
		
		Если ДокументВВалюте Тогда
			ВсегоПолученоАванса = ПолученоИзКассы + ПолученоИзКассыПоКартам;
			ВсегоПолученоАвансаРуб = ПолученоИзКассыРуб + ПолученоИзКассыПоКартамРуб;
			Если ВсегоПолученоАвансаРуб > 0 Тогда
				КурсДокумента = Окр(ВсегоПолученоАвансаРуб / ВсегоПолученоАванса * КратностьДокумента, 4, 1);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВалютныйОстатокПоАвансу.ВалютнаяСуммаОстаток)
				И ВалютныйОстатокПоАвансу.ВалютнаяСуммаОстаток = ВсегоПолученоАванса Тогда
				Разница = ВалютныйОстатокПоАвансу.СуммаОстаток - ВсегоПолученоАвансаРуб;
				Если ПолученоИзКассыРуб > 0 Тогда
					ПолученоИзКассыРуб = ПолученоИзКассыРуб + Разница;
				Иначе
					ПолученоИзКассыПоКартамРуб = ПолученоИзКассыПоКартамРуб + Разница;
				КонецЕсли;
			КонецЕсли;
			
			ОбластьМакета.Параметры.ПредставлениеВалютыДокумента   = Шапка.ПредставлениеВалюты;
			ОбластьМакета.Параметры.ПолученоИзКассыВВалюте         = ПолученоИзКассы;
			ОбластьМакета.Параметры.ПолученоИзКассыВВалютеПоКартам = ПолученоИзКассыПоКартам;
			
			ПолученоИзКассы         = ПолученоИзКассыРуб;
			ПолученоИзКассыПоКартам = ПолученоИзКассыПоКартамРуб;
			
			ЗапросПоВалютнымПроводкам.Сбросить();
			Если ЗапросПоВалютнымПроводкам.НайтиСледующий(Новый Структура("Регистратор", Шапка.Ссылка)) Тогда
				КурсоваяРазница = ЗапросПоВалютнымПроводкам.СуммаДт - ЗапросПоВалютнымПроводкам.СуммаКт;
			КонецЕсли;
			
			// курсовую разницу не разделяем по видам полученных средств
			Если ПолученоИзКассы > 0 Тогда
				ПолученоИзКассы = ПолученоИзКассы + КурсоваяРазница;
			Иначе
				ПолученоИзКассыПоКартам = ПолученоИзКассыПоКартам + КурсоваяРазница;
			КонецЕсли;
			
			ВсегоПолученоАвансаРуб = ПолученоИзКассы + ПолученоИзКассыПоКартам;
			
			Израсходовано = ИтогоПоУчету(ВыборкаПроводок, Шапка.Ссылка);
			Если Израсходовано = 0 Тогда // из проводок сумму получить не удалось, возможно документ не проведен
				Если ВсегоПолученоАванса = Шапка.СуммаДокумента Тогда
					// Израсходовано столько же, сколько было выдано аванса, а значит и рублевая оценка одинаковая.
					Израсходовано = ВсегоПолученоАвансаРуб;
				Иначе
					Израсходовано = Окр(Шапка.СуммаДокумента * КурсДокумента / КратностьДокумента, 2) + КурсоваяРазница;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Израсходовано = Шапка.СуммаДокумента;
		КонецЕсли;
		
		ИтогоПолучено = ПолученоИзКассы + ПолученоИзКассыПоКартам;
		
		СуммаДоДокумента = СуммаДоДокумента - ИтогоПолучено;
		
		// Выводим титульный лист авансового отчета
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		Если СуммаДоДокумента >= 0 Тогда
			ОбластьМакета.Параметры.НачальныйОстаток    =  СуммаДоДокумента;
		Иначе
			ОбластьМакета.Параметры.НачальныйПерерасход = -СуммаДоДокумента;
		КонецЕсли;
		
		ОбластьМакета.Параметры.ИтогоПолучено = ИтогоПолучено;
		ОбластьМакета.Параметры.Израсходовано = Израсходовано;
		ОстатокНаКонец = СуммаДоДокумента + ИтогоПолучено - Израсходовано;
		Если ОстатокНаКонец >= 0  Тогда
			ОбластьМакета.Параметры.КонечныйОстаток    =  ОстатокНаКонец;
		Иначе
			ОбластьМакета.Параметры.КонечныйПерерасход = -ОстатокНаКонец;
		КонецЕсли;
		
		СтруктураДанных = НовыеПараметрыЗаполненияПечатнойФормыАвансовогоОтчета();
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Шапка);
		
		СтруктураДанных.Вставить("СуммаДокументаРуб", Израсходовано);
		
		ОбщиеПараметры = ПараметрыЗаполненияПечатнойФормыАвансовыйОтчет(СтруктураДанных, ВалютныйОстатокПоАвансу);
		ОбщиеПараметры.Вставить("ПолученоИзКассы",         ПолученоИзКассы);
		ОбщиеПараметры.Вставить("ПолученоИзКассыПоКартам", ПолученоИзКассыПоКартам);
		ОбщиеПараметры.Вставить("КоличествоДокументов",    Шапка.КоличествоДокументов);
		ОбщиеПараметры.Вставить("КоличествоЛистов",        Шапка.КоличествоЛистов);
		
		ОбластьМакета.Параметры.Заполнить(ОбщиеПараметры);
		ОбластьМакета.Параметры.Заполнить(ПараметрыБухгалтерскойЗаписиПриПечатиАвансовогоОтчета(
			ВыборкаПроводок, Шапка.Ссылка));
			
		#Вставка
		//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
		//++#1304 смарт: Демичев 01022023 		
				
		смартПодписиАвансовыхОтчетовДок =  Шапка.Ссылка.смартПодписиАвансовыхОтчетов;
		
		смартПодписиАвансовыхОтчетов = Неопределено;
		
		Если ЗначениеЗаполнено(смартПодписиАвансовыхОтчетовДок)  Тогда
			
			смартПодписиАвансовыхОтчетов = смартПодписиАвансовыхОтчетовДок;
						
		Иначе
			
			ДанныеПодотчетногоЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
			Шапка.Организация, Шапка.ПодотчетноеЛицо, Шапка.ДатаДокумента);
			
			ПодразделениеСотрудника = ДанныеПодотчетногоЛица.ПодразделениеОрганизации;
			
			Если ЗначениеЗаполнено(ПодразделениеСотрудника) и ЗначениеЗаполнено(ПодразделениеСотрудника.смартПодписиАвансовыхОтчетов) Тогда
				
				смартПодписиАвансовыхОтчетов = ПодразделениеСотрудника.смартПодписиАвансовыхОтчетов;
							
			КонецЕсли;
			
		КонецЕсли;
		
		Если смартПодписиАвансовыхОтчетов <> Неопределено Тогда
			
			ОбластьМакета.Параметры.ДолжностьРуководителяПредставление =  Строка(смартПодписиАвансовыхОтчетов.ОснованиеПодписи);
			ОбластьМакета.Параметры.РуководительПредставление		   =  Строка(смартПодписиАвансовыхОтчетов.ФизическоеЛицо.Наименование);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Шапка.Ссылка.Ответственный) Тогда
			
			смартОтветственный = Шапка.Ссылка.Ответственный;
			
			Если  ЗначениеЗаполнено(смартОтветственный.ФизическоеЛицо) Тогда    
				
				смартДанныеОтветственногоЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
				Шапка.Организация,  смартОтветственный.ФизическоеЛицо, Шапка.ДатаДокумента);
				
				ОбластьМакета.Параметры.смартПредставлениеОтветственного = смартДанныеОтветственногоЛица.Представление; 
								
			Иначе	
				
				// Получим из Фамилия Имя Отчество => Фамилия И.О.
				смартФИО_ОтветственногоПользователь = смартОтветственный.Наименование;
				
				Пока Найти(смартФИО_ОтветственногоПользователь, "  ") <> 0 Цикл
					смартФИО_ОтветственногоПользователь = СтрЗаменить(смартФИО_ОтветственногоПользователь,"  "," ");
				КонецЦикла;
				
				смартФИО_ОтветственногоПолностью = СтрЗаменить(смартФИО_ОтветственногоПользователь," ",Символы.ПС);
				
				смартФИО_Ответственного = СтрПолучитьСтроку(смартФИО_ОтветственногоПолностью,1)+" "+Лев(СтрПолучитьСтроку(смартФИО_ОтветственногоПолностью,2),1) + "."+Лев(СтрПолучитьСтроку(смартФИО_ОтветственногоПолностью,3),1) + ".";
	
				ОбластьМакета.Параметры.смартПредставлениеОтветственного = смартФИО_Ответственного;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//--#1304 смарт: Демичев 01022023	
		//-- #Б-1828 смарт: Лопато 09.01.2025
		#КонецВставки
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// ОБОРОТНАЯ СТОРОНА
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим табличные части
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		НомерСтроки   = 0;
		
		ИтогоПоОтчету        = 0;
		ИтогоПоОтчетуВВалюте = 0;
		
		ВыборкаПоТоварам.Сбросить();
		Пока ВыборкаПоТоварам.НайтиСледующий(Новый Структура("Ссылка", Шапка.Ссылка)) Цикл
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаПоТоварам);
			НомерСтроки = НомерСтроки + 1;
			ОбластьМакета.Параметры.НомерСтроки         = НомерСтроки;
			ОбластьМакета.Параметры.ДокументДата        = ВыборкаПоТоварам.ДокументДата;
			ОбластьМакета.Параметры.НаименованиеРасхода = СокрЛП(ВыборкаПоТоварам.НаименованиеРасхода);
			ОбластьМакета.Параметры.ДебетСубСчета 		= "";
			
			СтруктураПоиска = Новый Структура();
			СтруктураПоиска.Вставить("Поставщик",           ВыборкаПоТоварам.Поставщик);
			СтруктураПоиска.Вставить("ДокументНомер",       ВыборкаПоТоварам.ДокументНомер);
			СтруктураПоиска.Вставить("ДокументДата",        ВыборкаПоТоварам.ДокументДата);
			СтруктураПоиска.Вставить("НаименованиеРасхода", ВыборкаПоТоварам.НаименованиеРасхода);
			СтруктураПоиска.Вставить("Ссылка",              Шапка.Ссылка);
			
			ВыборкаСчетов.Сбросить();
			Пока ВыборкаСчетов.НайтиСледующий(СтруктураПоиска) Цикл
				ОбластьМакета.Параметры.ДебетСубСчета = ОбластьМакета.Параметры.ДебетСубСчета
					+ ?(ПустаяСтрока(ОбластьМакета.Параметры.ДебетСубСчета), "", ", ")
					+ ВыборкаСчетов.Счет;
			КонецЦикла;
			
			Сумма = ВыборкаПоТоварам.ПоОтчету;
			
			ОбластьМакета.Параметры.ПоОтчету = Сумма;
			ОбластьМакета.Параметры.ПоУчету  = Сумма;
			
			ИтогоПоОтчету = ИтогоПоОтчету + Сумма;
			
			Если Шапка.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
				
				СуммаВВалюте = ВыборкаПоТоварам.ПоОтчетуВВалюте;
				
				ОбластьМакета.Параметры.ПоУчетуВВалюте  = СуммаВВалюте;
				ОбластьМакета.Параметры.ПоОтчетуВВалюте = СуммаВВалюте;
				
				ИтогоПоОтчетуВВалюте = ИтогоПоОтчетуВВалюте + СуммаВВалюте;
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
				
		ШаблонНаименованияРасхода = НСтр("ru='Авансовый отчет (%1)'");
		ШаблонОписанияСуточныхВПределахНорм = НСтр("ru='суточные %1'");
		ШаблонОписанияСуточныхСверхНорм = НСтр("ru='суточные %1 сверх нормы'");
		
		Пока ВыборкаСуточные.НайтиСледующий(Новый Структура("Ссылка", Шапка.Ссылка)) Цикл
			
			ОписаниеСуточных = СтрШаблон(
				ШаблонОписанияСуточныхВПределахНорм,
				?(ВыборкаСуточные.ЗаРубежом, НСтр("ru='за рубежом'"), НСтр("ru='по России'")));
							
			НаименованиеРасхода = СтрШаблон(ШаблонНаименованияРасхода, СокрЛП(ОписаниеСуточных));
				
			НомерСтроки = НомерСтроки + 1;
			ОбластьМакета.Параметры.НомерСтроки         = НомерСтроки;
			ОбластьМакета.Параметры.ДокументДата        = Шапка.ДатаДокумента;
			ОбластьМакета.Параметры.ДокументНомер       = Шапка.Номер;
			ОбластьМакета.Параметры.НаименованиеРасхода = НаименованиеРасхода;
			ОбластьМакета.Параметры.ДебетСубСчета 		= Шапка.СчетЗатрат;
						
			Сумма = ВыборкаСуточные.СуммаВПределахНормы;
			
			ОбластьМакета.Параметры.ПоОтчету = Сумма;
			ОбластьМакета.Параметры.ПоУчету  = Сумма;
			
			ИтогоПоОтчету = ИтогоПоОтчету + Сумма;
						
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выведем строку суточных сверх нормы
			Если ВыборкаСуточные.СуммаСверхНормы > 0 Тогда
				
				ОписаниеСуточных = СтрШаблон(
					ШаблонОписанияСуточныхСверхНорм,
					?(ВыборкаСуточные.ЗаРубежом, НСтр("ru='за рубежом'"), НСтр("ru='по России'")));
									
				НаименованиеРасхода = СтрШаблон(ШаблонНаименованияРасхода, СокрЛП(ОписаниеСуточных));
				
				НомерСтроки = НомерСтроки + 1;
				ОбластьМакета.Параметры.НомерСтроки         = НомерСтроки;
				ОбластьМакета.Параметры.ДокументДата        = Шапка.ДатаДокумента;
				ОбластьМакета.Параметры.ДокументНомер       = Шапка.Номер;
				ОбластьМакета.Параметры.НаименованиеРасхода = НаименованиеРасхода;
				ОбластьМакета.Параметры.ДебетСубСчета 		= Шапка.СчетЗатрат;
							
				Сумма = ВыборкаСуточные.СуммаСверхНормы;
				
				ОбластьМакета.Параметры.ПоОтчету = Сумма;
				ОбластьМакета.Параметры.ПоУчету  = Сумма;
				
				ИтогоПоОтчету = ИтогоПоОтчету + Сумма;
							
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЕсли;	
			
		КонецЦикла;	
		
		// Выводим подвал авансового отчета
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.Заполнить(ОбщиеПараметры);
		ОбластьМакета.Параметры.ИтогоПоОтчету        = ИтогоПоОтчету;
		ОбластьМакета.Параметры.ИтогоПоОтчетуВВалюте = ИтогоПоОтчетуВВалюте;
		ОбластьМакета.Параметры.ИтогоПоУчету         = ИтогоПоОтчету;
		ОбластьМакета.Параметры.ИтогоПоУчетувВалюте  = ИтогоПоОтчетуВВалюте;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти