
#Область ПеренесеноСДоработкамиСмарт

&После("ОбработкаЗаполнения")
Процедура смарт_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	//++#1304 смарт: Демичев 01022023
	смартЗаполнениесмартПодписиАвансовыхОтчетов();
	//--#1304 смарт: Демичев 01022023

КонецПроцедуры

&После("ПриКопировании")
Процедура смарт_ПриКопировании(ОбъектКопирования)
	
	//++#1304 смарт: Демичев 01022023
	смартЗаполнениесмартПодписиАвансовыхОтчетов();
	//--#1304 смарт: Демичев 01022023
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++#1304 смарт: Демичев 01022023
Процедура смартЗаполнениесмартПодписиАвансовыхОтчетов() Экспорт
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Организация) и ЗначениеЗаполнено(ЭтотОбъект.ФизЛицо) и ЗначениеЗаполнено(ЭтотОбъект.Дата) Тогда
		
		ДанныеПодотчетногоЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
		ЭтотОбъект.Организация, ЭтотОбъект.ФизЛицо, ЭтотОбъект.Дата);
		
		ПодразделениеСотрудника = ДанныеПодотчетногоЛица.ПодразделениеОрганизации;
		
		Если ЗначениеЗаполнено(ПодразделениеСотрудника) и ЗначениеЗаполнено(ПодразделениеСотрудника.смартПодписиАвансовыхОтчетов) Тогда
			
			ЭтотОбъект.смартПодписиАвансовыхОтчетов = ПодразделениеСотрудника.смартПодписиАвансовыхОтчетов;
			
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры	//--#1304 смарт: Демичев 01022023

#КонецОбласти
