
#Область ПересеноСДоработкамиСмарт
	
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 10.02.2021 22:06:27
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
		|	смартОтправленыВУТ.Сообщение КАК Сообщение,
		|	смартОтправленыВУТ.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.смартОтправленыВУТ КАК смартОтправленыВУТ
		|ГДЕ
		|	смартОтправленыВУТ.ОбъектОтправки = &ОбъектОтправки";
		
		Запрос.УстановитьПараметр("ОбъектОтправки", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартСтатус", Тип("ДекорацияФормы"),Элементы.ГруппаШапкаПравая);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			Если ВыборкаДетальныеЗаписи.Статус Тогда
				НовыйЭлемент.ЦветТекста=Новый Цвет(0,194,0);
			иначе
				НовыйЭлемент.ЦветТекста=Новый Цвет(255,0,0);
			КонецЕсли; 
			НовыйЭлемент.Заголовок = ВыборкаДетальныеЗаписи.Сообщение;
		КонецЕсли;	
	КонецЕсли; 
	//-- Смарт }Подкин Алексей Иванович 10.02.2021 22:06:27
	
КонецПроцедуры

#КонецОбласти