
#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Фролов+ 
	смартУстановитьДоступностьЭлементовОтПодписи(Истина);

	Если СтатусДокумента Тогда 
		Документы.РеализацияТоваровУслуг.смартДобавитьРеквизитОтветственныйЗаПодписьДокумента(Объект.Ссылка,ЭтаФорма,Элементы.ГруппаИтогиРеквизитыОрганизацииКонтрагента,Элементы.ГруппаПодписанИтоги);
	
		Если смартИмяФайлаДляЭлектронногоАрхива = "" Тогда
			смартИмяФайлаДляЭлектронногоАрхива = смартПолучитьИмяФайлаДляБуфераОбмена();
		КонецЕсли;
	КонецЕсли;
	
	Элементы.смартИмяФайлаДляЭлектронногоАрхива.Видимость = СтатусДокумента;
	// Фролов-
КонецПроцедуры

&НаСервере
Процедура смарт_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Фролов+
	Если Не Отказ И СтатусДокумента Тогда 
		Документы.РеализацияТоваровУслуг.смартУстановитьПодписавшегоДокумент(Объект.Ссылка);
	КонецЕсли;	
	// Фролов-
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

// Фролов+
&НаСервере
Процедура смартУстановитьДоступностьЭлементовОтПодписи(ОткрытиеФормы=Ложь)
	Если Не (РольДоступна("ПолныеПрава") Или РольДоступна("смартИзменениеДокументПодписан")) Тогда 
		Элементы.ГруппаШапка.ТолькоПросмотр=СтатусДокумента;
		Элементы.Услуги.ТолькоПросмотр=СтатусДокумента;
		Элементы.СтатусДокумента.ТолькоПросмотр=ОткрытиеФормы И СтатусДокумента;
	КонецЕсли;
КонецПроцедуры	

// Фролов+
&НаКлиенте
Процедура смартСтатусДокументаПриИзмененииПосле(Элемент)
	Если СтатусДокумента Тогда 
		смартПроверитьИПодготовитьДанныеДляКопированияВБуферОбмена();
	Иначе
		Если Не Элементы.Найти("ОтветственныйЗаПодпись")=Неопределено Тогда 
			смартУдалитьРеквизитФормы("ОтветственныйЗаПодпись");
		КонецЕсли;
		Если Не Элементы.Найти("смартСкопироватьВБуферОбмена")=Неопределено Тогда 
			смартУдалитьКнопкуДляКопированияИмениФайлаВБуферОбмена();
		КонецЕсли;
		Если Не Элементы.Найти("ОтветственныйЗаПодпись")=Неопределено Тогда 
			смартУдалитьРеквизитФормы("ОтветственныйЗаПодпись");
		КонецЕсли;
	КонецЕсли;
	смартУстановитьДоступностьЭлементовОтПодписи();
КонецПроцедуры

// Фролов+
&НаКлиенте
Процедура смартСкопироватьВБуферОбмена(Команда)
	смартДобавитьРеквизитБуфераОбмена();
	Если Элементы.БФ.Документ.parentWindow = Неопределено Тогда
		Элементы.смартИмяФайлаДляЭлектронногоАрхива.Видимость = Истина;
		смартИмяФайлаДляЭлектронногоАрхива = смартПолучитьИмяФайлаДляБуфераОбмена();
	Иначе
		Элементы.БФ.Документ.parentWindow.clipboardData.SetData("Text",смартПолучитьИмяФайлаДляБуфераОбмена());
	КонецЕсли;
	смартУдалитьРеквизитФормы("БФ");
КонецПроцедуры	

// Фролов+
&НаСервере
Процедура смартПроверитьИПодготовитьДанныеДляКопированияВБуферОбмена()
	ДанныеПроверки=Документы.РеализацияТоваровУслуг.смартЕстьВозможностьПодписатьДокумент(Объект.Ссылка,Объект.СчетНаОплатуПокупателю,СчетФактура);
	Если ДанныеПроверки.Результат Тогда 
		смартСоздатьКнопкуДляКопированияИмениФайлаВБуферОбмена();
		Документы.РеализацияТоваровУслуг.смартДобавитьРеквизитОтветственныйЗаПодписьДокумента(Объект.Ссылка,ЭтаФорма,Элементы.ГруппаИтогиРеквизитыОрганизацииКонтрагента,Элементы.ГруппаПодписанИтоги,Истина);
	Иначе
		Для Каждого Ошибка Из ДанныеПроверки.Ошибки Цикл 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка);
		КонецЦикла;
		СтатусДокумента=Ложь;
	КонецЕсли;
КонецПроцедуры	

// Фролов+
&НаСервере
Функция смартПолучитьИмяФайлаДляБуфераОбмена()
	ИмяКонтрагента=Лев(СокрЛП(СтрЗаменить(Объект.Контрагент.Наименование,"ООО","")),100);
	Возврат "СФ "+СчетФактура.Номер+" "+Формат(СчетФактура.Дата,"ДЛФ=D")+" (Счет "+Объект.СчетНаОплатуПокупателю.Номер+" "+Формат(Объект.СчетНаОплатуПокупателю.Дата,"ДЛФ=D")+") "+ИмяКонтрагента;
КонецФункции	

// Фролов+
&НаСервере
Процедура смартСоздатьКнопкуДляКопированияИмениФайлаВБуферОбмена()
	Если ЭтаФорма.Команды.Найти("смартСкопироватьВБуферОбмена")=Неопределено Тогда 
		Кмд=ЭтаФорма.Команды.Добавить("смартСкопироватьВБуферОбмена");
		Кмд.Действие="смартСкопироватьВБуферОбмена";
		Кмд.Заголовок="Сгенерировать имя файла";
	КонецЕсли;
	
	Если ЭтаФорма.Элементы.Найти("смартСкопироватьВБуферОбмена")=Неопределено Тогда 
		Эл=ЭтаФорма.Элементы.Вставить("смартСкопироватьВБуферОбмена",Тип("КнопкаФормы"),Элементы.ГруппаИтогиРеквизитыОрганизацииКонтрагента,Элементы.ГруппаПодписанИтоги);
		Эл.Вид=ВидКнопкиФормы.ОбычнаяКнопка;
		Эл.ИмяКоманды="смартСкопироватьВБуферОбмена";
	КонецЕсли;
КонецПроцедуры

// Фролов+
&НаСервере
Процедура смартУдалитьКнопкуДляКопированияИмениФайлаВБуферОбмена()
	Кмд=ЭтаФорма.Команды.Найти("смартСкопироватьВБуферОбмена");
	Если Не Кмд=Неопределено Тогда
		ЭтаФорма.Команды.Удалить(Кмд);
	КонецЕсли;
	Эл=ЭтаФорма.Элементы.Найти("смартСкопироватьВБуферОбмена");
	Если Не Эл=Неопределено Тогда 
		ЭтаФорма.Элементы.Удалить(Эл);
	КонецЕсли;	
КонецПроцедуры	

// Фролов+
&НаСервере
Процедура смартДобавитьРеквизитБуфераОбмена()
	М=Новый Массив;
	М.Добавить(Новый РеквизитФормы("БФ",Новый ОписаниеТипов("Строка")));
	ЭтаФорма.ИзменитьРеквизиты(М);
	Эл=ЭтаФорма.Элементы.Добавить("БФ",Тип("ПолеФормы"));
	Эл.Вид=ВидПоляФормы.ПолеHTMLДокумента;
	Эл.Высота=1; Эл.Ширина=1;
	Эл.ПутьКДанным="БФ";
КонецПроцедуры

// Фролов+
&НаСервере
Процедура смартУдалитьРеквизитФормы(Имя)
	ЭтаФорма.Элементы.Удалить(Элементы.Найти(Имя));
	М=Новый Массив;
	М.Добавить(Имя);
	ЭтаФорма.ИзменитьРеквизиты(,М);
КонецПроцедуры

#КонецОбласти