
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	//++#1304 смарт: Демичев 01022023
	НовыйЭлемент = Элементы.Добавить("смартПодписиАвансовыхОтчетов", Тип("ПолеФормы"),Элементы.ГруппаШапкаПравая);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Ответственный за подписание АО(Из подразделения Подотчетного лица)";
	НовыйЭлемент.ПутьКДанным = "Объект.смартПодписиАвансовыхОтчетов";
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.КнопкаОчистки = Истина;
	НовыйЭлемент.КнопкаВыпадающегоСписка = Истина;

	НовыйЭлемент.КнопкаВыбора = Истина;
//	НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
	
	Элементы.Переместить(НовыйЭлемент,Элементы.ГруппаШапкаПравая,Элементы.ЦеныИВалюта);
	//--#1304 смарт: Демичев 01022023
	
КонецПроцедуры

 &НаКлиенте
Процедура смарт_ФизЛицоПриИзмененииПосле(Элемент)
	
	//++#1304 смарт: Демичев 01022023	
	Объект.смартПодписиАвансовыхОтчетов = смартВернутьПодписнтаАО();	
	//--#1304 смарт: Демичев 01022023
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

&НаСервере
Функция смартВернутьПодписнтаАО()
	
	//++#1304 смарт: Демичев 01022023     
	ДанныеПодотчетногоЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
	Объект.Организация, Объект.ФизЛицо, Объект.Дата);
	
	ПодразделениеСотрудника = ДанныеПодотчетногоЛица.ПодразделениеОрганизации;
	
	СмартПодписьПодразделениеВозврат = Неопределено;
	
	Если ЗначениеЗаполнено(ПодразделениеСотрудника) и ЗначениеЗаполнено(ПодразделениеСотрудника.смартПодписиАвансовыхОтчетов) Тогда
		
		СмартПодписьПодразделениеВозврат = ПодразделениеСотрудника.смартПодписиАвансовыхОтчетов;
				
	КонецЕсли;
	
	Возврат  СмартПодписьПодразделениеВозврат;	
	//--#1304 смарт: Демичев 01022023
	
КонецФункции	

#КонецОбласти