#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НайтиНоменклатуруКонтрагентаПоЧастиНаименования(Владелец, СтрокаПоиска) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартНоменклатураКонтрагентовБЭД.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.смартНоменклатураКонтрагентовБЭД КАК смартНоменклатураКонтрагентовБЭД
	|ГДЕ
	|	смартНоменклатураКонтрагентовБЭД.Владелец = &Владелец
	|	И &СтрокаПоиска ПОДОБНО смартНоменклатураКонтрагентовБЭД.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартНоменклатураКонтрагентовБЭД.Приоритет";	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Номенклатура;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли