
//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 28.12.2020 17:46:53
 
// Добавлен предопределенный элемент:
// Для соединения с HTTP сервисом УТ
//	- СерверУТ
//	- БазаУТ

//Смарт }Подкин Алексей Иванович 28.12.2020 17:46:53 

//++ смарт:ММ 572 06.07.2021
// Добавлен предопределенный элемент:
//	- АдресДляОтправкиПакетаНаСкладАдмирал
//-- смарт:ММ 06.07.2021        

//++ смарт:Подкин #893 16.02.2022 13:41:13
// Добавлен предопределенный элемент:
//    -СкладыСписанияТоваров
//-- смарт:Подкин #893 16.02.2022 13:41:13 

//++ смарт:Подкин #888 18.03.2022 10:29:39
// Добавлен предопределенный элемент:
//    -ПодразделениеСинхронизации
//-- смарт:Подкин #888 18.03.2022 10:29:39