
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
	Если Объект.СписокЗначений Тогда
		
		Если ЗначениеЗаполнено(Объект.Значение) Тогда
			НоваяСтрока = Объект.Значения.Добавить();
			НоваяСтрока.Значение = Объект.Значение;
			Объект.Значение = Неопределено;
		КонецЕсли;
		
	Иначе
		Если Объект.Значения.Количество() > 0 Тогда
			Объект.Значение = Объект.Значения[0].Значение;
			Объект.Значения.Очистить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьДоступность()
    Если Объект.СписокЗначений Тогда
        Элементы.Значение.Видимость=Ложь;
        Элементы.Значения.Видимость=Истина;      
        Элементы.ИспользоватьТЧСписокЗначений.Видимость=Ложь;
        Элементы.ТЧСписокЗначений.Видимость=Ложь; 
    ИначеЕсли Объект.ИспользоватьТЧСписокЗначений Тогда    
        Элементы.Значение.Видимость=Ложь;
        Элементы.Значения.Видимость=Ложь;      
        Элементы.СписокЗначений.Видимость=Ложь;
        Элементы.ТЧСписокЗначений.Видимость=Истина; 
    Иначе
        Элементы.Значение.Видимость = Истина;  
        Элементы.Значения.Видимость=Ложь;
        Элементы.СписокЗначений.Видимость=Истина;
        Элементы.ИспользоватьТЧСписокЗначений.Видимость=Истина;
        Элементы.ТЧСписокЗначений.Видимость=Ложь; 
    КонецЕсли;
    //Элементы.Значение.Видимость = НЕ Объект.СписокЗначений;
    //Элементы.Значения.Видимость = Объект.СписокЗначений;  

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТЧСписокЗначенийПриИзменении(Элемент)
    ИспользоватьТЧСписокЗначенийПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИспользоватьТЧСписокЗначенийПриИзмененииНаСервере()
      НастроитьВидимостьДоступность();
КонецПроцедуры
