

#Область ПеренесеноСДоработкамиСмарт

//++ #1353 смарт: Фролов 17.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	НовыйЭлемент = Этаформа.Элементы.Добавить("смартГруппаНастройкиОтправкиДокументов", Тип("ГруппаФормы"), ЭтаФорма);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок="Настройки отправки документов (смарт)";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("смартАвтоматическиФормироватьДокументы", Тип("ПолеФормы"), Элементы.смартГруппаНастройкиОтправкиДокументов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартАвтоматическиФормироватьДокументы"; 
	
	НовыйЭлемент = Элементы.Добавить("смартКаталогСклада", Тип("ПолеФормы"), Элементы.смартГруппаНастройкиОтправкиДокументов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартКаталогСклада"; 
	
	НовыйЭлемент = Элементы.Добавить("смартАдресаДляОтправкиПакетаНаСклад", Тип("ТаблицаФормы"),Элементы.смартГруппаНастройкиОтправкиДокументов);
	НовыйЭлемент.ПутьКДанным = "Объект.смартАдресаДляОтправкиПакетаНаСклад"; 
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.МаксимальнаяШирина = 50;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.Высота = 0;
	НовыйЭлемент.МаксимальнаяВысота = 5;
	НовыйЭлемент.АвтоМаксимальнаяВысота = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("Адрес", Тип("ПолеФормы"), Элементы.смартАдресаДляОтправкиПакетаНаСклад);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартАдресаДляОтправкиПакетаНаСклад.смартАдресДляОтправкиПакетаНаСклад";
	
	смартФормированиеИнтерфейса.СздГруппаОбычная(ЭтаФорма, "смартГруппаНастройкиАтлант", ЭтаФорма, "Настройки Атлант", 1);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "АтлантFTPАдрес", "смартГруппаНастройкиАтлант",, 1, "Объект.АтлантFTPАдрес");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "АтлантFTPЛогин", "смартГруппаНастройкиАтлант",, 1, "Объект.АтлантFTPЛогин");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "АтлантFTPПароль", "смартГруппаНастройкиАтлант",, 1, "Объект.АтлантFTPПароль");
	
КонецПроцедуры  //-- #1353 смарт: Фролов 17.05.2023

#КонецОбласти