//++ смарт:ММ 572 01.07.2021
Функция СоздатьКаталогПФРеализацияТиУ(ДокСсылка) Экспорт
	
	КаталогРезультат = "";
	
	//++ #1353 смарт: Фролов 12.07.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	//КаталогСкладаАдмирал = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("КаталогСкладаАдмирал");
	Склад = смартОбщегоНазначения.ПолучитьРеквизитОбъекта(ДокСсылка, "Склад");
	КаталогСкладаАдмирал = смартОбщегоНазначения.ПолучитьРеквизитОбъекта(Склад, "смартКаталогСклада"); 
	//-- #1353 смарт: Фролов 12.07.2023 
	
	Если НЕ ЗначениеЗаполнено(КаталогСкладаАдмирал) Тогда
		Возврат КаталогРезультат;	
	КонецЕсли;
	
	ИмяПодкаталога = смартОбщегоНазначения.ПолучитьИмяФайлаДляБуфераОбмена(ДокСсылка);
	КаталогРезультат = КаталогСкладаАдмирал + "\" + ИмяПодкаталога;
	//++ #1344 смарт: Фролов 20.04.2023 //Исправить ошибку связанную с длинной наименования каталога  
	КаталогРезультат=СокрЛП(КаталогРезультат);	
	//-- #1344 смарт: Фролов 20.04.2023
	СоздатьКаталог(КаталогРезультат);
	
	Возврат КаталогРезультат;
	
КонецФункции //-- смарт:ММ 01.07.2021

Функция СоздатьКаталогОбщийДляЗаявок(ДокСсылка) Экспорт
	
	КаталогРезультат = "";
	
	Склад = смартОбщегоНазначения.ПолучитьРеквизитОбъекта(ДокСсылка, "Склад");
	КаталогСкладаАдмирал = смартОбщегоНазначения.ПолучитьРеквизитОбъекта(Склад, "смартКаталогСклада"); 
	
	Если НЕ ЗначениеЗаполнено(КаталогСкладаАдмирал) Тогда
		Возврат КаталогРезультат;	
	КонецЕсли;
	
	КаталогРезультат = КаталогСкладаАдмирал + "\Заявки на отгрузку по самовывозам";
	КаталогРезультат = СокрЛП(КаталогРезультат);	
	СоздатьКаталог(КаталогРезультат);
	
	Возврат КаталогРезультат;
	
КонецФункции //-- смарт:ММ 01.07.2021

//++ смарт:ММ 572 04.07.2021
Процедура СформироватьПакетДокументов(ДокСсылка) Экспорт
	
	// 1. Создание подкаталога
	// 2. Формирование ПФ УПД, Счета, заявки на машину, заявки на отгрузку
	// 3. Запись в РС
	// 4. Отправка документов на эл. почту
	
	Успех = Истина;
		
	//++ #1353 смарт: Фролов 18.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	//++ смарт:ММ 572 23.07.2021
	//Склад = смартОбщегоНазначения.ПолучитьРеквизитОбъекта(ДокСсылка, "Склад");
	//СкладАдмирал = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмирал", Ложь);
	//
	//Если смартОбщегоНазначения.ПолучитьРеквизитОбъекта(ДокСсылка, "Склад") <> СкладАдмирал Тогда
	//	ОбщегоНазначенияКлиент.СообщитьПользователю("Пакет документов формируется только для склада Адмирал");
	//	Возврат;
	//КонецЕсли; 
	Склад = смартОбщегоНазначения.ПолучитьРеквизитОбъекта(ДокСсылка, "Склад");
	Если НЕ смартОбщегоНазначения.ПолучитьРеквизитОбъекта(Склад, "смартАвтоматическиФормироватьДокументы") Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Пакет документов формируется только для склада Адмирал");
		Возврат;
	КонецЕсли;	
	//-- смарт:ММ 23.07.2021
	//-- #1353 смарт: Фролов 18.05.2023
	
	// 1. Создание подкаталога
	
	КаталогСохраненияФайлов = СоздатьКаталогПФРеализацияТиУ(ДокСсылка);
	КаталогСохраненияФайловОбщий = СоздатьКаталогОбщийДляЗаявок(ДокСсылка);
	
	Если НЕ ЗначениеЗаполнено(КаталогСохраненияФайлов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен каталог для сохранения файлов. ПФ не сформированы.");
		Возврат;
	КонецЕсли;
	
	// 2.3 Формирование заявки на машину
	// 2.4 Формирование заявки на отгрузку

	// Подключение к УТ для получения данных из Заказа клиента
	
	ТабДокументыПоДаннымИзУТ = смартОбщегоНазначения.СформироватьТабличныеДокументыПоДаннымУТ(ДокСсылка);
		
	//++ смарт:ММ 572 22.07.2021  
	СпособОтгрузкиСоСкладаАдмирал = Ложь;
	ВЗаказеСкладАдмирал = Ложь;
	НазваниеАвто = "";
	НомерАвто = "";
	//-- смарт:ММ 22.07.2021
	
	ИмяФайлаЗаявкаНаМашину = "";
	ТабДокЗаявкаНаМашину = ТабДокументыПоДаннымИзУТ.ТабДокЗаявкаНаМашину;
	ИмяФайлаЗаявкаНаМашину = ТабДокументыПоДаннымИзУТ.ИмяФайлаЗаявкаНаМашину;

	ПолноеИмяФайлаЗаявкаНаМашину = КаталогСохраненияФайлов + "\" + ИмяФайлаЗаявкаНаМашину;
	
		
	ИмяФайлаЗаявкаНаОтгрузку = "";
	ТабДокЗаявкаНаОтгрузку = ТабДокументыПоДаннымИзУТ.ТабДокЗаявкаНаОтгрузку;
	ИмяФайлаЗаявкаНаОтгрузку = ТабДокументыПоДаннымИзУТ.ИмяФайлаЗаявкаНаОтгрузку;

	Если ТабДокументыПоДаннымИзУТ.ЭтоАтлант Тогда
		ПолноеИмяФайлаЗаявкаНаОтгрузку = КаталогСохраненияФайловОбщий + "\" + ИмяФайлаЗаявкаНаОтгрузку;
	Иначе
		ПолноеИмяФайлаЗаявкаНаОтгрузку = КаталогСохраненияФайлов + "\" + ИмяФайлаЗаявкаНаОтгрузку;
	КонецЕсли;
	
	//++ смарт:ММ 572 22.07.2021
	НазваниеАвто = ТабДокументыПоДаннымИзУТ.НазваниеАвто;
	НомерАвто = ТабДокументыПоДаннымИзУТ.НомерАвто;
	СпособОтгрузкиСоСкладаАдмирал = ТабДокументыПоДаннымИзУТ.СпособОтгрузкиСоСкладаАдмирал;
	ВЗаказеСкладАдмирал = ТабДокументыПоДаннымИзУТ.ВЗаказеСкладАдмирал;
	
	Если НЕ ВЗаказеСкладАдмирал Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("В заказе клиента в УТ не указан склад Адмирал");
		Возврат;		
	КонецЕсли;
	
	//++ смарт:ММ 606 12.09.2021
	
	// 2.7 Формирование XML
	
	ДокСсылкаНомер = смартОбщегоНазначения.ПолучитьРеквизитОбъекта(ДокСсылка, "Номер");
	ДокСсылкаДата = смартОбщегоНазначения.ПолучитьРеквизитОбъекта(ДокСсылка, "Дата");
	
	//++ смарт:ММ 695 25.10.2021 
	//ПолноеИмяФайлаXMLПоЗаявкамНаОтгрузку = КаталогСохраненияФайлов + "\ПакетДанныхПоЗаявкамНаОтгрузку " 
	//+ ДокСсылкаНомер + " " + Формат(ДокСсылкаДата, "ДЛФ=Д") + " " + СокрЛП(Строка(Склад)) + ".XML";
	
	Если ЗначениеЗаполнено(ТабДокументыПоДаннымИзУТ.ИмяФайлаXML) Тогда
		ИмяФайлаXMLПоЗаявкамНаОтгрузку = ТабДокументыПоДаннымИзУТ.ИмяФайлаXML;
	Иначе
		ИмяФайлаXMLПоЗаявкамНаОтгрузку = "ПакетДанныхПоЗаявкамНаОтгрузку " 
											+ ДокСсылкаНомер + " " + Формат(ДокСсылкаДата, "ДЛФ=Д") + " " + СокрЛП(Строка(Склад)) + ".XML";
	КонецЕсли;
										
	Если ТабДокументыПоДаннымИзУТ.ЭтоАтлант Тогда
		ПолноеИмяФайлаXMLПоЗаявкамНаОтгрузку = КаталогСохраненияФайловОбщий + "\" + ИмяФайлаXMLПоЗаявкамНаОтгрузку;
		смартОбщегоНазначения.ОтправитьЗаявкуВАтлантСервер(ИмяФайлаXMLПоЗаявкамНаОтгрузку, ТабДокументыПоДаннымИзУТ.ДвоичныеДанныеXML, смартОбщегоНазначения.ПолучитьРеквизитОбъекта(ДокСсылка, "Склад"));
	Иначе
		ПолноеИмяФайлаXMLПоЗаявкамНаОтгрузку = КаталогСохраненияФайлов + "\" + ИмяФайлаXMLПоЗаявкамНаОтгрузку;
	КонецЕсли;
	
	//-- смарт:ММ 25.10.2021
	
	//АдресДвоичныеДанныеXML = смартОбщегоНазначения.смартСформироватьXMLПоЗаявкаНаОтгрузку(ДокСсылка, "ПакетДанныхПоЗаявкамНаОтгрузку.XML");	
	ДвоичныеДанныеXML = ТабДокументыПоДаннымИзУТ.ДвоичныеДанныеXML;
	
	УспехЗаписиXML = Ложь;
	//-- смарт:ММ 12.09.2021
	
	ОтправлятьПисьмо = Истина;
	
	Если НЕ СпособОтгрузкиСоСкладаАдмирал Тогда
		ОтправлятьПисьмо = Ложь;
		ТабДокЗаявкаНаМашину = Неопределено;
	КонецЕсли;
	
	// ++ перенесено ниже 
	
	// 2.1 Формирование УПД
	
	ИмяФайлаУПД = "";
	Если смартОбщегоНазначения.ЭтоУниверсальныйДокумент(ДокСсылка) Тогда //rnp 25.08.2021
		ТабДокУПД = смартОбщегоНазначения.СформироватьТабличныйДокументУПД(ДокСсылка, ИмяФайлаУПД);
	Иначе
		ТабДокУПД = смартОбщегоНазначения.СформироватьТабличныйДокументТОРГ12(ДокСсылка, ИмяФайлаУПД);
	КонецЕсли;

	Если ТабДокУПД = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сформировать ПФ УПД. Возможно, для документа " + ДокСсылка + " не введен счет-фактура");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаУПД) Тогда
		ИмяФайлаУПД = "УПД";		
	КонецЕсли;
	
	ПолноеИмяФайлаУПД = КаталогСохраненияФайлов + "\" + ИмяФайлаУПД;
	
	// 2.2 Формирование Счета

	ИмяФайлаСчет = "";
	ТабДокСчет = смартОбщегоНазначения.СформироватьТабличныйДокументСчет(ДокСсылка, ИмяФайлаСчет);	
	Если ТабДокСчет = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сформировать ПФ счета на оплату. Возможно, для документа " + ДокСсылка + " не введен счет");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаСчет) Тогда
		ИмяФайлаСчет = "Счет";
	КонецЕсли;
	
	ПолноеИмяФайлаСчет = КаталогСохраненияФайлов + "\" + ИмяФайлаСчет;
	// --

	Если СпособОтгрузкиСоСкладаАдмирал Тогда
		//-- смарт:ММ 22.07.2021

		//++ смарт:ММ 572 14.07.2021
		
		// 2.5 Формирование Транспортной накладной
		
		ИмяФайлаТН = "";
		//++ смарт:ММ 572 28.07.2021
		//ТабДокТН = смартОбщегоНазначения.СформироватьТабличныйДокументТранспортнаяНакладная(ДокСсылка, ИмяФайлаТН);	
		ТабДокТН = смартОбщегоНазначения.СформироватьТабличныйДокументТранспортнаяНакладная(ДокСсылка, ИмяФайлаТН, НазваниеАвто, НомерАвто);	
		//-- смарт:ММ 28.07.2021
		Если ТабДокТН = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сформировать ПФ транспортной накладной.");
			//Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ИмяФайлаТН) Тогда
			ИмяФайлаТН = "ТранспортнаяНакладная";
		КонецЕсли;
		
		ПолноеИмяФайлаТН = КаталогСохраненияФайлов + "\" + ИмяФайлаТН;
		
		//++ смарт:ММ 572 22.07.2021
	Иначе
		ТабДокТН = Неопределено;
	КонецЕсли;
	//-- смарт:ММ 14.07.2021
	
	//++ смарт:ММ 572 25.08.2021
			
	// Сохранение файлов
	
	Попытка
		ТабДокУПД.Записать(ПолноеИмяФайлаУПД, ТипФайлаТабличногоДокумента.PDF);
		ТабДокСчет.Записать(ПолноеИмяФайлаСчет, ТипФайлаТабличногоДокумента.PDF);
		
		Если ТабДокЗаявкаНаМашину <> Неопределено Тогда
			ТабДокЗаявкаНаМашину.Записать(ПолноеИмяФайлаЗаявкаНаМашину, ТипФайлаТабличногоДокумента.XLSX);
			ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл " + ПолноеИмяФайлаЗаявкаНаМашину);
		КонецЕсли;
		
		Если ТабДокЗаявкаНаОтгрузку <> Неопределено Тогда
			Если СтрНайти(ПолноеИмяФайлаЗаявкаНаОтгрузку, ".xlsx") > 0 Тогда
				ТабДокЗаявкаНаОтгрузку.Записать(ПолноеИмяФайлаЗаявкаНаОтгрузку, ТипФайлаТабличногоДокумента.XLSX);
			Иначе
				ТабДокЗаявкаНаОтгрузку.Записать(ПолноеИмяФайлаЗаявкаНаОтгрузку, ТипФайлаТабличногоДокумента.XLS);
			КонецЕсли;
			ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл " + ПолноеИмяФайлаЗаявкаНаОтгрузку);
		КонецЕсли;
		
		//++ смарт:ММ 572 14.07.2021
		Если ТабДокТН <> Неопределено Тогда
			ТабДокТН.Записать(ПолноеИмяФайлаТН, ТипФайлаТабличногоДокумента.PDF);
			ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл " + ПолноеИмяФайлаТН);
		КонецЕсли;
		//-- смарт:ММ 14.07.2021
		
		//++ смарт:ММ 606 12.09.2021
		Если ТипЗнч(ДвоичныеДанныеXML) = Тип("ДвоичныеДанные") Тогда
			ДвоичныеДанныеXML.Записать(ПолноеИмяФайлаXMLПоЗаявкамНаОтгрузку);
			УспехЗаписиXML = Истина;
			ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл " + ПолноеИмяФайлаXMLПоЗаявкамНаОтгрузку);
		КонецЕсли;
		//-- смарт:ММ 12.09.2021
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл " + ПолноеИмяФайлаУПД);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сохранен файл " + ПолноеИмяФайлаСчет);
				
	Исключение
		Успех = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось сохранить печатные формы:" + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
		
	
	Если Успех Тогда
		
		// 3. Запись в РС
		
		смартОбщегоНазначения.ДобавитьЗаписьОСформированномПакете(ДокСсылка);

		// 4. Отправка документов на эл. почту
		
		//++ смарт:ММ 572 22.07.2021
		Если ОтправлятьПисьмо Тогда
		//-- смарт:ММ 22.07.2021
			
		АдресХранилищаУПД = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайлаУПД), Новый УникальныйИдентификатор);
		АдресХранилищаСчет = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайлаСчет), Новый УникальныйИдентификатор);
		АдресХранилищаЗаявкаНаМашину = "";
		
		Если ТабДокЗаявкаНаМашину <> Неопределено Тогда			
			АдресХранилищаЗаявкаНаМашину = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайлаЗаявкаНаМашину), Новый УникальныйИдентификатор);
		КонецЕсли;
		
		Если ТабДокЗаявкаНаОтгрузку <> Неопределено Тогда
			АдресХранилищаЗаявкаНаОтгрузку = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайлаЗаявкаНаОтгрузку), Новый УникальныйИдентификатор);
		КонецЕсли;
		
		//++ смарт:ММ 572 14.07.2021
		Если ТабДокТН <> Неопределено Тогда
			АдресХранилищаТН = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайлаТН), Новый УникальныйИдентификатор);
		КонецЕсли;
		//-- смарт:ММ 14.07.2021
		
		МассивСтруктур = Новый Массив;
		
		ТекСтруктура = Новый Структура;
		ТекСтруктура.Вставить("ИмяФайла", ИмяФайлаУПД);
		ТекСтруктура.Вставить("АдресХранилища", АдресХранилищаУПД);
		МассивСтруктур.Добавить(ТекСтруктура);
		
		ТекСтруктура = Новый Структура;
		ТекСтруктура.Вставить("ИмяФайла", ИмяФайлаСчет);
		ТекСтруктура.Вставить("АдресХранилища", АдресХранилищаСчет);
		МассивСтруктур.Добавить(ТекСтруктура);
						
		Если ТабДокЗаявкаНаМашину <> Неопределено Тогда 
			ТекСтруктура = Новый Структура;
			ТекСтруктура.Вставить("ИмяФайла", ИмяФайлаЗаявкаНаМашину);
			ТекСтруктура.Вставить("АдресХранилища", АдресХранилищаЗаявкаНаМашину);
			МассивСтруктур.Добавить(ТекСтруктура);
		КонецЕсли;
		
		Если ТабДокЗаявкаНаОтгрузку <> Неопределено Тогда
			ТекСтруктура = Новый Структура;
			ТекСтруктура.Вставить("ИмяФайла", ИмяФайлаЗаявкаНаОтгрузку);
			ТекСтруктура.Вставить("АдресХранилища", АдресХранилищаЗаявкаНаОтгрузку);
			МассивСтруктур.Добавить(ТекСтруктура);
		КонецЕсли;
		
		//++ смарт:ММ 572 14.07.2021
		Если ТабДокТН <> Неопределено Тогда
			ТекСтруктура = Новый Структура;
			ТекСтруктура.Вставить("ИмяФайла", ИмяФайлаТН);
			ТекСтруктура.Вставить("АдресХранилища", АдресХранилищаТН);
			МассивСтруктур.Добавить(ТекСтруктура);		
		КонецЕсли;
		//-- смарт:ММ 14.07.2021
		
		//++ смарт:ММ 606 12.09.2021
		Если УспехЗаписиXML Тогда
			АдресХранилищаXMLЗаявкаНаМашину = ПоместитьВоВременноеХранилище(ДвоичныеДанныеXML, Новый УникальныйИдентификатор);
			
			ТекСтруктура = Новый Структура;
			//++ смарт:ММ 695 25.10.2021 
			//ТекСтруктура.Вставить("ИмяФайла", "ПакетДанныхПоЗаявкамНаОтгрузку.XML");
			ТекСтруктура.Вставить("ИмяФайла", ИмяФайлаXMLПоЗаявкамНаОтгрузку);
			//-- смарт:ММ 25.10.2021
			ТекСтруктура.Вставить("АдресХранилища", АдресХранилищаXMLЗаявкаНаМашину);
			МассивСтруктур.Добавить(ТекСтруктура);
		КонецЕсли;
		//-- смарт:ММ 12.09.2021

		смартОбщегоНазначения.ОтправитьПакетДокументовНаПочту(МассивСтруктур, ДокСсылка);
		
		//++ смарт:ММ 572 22.07.2021
		КонецЕсли;
		//-- смарт:ММ 22.07.2021
		
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 04.07.2021

//++ смарт:ММ 572 04.07.2021
Процедура СформироватьПакетПФРеализация(ДокСсылка, ПараметрыЗаписи) Экспорт
	
	Если ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	// склад = смартПредопределенный СкладАдмирал и не стоит флаг в реализации "Пакет сформирован"

	Склад = смартОбщегоНазначения.ПолучитьРеквизитОбъекта(ДокСсылка, "Склад");
	//++ #1353 смарт: Фролов 17.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	//СкладАдмирал = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("СкладАдмирал", Ложь);
	//
	//Если Склад <> СкладАдмирал Тогда
	Если НЕ смартОбщегоНазначения.ПолучитьРеквизитОбъекта(Склад, "смартАвтоматическиФормироватьДокументы") ТОгда	
	//-- #1353 смарт: Фролов 17.05.2023	
		Возврат;
	КонецЕсли;
	
	ПакетПФУжеСформирован = смартОбщегоНазначения.ПакетПФУжеСформирован(ДокСсылка);
	
	Если ПакетПФУжеСформирован Тогда
		Возврат;
	КонецЕсли;
		
	СформироватьПакетДокументов(ДокСсылка);
	
КонецПроцедуры //-- смарт:ММ 04.07.2021

