#Область ОбработчикиСобытийФормы

//++ #Б5128 смарт: Шляпников 22.12.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Классификатор ТН ВЭД". 1С БП
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	События = Новый Структура;
	События.Вставить("ПриИзменении", "ПриИзмененииПризнакаМаркировки");
	
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартВидМаркировки",,, 1, "Объект.смартВидМаркировки");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартОбязательнаяМаркировка",,, 2, "Объект.смартОбязательнаяМаркировка",, События);
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартЭкспериментальныйРежимМаркировки",,, 2, "Объект.смартЭкспериментальныйРежимМаркировки",, События);
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

//++ #Б5128 смарт: Шляпников 22.12.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Классификатор ТН ВЭД". 1С БП
&НаКлиенте
Процедура ПриИзмененииПризнакаМаркировки(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

//++ #Б5128 смарт: Шляпников 22.12.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Классификатор ТН ВЭД". 1С БП
&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.смартЭкспериментальныйРежимМаркировки.Доступность = НЕ Объект.смартОбязательнаяМаркировка;
	Элементы.смартОбязательнаяМаркировка.Доступность = НЕ Объект.смартЭкспериментальныйРежимМаркировки;
	
КонецПроцедуры

#КонецОбласти