
#Область ПеренесеноСДоработкамиСмарт

//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
&ИзменениеИКонтроль("ПолучитьТаблицуРеализацииПоКурсуАвансов")
Функция смарт_ПолучитьТаблицуРеализацииПоКурсуАвансов(Параметры, Отказ)
	
	Если Не ЗначениеЗаполнено(Параметры.Реквизиты)
	 Или Не ЗначениеЗаполнено(Параметры.ТоварыУслуги) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Реквизиты                    = Параметры.Реквизиты[0];
	ТаблицаПоступлениеРеализация = Параметры.ТоварыУслуги;
	ТаблицаВзаиморасчеты         = Параметры.Взаиморасчеты;
	
	ЕстьКолонкаНалоговаяБазаНДС = ТаблицаПоступлениеРеализация.Колонки.Найти("НалоговаяБазаНДС") <> Неопределено;
	
	// Дополнительно добавим сумму без НДС для последующей записи в регистры.
	Если ТаблицаПоступлениеРеализация.Колонки.Найти("СуммаБезНДСРуб") = Неопределено Тогда
		
		ТаблицаПоступлениеРеализация.Колонки.Добавить("СуммаБезНДСРуб", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
		
		Для Каждого СтрокаТаблицы Из ТаблицаПоступлениеРеализация Цикл
			Если ЕстьКолонкаНалоговаяБазаНДС И СтрокаТаблицы.НалоговаяБазаНДС <> 0 Тогда
				СтрокаТаблицы.СуммаБезНДСРуб = СтрокаТаблицы.НалоговаяБазаНДС;
			Иначе
				СтрокаТаблицы.СуммаБезНДСРуб = ?(ЗначениеЗаполнено(СтрокаТаблицы.СуммаРуб), СтрокаТаблицы.СуммаРуб, 0) 
					- ?(ЗначениеЗаполнено(СтрокаТаблицы.СуммаНДСРуб), СтрокаТаблицы.СуммаНДСРуб, 0);
			КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТаблицаВзаиморасчеты) Тогда
		Возврат ТаблицаПоступлениеРеализация;
	КонецЕсли;
	
	Период          = Реквизиты.Период;
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ТаблицаДоговоров = ТаблицаВзаиморасчеты.Скопировать(, "ДоговорКонтрагента, ВалютаВзаиморасчетов, РасчетыВУсловныхЕдиницах");
	ТаблицаДоговоров.Свернуть("ДоговорКонтрагента, ВалютаВзаиморасчетов, РасчетыВУсловныхЕдиницах");
	ТаблицаВзаиморасчеты.Индексы.Добавить("ДоговорКонтрагента");
	
	ТаблицаРезультат = ТаблицаПоступлениеРеализация.СкопироватьКолонки();
	
	Для каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
		
		ВалютаВзаиморасчетов     = СтрокаДоговора.ВалютаВзаиморасчетов;
		РасчетыВУсловныхЕдиницах = СтрокаДоговора.РасчетыВУсловныхЕдиницах;
		
		Отбор = Новый Структура("ДоговорКонтрагента", СтрокаДоговора.ДоговорКонтрагента);
		ТаблицаВзаиморасчетыПоДоговору = ТаблицаВзаиморасчеты.Скопировать(Отбор);
		
		СуммаКорректировки = ТаблицаВзаиморасчетыПоДоговору.Итог("СуммаРубПоКурсуАванса") 
			- ТаблицаВзаиморасчетыПоДоговору.Итог("СуммаРуб");
			#Вставка //++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
			//++ смарт:ММ  #64 316 01.09.2020 Эта сумма (по поступлениям ДС) не всегда совпадает с суммой по таблице товаров
			#КонецВставки
			
		Если ТаблицаПоступлениеРеализация.Колонки.Найти("ДоговорКонтрагента") = Неопределено Тогда
			ТаблицаРезультатПоДоговору = ТаблицаПоступлениеРеализация.Скопировать();
		Иначе
			ТаблицаРезультатПоДоговору = ТаблицаПоступлениеРеализация.Скопировать(Отбор);
		КонецЕсли;
		
		Если ВалютаВзаиморасчетов = ВалютаРеглУчета 
			ИЛИ СуммаКорректировки = 0 Тогда
			ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ТаблицаРезультатПоДоговору, ТаблицаРезультат);
			Продолжить;
		КонецЕсли;
		
		// БУ - корректируются значения колонки СуммаБУ.
		СуммаРуб = ТаблицаРезультатПоДоговору.Итог("СуммаРуб");
		
		#Удаление //++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
		ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(
			СуммаРуб + СуммаКорректировки,
			ТаблицаРезультатПоДоговору,
			"СуммаБУ",
			"СуммаРуб");
		#КонецУдаления

		#Вставка 
		//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
		//++ смарт:ММ  #64 316 01.09.2020
		Если '20200913' <= Период Тогда
			ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(
			//сумма корректировки в некоторых случаях рассчитывается неверно из-за того, что ТаблицаВзаиморасчетыПоДоговору.Итог("СуммаРуб") получается <> СуммаРуб 
			//СуммаРуб + СуммаКорректировки,
			ТаблицаВзаиморасчетыПоДоговору.Итог("СуммаРубПоКурсуАванса"),
			ТаблицаРезультатПоДоговору,
			"СуммаБУ",
			"СуммаРуб");
		Иначе
			ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(
			СуммаРуб + СуммаКорректировки,
			ТаблицаРезультатПоДоговору,
			"СуммаБУ",
			"СуммаРуб");
		КонецЕсли; //-- смарт:ММ #64 316 01.09.2020
		//-- #Б-1828 смарт: Лопато 09.01.2025
		#КонецВставки
		
		// НУ
		НУПоКурсуРеализации = Период >= '20220101' 
			И ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя");
		Если РасчетыВУсловныхЕдиницах Тогда
			НУПоКурсуАвансов = Не НУПоКурсуРеализации;
		Иначе
			// В НУ оценка доходов и расходов осуществляется по курсу авансов начиная с 01.01.2010.
			НУПоКурсуАвансов = Не НУПоКурсуРеализации И ('20100101' <= Период);
		КонецЕсли;
		
		Если НУПоКурсуРеализации Тогда
			КэшКурсовВалют = Новый Соответствие;
			Для каждого СтрокаТаблицы Из ТаблицаРезультатПоДоговору Цикл
				ДатаРеализации = ?(ЗначениеЗаполнено(СтрокаТаблицы.ДатаРеализации), 
					НачалоДня(СтрокаТаблицы.ДатаРеализации), 
					НачалоДня(Период));
				СтруктураКурса = КэшКурсовВалют[ДатаРеализации];
				Если СтруктураКурса = Неопределено Тогда
					СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаВзаиморасчетов, ДатаРеализации);
					КэшКурсовВалют.Вставить(ДатаРеализации, СтруктураКурса);
				КонецЕсли;
				СтрокаТаблицы.СуммаНУ = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(
					СтрокаТаблицы.СуммаВзаиморасчетов,
					ВалютаВзаиморасчетов, ВалютаРеглУчета,
					СтруктураКурса.Курс, 1,
					СтруктураКурса.Кратность, 1);
			КонецЦикла;
		ИначеЕсли НУПоКурсуАвансов Тогда
			ТаблицаРезультатПоДоговору.ЗагрузитьКолонку(ТаблицаРезультатПоДоговору.ВыгрузитьКолонку("СуммаБУ"), "СуммаНУ");
		КонецЕсли;
		
		// НДС
		
		// Рассчитаем сумму без НДС до корректировки.
		Для Каждого СтрокаТаблицы Из ТаблицаРезультатПоДоговору Цикл
			СтрокаТаблицы.СуммаБезНДСРуб = СтрокаТаблицы.СуммаРуб - СтрокаТаблицы.СуммаНДСРуб;
		КонецЦикла;
		
		НДСПоКурсуАвансов = РасчетыВУсловныхЕдиницах
			И НЕ (БухгалтерскийУчетКлиентСерверПереопределяемый.ДокументЯвляетсяРеализациейОтгруженныхТоваров(Реквизиты.Регистратор)
				И УчетнаяПолитика.НачислятьНДСПоОтгрузке(Реквизиты.Организация, Реквизиты.Период));
		
		Если НДСПоКурсуАвансов Тогда // Корректируются значения колонки СуммаНДСРуб.
			
			#Удаление //++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
			ТолькоПоКурсуАванса = ТаблицаВзаиморасчетыПоДоговору.Итог("ОстатокВзаиморасчетов") 
				>= ТаблицаВзаиморасчетыПоДоговору.Итог("СуммаВзаиморасчетов");
				
			Если НЕ ТолькоПоКурсуАванса Тогда
				СуммаНДСРуб           = ТаблицаРезультатПоДоговору.Итог("СуммаНДСРуб");
				СуммаКорректировкиНДС = Окр(СуммаКорректировки * СуммаНДСРуб / СуммаРуб, 2);
				ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(
					СуммаНДСРуб + СуммаКорректировкиНДС,
					ТаблицаРезультатПоДоговору,
					"СуммаНДСРуб");
			КонецЕсли;
			#КонецУдаления

			#Вставка 
			//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
			ТолькоПоКурсуАванса = Истина; //++ смарт:rnp  #64 316 14.09.2020 добавлено чтобы выполнялось условие ниже 
			Если '20200914' >= Период Тогда //++ смарт:rnp  #64 316 14.09.2020 добавлено условие на период 
				//этот блок не должен выполняться, чтобы не было расхождения в суммах реализации с УТ
				ТолькоПоКурсуАванса = ТаблицаВзаиморасчетыПоДоговору.Итог("ОстатокВзаиморасчетов") 
				>= ТаблицаВзаиморасчетыПоДоговору.Итог("СуммаВзаиморасчетов");
				
				Если НЕ ТолькоПоКурсуАванса Тогда
					СуммаНДСРуб           = ТаблицаРезультатПоДоговору.Итог("СуммаНДСРуб");
					СуммаКорректировкиНДС = Окр(СуммаКорректировки * СуммаНДСРуб / СуммаРуб, 2);
					ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(
					СуммаНДСРуб + СуммаКорректировкиНДС,
					ТаблицаРезультатПоДоговору,
					"СуммаНДСРуб");
				КонецЕсли;
			КонецЕсли;//++ смарт:rnp  #64 316 14.09.2020			
			//-- #Б-1828 смарт: Лопато 09.01.2025
			#КонецВставки
			
			Для Каждого СтрокаТаблицыПоДоговору Из ТаблицаРезультатПоДоговору Цикл
				Если ТолькоПоКурсуАванса Тогда
					ПроцентНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицыПоДоговору.СтавкаНДС);
					СтрокаТаблицыПоДоговору.СуммаНДСРуб = Окр(СтрокаТаблицыПоДоговору.СуммаБУ * ПроцентНДС / (100 + ПроцентНДС), 2);
				КонецЕсли;
				СтрокаТаблицыПоДоговору.СуммаБезНДСРуб = СтрокаТаблицыПоДоговору.СуммаБУ - СтрокаТаблицыПоДоговору.СуммаНДСРуб;
			КонецЦикла;
		КонецЕсли;
		
		// Результат корректировки по договору добавляем в общую таблицу.
		ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ТаблицаРезультатПоДоговору, ТаблицаРезультат);
	
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти