
&ИзменениеИКонтроль("УстановитьСлужебногоПользователяРегламентногоЗадания")
Процедура смарт_УстановитьСлужебногоПользователяРегламентногоЗадания(РегламентноеЗадание, СлужебныйПользовательИБ)

	#Вставка
	//++ #Б7118 смарт: Шляпников 15.06.2026 / Курсы валют в БП не загружаются автоматически
	Возврат;
	//-- #Б7118 смарт: Шляпников 15.06.2026
	#КонецВставки
	
	УстановитьПривилегированныйРежим(Истина);

	// Создание служебного пользователя, если не существует.
	Если СлужебныйПользовательИБ = Неопределено Тогда
		СлужебныйПользовательИБ = СлужебныйПользовательИБ(РегламентноеЗадание);
	КонецЕсли;
	Если СлужебныйПользовательИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущийСеанс = ПолучитьТекущийСеансИнформационнойБазы();

	// Проверка пользователя у текущего регламентного задания.
	ФоновоеЗадание = ТекущийСеанс.ПолучитьФоновоеЗадание();
	Если ИмяПользователя() = СлужебныйПользовательИБ.Имя
		И ФоновоеЗадание <> Неопределено
		И ФоновоеЗадание.ИмяМетода = РегламентноеЗадание.ИмяМетода Тогда
		Возврат;
	КонецЕсли;

	// Установка служебного пользователя, если не указан.
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Отбор = Новый Структура("ИмяМетода", РегламентноеЗадание.ИмяМетода);
	Иначе
		Отбор = Новый Структура("Метаданные", РегламентноеЗадание);
	КонецЕсли;
	НайденныеЗадания = НайтиЗадания(Отбор);

	ПараметрыЗадания = Новый Структура("ИмяПользователя", СлужебныйПользовательИБ.Имя);
	СлужебныйПользовательУстановлен = Ложь;

	Для Каждого НайденноеЗадание Из НайденныеЗадания Цикл
		Если НайденноеЗадание.ИмяПользователя <> СлужебныйПользовательИБ.Имя Тогда
			ИзменитьЗадание(НайденноеЗадание.УникальныйИдентификатор, ПараметрыЗадания);
			СлужебныйПользовательУстановлен = Истина;
		КонецЕсли;
	КонецЦикла;

	// Вызов исключения для перезапуска регламентного задания.
	Если Не СлужебныйПользовательУстановлен
		Или ИмяПользователя() = СлужебныйПользовательИБ.Имя
		Или ФоновоеЗадание = Неопределено
		Или ФоновоеЗадание.ИмяМетода <> РегламентноеЗадание.ИмяМетода
		И Не ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;

	Текст = НСтр("ru = 'Это регламентное задание должно выполняться от имени служебного пользователя.
	|Выполнение прервано. Установлен служебный пользователь для запуска.
	|Дополнительных действий не требуется. Следующий запуск будет выполнен от имени служебного пользователя.'")
	+ Символы.ПС;
	ВызватьИсключение Текст;

КонецПроцедуры
