
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 26.02.2021 10:25:54
	Если Объект.СпособЗаполнения="Сторно" Тогда
		НоваяКоманда = Команды.Добавить("смартОтправитьВУТ");
		НоваяКоманда.Действие = "смартОтправитьВУТ";
		НовыйЭлемент = Элементы.Добавить("КомандаПредупредить", Тип("КнопкаФормы"), Элементы.ГруппаШапкаЛевая);
		НовыйЭлемент.Заголовок = "Отправить в УТ";
		НовыйЭлемент.ИмяКоманды = "смартОтправитьВУТ";
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РезОтправки=смартПроверитьНаСервере();
		Если РезОтправки<>Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартСтатус", Тип("ДекорацияФормы"),Элементы.ГруппаШапкаПравая);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			Если РезОтправки.Статус Тогда
				НовыйЭлемент.ЦветТекста=Новый Цвет(0,194,0);
			иначе
				НовыйЭлемент.ЦветТекста=Новый Цвет(255,0,0);
			КонецЕсли; 
			НовыйЭлемент.Заголовок = РезОтправки.Сообщение;
		КонецЕсли;
	КонецЕсли; 
	//-- Смарт }Подкин Алексей Иванович 26.02.2021 10:25:5
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт
	
//++ Смарт Подкин Алексей Иванович 26.02.2021 10:25:54
&НаКлиенте
Процедура смартОтправитьВУТ(Элемент)
	Если Объект.Ссылка.Пустая() Тогда
		// Если редактируем правило по новому документу - запишем документ
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Выполнение команды ""Отправить в УТ"" возможно только после записи данных.
		|Данные будут записаны.'");
		
		Оповещение = Новый ОписаниеОповещения("смартВопросОтправкаВУТЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, ТекстВопроса);
	Иначе
		смартОтправитьВУТсервер();
	КонецЕсли;
КонецПроцедуры

//++ Смарт Подкин Алексей Иванович 26.02.2021 10:25:5
&НаКлиенте
Процедура смартВопросОтправкаВУТЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
		ПараметрыЗаписи = Новый Структура;//("ОткрытьПравилоРегулярногоПлатежа");
		
		Если Записать(ПараметрыЗаписи) Тогда			
			смартОтправитьВУТсервер();			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

//++ Смарт Подкин Алексей Иванович 26.02.2021 10:25:5
&НаСервере
Функция смартПроверитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартОтправленыВУТ.ОбъектОтправки КАК ОбъектОтправки,
	|	смартОтправленыВУТ.Статус КАК Статус,
	|	смартОтправленыВУТ.Сообщение КАК Сообщение
	|ИЗ
	|	РегистрСведений.смартОтправленыВУТ КАК смартОтправленыВУТ
	|ГДЕ
	|	смартОтправленыВУТ.ОбъектОтправки = &ОбъектОтправки";
	
	Запрос.УстановитьПараметр("ОбъектОтправки", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СтруктураОтвета=Новый Структура;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда		
		СтруктураОтвета.Вставить("ОбъектОтправки",ВыборкаДетальныеЗаписи.ОбъектОтправки);
		СтруктураОтвета.Вставить("Статус",ВыборкаДетальныеЗаписи.Статус);
		СтруктураОтвета.Вставить("Сообщение",ВыборкаДетальныеЗаписи.Сообщение);

		Возврат СтруктураОтвета;		
	Иначе 		
		Возврат Неопределено;		
	КонецЕсли;
	
КонецФункции

//++ Смарт Подкин Алексей Иванович 26.02.2021 10:25:5
&НаСервере
Процедура смартОтправитьВУТсервер()
	
	РезОтправки=смартПроверитьНаСервере();

	Если РезОтправки=Неопределено ИЛИ (РезОтправки.свойство("Статус") И НЕ РезОтправки.Статус) Тогда		
		Если ЗначениеЗаполнено(Объект.СторнируемыйДокумент) Тогда			
			ПараметрыВыполнения=ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ФЗ=ДлительныеОперации.ВыполнитьВФоне("смартОбщегоНазначения.ОтправитьОперациюБухСторно",Новый Структура("Источник",Объект.Ссылка),ПараметрыВыполнения);
			ЗаписьЖурналаРегистрации("Документ.ОперацияБух",УровеньЖурналаРегистрации.Предупреждение,,,"Документ Сторно отправлен"+ФЗ.ПодробноеПредставлениеОшибки,);			
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ уже отправлен в УТ!");
	КонецЕсли;
	
	//Проверка после отправки
	РезОтправки=смартПроверитьНаСервере();
	Если РезОтправки<>Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезОтправки.Сообщение);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти