
//#Область ПеренесеноСДоработкамиСмарт
//	
//&Вместо("РезультатВыгрузкиВXML")
////смарт:Каратеев //Добавлен блок для отправки письма по результату выгрузки
//Функция смарт_РезультатВыгрузкиВXML(СтруктураПараметров, АдресДляРазмещенияРезультата = Неопределено) Экспорт
//	
//	МестоВыгрузки = СтруктураПараметров.МестоВыгрузки;
//	
//	Если СтруктураПараметров.Свойство("ЭтоФоновоеЗадание") Тогда
//		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураПараметров);
//	КонецЕсли;
//	
//	СписокДополнениеКВыгрузке.Очистить();
//	ЗаполнитьСписокОбъектовКВыгрузке();
//	
//	АдресНаСервере = ПолучитьИмяВременногоФайла("xml");
//	РезультатВыгрузки = ВыгрузитьДанныеВXML(АдресНаСервере);
//	
//	Если РезультатВыгрузки.ЕстьОшибки Тогда
//		ТекстСообщения = НСтр("ru = 'В ходе выполнения операции возникли ошибки'") + ": "
//			+ Символы.ПС + РезультатВыгрузки.ТекстОшибки
//			+ Символы.ПС + НСтр("ru = 'Данные могут быть выгружены не полностью.'");
//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
//		//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 09.02.2021 13:35:03
//			УчетнаяЗапись=РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
//			ДанныеДляОтправки=Новый Структура;
//			ДанныеДляОтправки.Вставить("Кому","podkin@smart-t.ru"); 
//			ДанныеДляОтправки.Вставить("Тема","В базе бух РезультатВыгрузкиВXML!");
//			ДанныеДляОтправки.Вставить("Тело","Проведена Корректировка: "+ТекстСообщения
//										+Символы.ПС+"Рассылка из базы БП РасширениеСмарт.ВыгрузкаЗагрузкаEnterpriseData.смарт_РезультатВыгрузкиВXML");
//			ДанныеДляОтправки.Вставить("ТипТекста",ТипТекстаПочтовогоСообщения.ПростойТекст);
//			ДанныеДляОтправки.Вставить("Важность",ВажностьИнтернетПочтовогоСообщения.Высокая);
//			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись,ДанныеДляОтправки);
//		//Смарт }Подкин Алексей Иванович 09.02.2021 13:35:03
//		
//	ИначеЕсли Не РезультатВыгрузки.ЕстьВыгруженныеОбъекты Тогда
//		ТекстСообщения = НСтр("ru = 'Не найдено ни одного объекта к выгрузке.'");
//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
//	КонецЕсли;
//	
//	Если МестоВыгрузки = 0 Тогда // в файл
//		
//		СодержимоеХранилища = Новый ДвоичныеДанные(АдресНаСервере);
//		
//	Иначе // в текст
//		
//		ТекстовыйДокумент = Новый ТекстовыйДокумент;
//		ТекстовыйДокумент.Прочитать(АдресНаСервере);
//		СодержимоеХранилища = ТекстовыйДокумент.ПолучитьТекст();
//		
//	КонецЕсли;
//	
//	Если АдресДляРазмещенияРезультата = Неопределено Тогда
//		
//		АдресХранения = ПоместитьВоВременноеХранилище(СодержимоеХранилища);
//		
//	Иначе
//		
//		ПоместитьВоВременноеХранилище(СодержимоеХранилища, АдресДляРазмещенияРезультата);
//		АдресХранения = АдресДляРазмещенияРезультата;
//		
//	КонецЕсли;
//	УдалитьФайлы(АдресНаСервере);
//	
//	Возврат АдресХранения;

//КонецФункции

//#КонецОбласти