
#Область ПеренесеноСДоработкамиСмарт

//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
&ИзменениеИКонтроль("Печать")
Процедура смарт_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	Перем ИмяМакета;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТранспортнаяНакладная") Тогда

		#Вставка
		//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
		Если ТипЗнч(ПараметрыВывода) = Тип("Структура") 
			И ПараметрыВывода.Свойство("смартЭтоСкладАдмирал") 
			И ПараметрыВывода.смартЭтоСкладАдмирал Тогда
			
			смартОбъектыПечати = ОбъектыПечати;
			
			ОбъектыПечати = Новый Структура;
			ОбъектыПечати.Вставить("ОбъектыПечати",		   смартОбъектыПечати);
			ОбъектыПечати.Вставить("смартЭтоСкладАдмирал", Истина);

		КонецЕсли;
		//-- #Б-1828 смарт: Лопато 09.01.2025
		#КонецВставки
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТранспортнаяНакладная", "Транспортная накладная",
			СформироватьПечатнуюФормуТранспортнойНакладной(МассивОбъектов, ОбъектыПечати, ИмяМакета),,ИмяМакета);
	КонецЕсли;
	
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);	
КонецПроцедуры

//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
&ИзменениеИКонтроль("СформироватьПечатнуюФормуТранспортнойНакладной")
Функция смарт_СформироватьПечатнуюФормуТранспортнойНакладной(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМакета = Неопределено;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.АвтоМасштаб          = Истина;
	ТабличныйДокумент.ОриентацияСтраницы   = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТРАНСПОРТНАЯ_НАКЛАДНАЯ";
	
	ПечатьТорговыхДокументов.УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ПервыйДокумент = Истина;
	
	Для Каждого СтруктураОбъектов Из ОбщегоНазначенияБП.РазложитьСписокПоТипамОбъектов(МассивОбъектов) Цикл
		
		#Удаление //++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
		ДанныеДляПечати = Документы[СтруктураОбъектов.Ключ.Имя].ПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная(СтруктураОбъектов.Значение);
		#КонецУдаления
		
		#Вставка
		//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
		Если ТипЗнч(ОбъектыПечати) = Тип("Структура") 
			И ОбъектыПечати.Свойство("смартЭтоСкладАдмирал") 
			И ОбъектыПечати.смартЭтоСкладАдмирал Тогда
				
			ДанныеДляПечати = смартПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная(СтруктураОбъектов.Значение);
			
			ОбъектыПечати = ОбъектыПечати.ОбъектыПечати;
			
		Иначе

			ДанныеДляПечати = Документы[СтруктураОбъектов.Ключ.Имя].ПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная(СтруктураОбъектов.Значение);
			
		КонецЕсли;
		//-- #Б-1828 смарт: Лопато 09.01.2025
		#КонецВставки
		
		ЗаполнитьТабличныйДокументТН(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ИмяМакета, ПервыйДокумент);
	КонецЦикла;
	
	Если ИмяМакета = Неопределено Тогда
		ИмяМакета = "";
	КонецЕсли; 
	
	Возврат ТабличныйДокумент;
КонецФункции

#КонецОбласти

#Область ДоработкиСмарт

//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
//++ смарт:ММ 663 02.10.2021 
Функция смартПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная(МассивОбъектов)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Организация,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Перевозчик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	        ТОГДА """"
	|		ИНАЧЕ РеализацияТоваровУслуг.Перевозчик
	|	КОНЕЦ КАК Перевозчик,
	|	РеализацияТоваровУслуг.Организация КАК Руководители,
	|	РеализацияТоваровУслуг.Контрагент КАК Покупатель,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Контрагент КАК ЗаказчикПеревозок,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.Представление КАК Основание,
	|	РеализацияТоваровУслуг.АдресДоставки,
	|	РеализацияТоваровУслуг.КраткоеНаименованиеГруза,
	|	РеализацияТоваровУслуг.СопроводительныеДокументы,
	|	РеализацияТоваровУслуг.Водитель,
	|	РеализацияТоваровУслуг.ВодительскоеУдостоверение,
	|	РеализацияТоваровУслуг.МаркаАвтомобиля,
	|	РеализацияТоваровУслуг.РегистрационныйЗнакАвтомобиля,
	|	РеализацияТоваровУслуг.ОтпускПроизвел
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)";
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата;
	
КонецФункции //-- смарт:ММ 02.10.2021

#КонецОбласти
