
&НаСервере
&ИзменениеИКонтроль("СформироватьСписокДействий")
//++ #Б-5154 смарт: Фролов 26.03.2026 //Изменение счета учета в документе через Изменить
Процедура смарт_СформироватьСписокДействий(СписокДействий)

	// Заполним список возможных действий с табличной частью.
	СписокДействий.Очистить();

	ПравоПросмотраЦен = ПравоДоступа("Просмотр", Метаданные.Справочники.ТипыЦенНоменклатуры);

	Если ПравоПросмотраЦен И ПоказыватьЦену И ОбрабатыватьПоТипуЦен Тогда
		СписокДействий.Добавить("УстановитьЦеныПоТипу", 				НСтр("ru = 'Установить цены по типу'"));
	КонецЕсли;

	Если ПравоПросмотраЦен И ПоказыватьЦенуВРознице  Тогда
		СписокДействий.Добавить("УстановитьЦеныВРозницеПоТипу", 		НСтр("ru = 'Установить цены в рознице по типу'"));
	КонецЕсли;

	Если ПоказыватьСтавкуНДС Тогда
		СписокДействий.Добавить("УстановитьСтавкуНДС", 					НСтр("ru = 'Установить ставку НДС'"));
	КонецЕсли;

	Если ПоказыватьСпособУчетаНДС Тогда
		СписокДействий.Добавить("УстановитьСпособУчетаНДС",				НСтр("ru = 'Установить способ учета НДС'"));
	КонецЕсли;

	Если ПоказыватьНомерГТД Тогда
		СписокДействий.Добавить("УстановитьНомерГТД", 					НСтр("ru = 'Установить номер ГТД'"));
	КонецЕсли;

	Если ПоказыватьСтрануПроисхождения Тогда
		СписокДействий.Добавить("УстановитьСтрануПроисхождения", 		НСтр("ru = 'Установить страну происхождения'"));
	КонецЕсли;

	Если ПоказыватьЦену Тогда
		СписокДействий.Добавить("ИзменитьЦеныНаПроцент",				НСтр("ru = 'Изменить цены на процент'"));
	КонецЕсли;

	Если ПоказыватьСкидку Тогда
		СписокДействий.Добавить("УстановитьПроцентСкидки",					НСтр("ru = 'Установить процент скидки'"));
	КонецЕсли;

	Если ПоказыватьЦенуВРознице Тогда
		СписокДействий.Добавить("ИзменитьЦеныВРозницеНаПроцент",		НСтр("ru = 'Изменить цены в рознице на процент'"));
	КонецЕсли;

	Если ПоказыватьЦену И ОбрабатыватьПоТипуЦен Тогда
		СписокДействий.Добавить("ОкруглитьЦеныДо", 						НСтр("ru = 'Округлить цены до'"));
	КонецЕсли;

	Если ПоказыватьЦенуВРознице Тогда
		СписокДействий.Добавить("ОкруглитьЦеныВРозницеДо",				НСтр("ru = 'Округлить цены в рознице до'"));	
	КонецЕсли;

	Если ПоказыватьСумму Тогда

		СписокДействий.Добавить("РаспределитьСуммуПоКоличеству", 		НСтр("ru = 'Распределить сумму по количеству'"));

		Если ПоказыватьСуммуНДС Тогда
			Если ДокументСуммаВключаетНДС Тогда 
				СписокДействий.Добавить("РаспределитьСуммуПоСуммам", 	НСтр("ru = 'Распределить сумму по сумме с НДС'"));
			Иначе
				СписокДействий.Добавить("РаспределитьСуммуПоСуммам", 	НСтр("ru = 'Распределить сумму по сумме без НДС'"));
			КонецЕсли;
		Иначе
			СписокДействий.Добавить("РаспределитьСуммуПоСуммам", 		НСтр("ru = 'Распределить сумму по сумме'"));
		КонецЕсли;

	КонецЕсли;
	
	#Вставка
	//++ #Б-5154 смарт: Фролов 26.03.2026 //Изменение счета учета в документе через Изменить
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		СписокДействий.Добавить("ИзменитьСчетОтправителя", 		НСтр("ru = 'Изменить счет отправителя'"));
		СписокДействий.Добавить("ИзменитьСчетПолучателя", 		НСтр("ru = 'Изменить счет получателя'"));
		
	КонецЕсли;
	//-- #Б-5154 смарт: Фролов 26.03.2026
	#КонецВставки

КонецПроцедуры //-- #Б-5154 смарт: Фролов 26.03.2026

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
//++ #Б-5154 смарт: Фролов 26.03.2026 //Изменение счета учета в документе через Изменить
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Параметры.АдресХранилищаТовары) Тогда
		ТекстСообщения = НСтр("ru='Непосредственное открытие обработки изменения таблицы товаров не предусмотрено.
				|Для открытия обработки можно воспользоваться командой ""Изменить"" в формах документов'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	//заполним реквизиты формы из переданных параметров
	СписокСвойств = "АдресХранилищаТовары, ЗаполнятьЦеныПоПокупке, ДокументСсылка, ДокументДата, ДокументОрганизация, ПоказыватьСкидку, ИсключатьРеквизиты,
		|ДокументВалюта, ДокументКурс, ДокументКратность, ДокументБезНДС, НДСНеВыделять, ДокументСуммаВключаетНДС, ДокументТипЦен, ДокументСклад"; 
	//Если вызывается из документа использующего упковки добавляем в список свойств
	Если Параметры.Свойство("ИспользуютсяУпаковки") Тогда
		СписокСвойств = СписокСвойств + ", ИспользуютсяУпаковки";	
	КонецЕсли;
	//КонецУпаковки
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, СписокСвойств);
	Если Не ПравоДоступа("Просмотр", Метаданные.Справочники.ТипыЦенНоменклатуры) Тогда
		ДокументТипЦен = Неопределено;
	КонецЕсли;
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(Параметры.АдресХранилищаТовары);
	Объект.Товары.Загрузить(ТаблицаТоваров);
	
	//Установим пометку и заполним номер строки документа
	Для каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		СтрокаТабличнойЧасти.Пометка 					= Истина;
		СтрокаТабличнойЧасти.НомерСтрокиДокумента 		= СтрокаТабличнойЧасти.НомерСтроки;
		СтрокаТабличнойЧасти.НоменклатураДоИзменения 	= СтрокаТабличнойЧасти.Номенклатура;
	КонецЦикла;
	
	Если Параметры.Свойство("ИмяТаблицы") Тогда
		ИмяТаблицы = Параметры.ИмяТаблицы;
	Иначе
		ИмяТаблицы = "Товары";
	КонецЕсли;
	
	Если Параметры.Свойство("ИменаТаблицИсточников") Тогда
		ИменаТаблицИсточников = Параметры.ИменаТаблицИсточников;
	Иначе
		ИменаТаблицИсточников.Добавить("Товары");
	КонецЕсли;
	
	Если ИменаТаблицИсточников.НайтиПоЗначению("Товары") <> Неопределено Тогда
		ИменаТаблицИсточников.Добавить("Продукция");
	КонецЕсли; 
	
	Если Параметры.Свойство("РазрешитьУслуги") Тогда
		РазрешитьУслуги = Параметры.РазрешитьУслуги;
	КонецЕсли;
	
	#Вставка
	//++ #Б-5154 смарт: Фролов 26.03.2026 //Изменение счета учета в документе через Изменить
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		МассивРеквизитов = Новый Массив;
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы("ВариантЗначенияСчетОтправителя", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("ВариантЗначенияСчетПолучателя", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный")));
		
		ИзменитьРеквизиты(МассивРеквизитов);
		
		МассивСчетов = Новый Массив;
		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.СырьеИМатериалы);
		МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ТоварыНаСкладах);
		
		НовыйЭлемент = Элементы.Добавить("ВариантЗначенияСчетОтправителя", Тип("ПолеФормы"), Элементы.ВариантЗначения); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "ВариантЗначенияСчетОтправителя";
		НовыйЭлемент.Заголовок = "Счет отправителя"; 
		НовыйЭлемент.РежимВыбораИзСписка = Истина;
		НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(МассивСчетов);
		
		НовыйЭлемент = Элементы.Добавить("ВариантЗначенияСчетПолучателя", Тип("ПолеФормы"), Элементы.ВариантЗначения); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "ВариантЗначенияСчетПолучателя";
		НовыйЭлемент.Заголовок = "Счет получателя";
		НовыйЭлемент.РежимВыбораИзСписка = Истина;
		НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(МассивСчетов);
		
		НовыйЭлемент = Элементы.Добавить("ТоварыСчетОтправителя", Тип("ПолеФормы"), Элементы.Товары); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.Товары.СчетУчета";
		НовыйЭлемент.Заголовок = "Счет отправителя";

		НовыйЭлемент = Элементы.Добавить("ТоварыСчетПолучателя", Тип("ПолеФормы"), Элементы.Товары); 	
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.Товары.НовыйСчетУчета";
		НовыйЭлемент.Заголовок = "Счет получателя"; 
		
	КонецЕсли;
	//-- #Б-5154 смарт: Фролов 26.03.2026
	#КонецВставки
	
	ПодготовитьФормуНаСервере();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры //-- #Б-5154 смарт: Фролов 26.03.2026

&НаСервереБезКонтекста
&ИзменениеИКонтроль("ВариантыЗначений")
//++ #Б-5154 смарт: Фролов 26.03.2026 //Изменение счета учета в документе через Изменить
Функция смарт_ВариантыЗначений()

	ВариантыЗначений = Новый ТаблицаЗначений;
	ВариантыЗначений.Колонки.Добавить("Действие", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ВариантыЗначений.Колонки.Добавить("ИмяВариантаЗначения", ОбщегоНазначения.ОписаниеТипаСтрока(0));

	ДобавитьВариантЗначения(ВариантыЗначений, "УстановитьЦеныПоТипу", "ТипЦенНоменклатуры");
	ДобавитьВариантЗначения(ВариантыЗначений, "УстановитьЦеныВРозницеПоТипу", "ТипЦенНоменклатуры");
	ДобавитьВариантЗначения(ВариантыЗначений, "РаспределитьСуммуПоСуммам", "ЧислоСумма");
	ДобавитьВариантЗначения(ВариантыЗначений, "РаспределитьСуммуПоКоличеству", "ЧислоСумма");
	ДобавитьВариантЗначения(ВариантыЗначений, "ИзменитьЦеныНаПроцент", "ЧислоПроцент");
	ДобавитьВариантЗначения(ВариантыЗначений, "ИзменитьЦеныВРозницеНаПроцент", "ЧислоПроцент");
	ДобавитьВариантЗначения(ВариантыЗначений, "УстановитьПроцентСкидки", "ЧислоПроцент");
	ДобавитьВариантЗначения(ВариантыЗначений, "ОкруглитьЦеныДо", "ПорядокОкругления");
	ДобавитьВариантЗначения(ВариантыЗначений, "ОкруглитьЦеныВРозницеДо", "ПорядокОкругления");
	ДобавитьВариантЗначения(ВариантыЗначений, "УстановитьСтавкуНДС", "СтавкаНДС");
	ДобавитьВариантЗначения(ВариантыЗначений, "УстановитьСпособУчетаНДС", "СпособУчетаНДС");
	ДобавитьВариантЗначения(ВариантыЗначений, "УстановитьНомерГТД", "НомерГТД");
	ДобавитьВариантЗначения(ВариантыЗначений, "УстановитьСтрануПроисхождения", "СтранаПроисхождения");
	
	#Вставка
	//++ #Б-5154 смарт: Фролов 26.03.2026 //Изменение счета учета в документе через Изменить
	ДобавитьВариантЗначения(ВариантыЗначений, "ИзменитьСчетОтправителя", "СчетОтправителя");
	ДобавитьВариантЗначения(ВариантыЗначений, "ИзменитьСчетПолучателя", "СчетПолучателя");
	//-- #Б-5154 смарт: Фролов 26.03.2026
	#КонецВставки
	
	Возврат ВариантыЗначений;

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ВыполнитьДействие")
//++ #Б-5154 смарт: Фролов 26.03.2026 //Изменение счета учета в документе через Изменить
Процедура смарт_ВыполнитьДействие(Команда)

	Если ТекущееДействие = "УстановитьЦеныПоТипу" Тогда
		
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияТипЦенНоменклатуры) Тогда
			ТекстСообщения = НСтр("ru = 'Не указан тип цен номенклатуры'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияТипЦенНоменклатуры");
			Возврат;
		КонецЕсли;
		
		УстановитьЦеныПоТипу(ВариантЗначенияТипЦенНоменклатуры);
		
	ИначеЕсли ТекущееДействие = "УстановитьЦеныВРозницеПоТипу" Тогда
		
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияТипЦенНоменклатуры) Тогда
			ТекстСообщения = НСтр("ru = 'Не указан тип цен номенклатуры'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияТипЦенНоменклатуры");
			Возврат;
		КонецЕсли;
		
		УстановитьЦеныВРозницеПоТипу(ВариантЗначенияТипЦенНоменклатуры);

	ИначеЕсли ТекущееДействие = "РаспределитьСуммуПоСуммам" Тогда
	
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияЧислоСумма) Тогда
			ТекстСообщения = НСтр("ru = 'Не указана сумма распределения! Распределение невозможно'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияЧислоСумма");
			Возврат;
		КонецЕсли;
		
		РаспределитьСуммуПоКолонке("Сумма", ВариантЗначенияЧислоСумма);
		
	ИначеЕсли ТекущееДействие = "РаспределитьСуммуПоКоличеству" Тогда
		
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияЧислоСумма) Тогда
			ТекстСообщения = НСтр("ru = 'Не указана сумма распределения! Распределение невозможно'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияЧислоСумма");
			Возврат;
		КонецЕсли;
		
		РаспределитьСуммуПоКолонке("Количество", ВариантЗначенияЧислоСумма);
		
	ИначеЕсли ТекущееДействие = "ИзменитьЦеныНаПроцент" Тогда
		
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияЧислоПроцент) Тогда
			ТекстСообщения = НСтр("ru = 'Не указан процент'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияЧислоПроцент");
			Возврат;
		КонецЕсли;
		
		ИзменитьЦенуНаПроцент(ВариантЗначенияЧислоПроцент);
		
	ИначеЕсли ТекущееДействие = "ИзменитьЦеныВРозницеНаПроцент" Тогда
		
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияЧислоПроцент) Тогда
			ТекстСообщения = НСтр("ru = 'Не указан процент'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияЧислоПроцент");
			Возврат;
		КонецЕсли;
		
		ИзменитьЦенуВРозницеНаПроцент(ВариантЗначенияЧислоПроцент);
		
	ИначеЕсли ТекущееДействие = "УстановитьПроцентСкидки" Тогда
		
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияЧислоПроцент) Тогда
			ТекстСообщения = НСтр("ru = 'Не указан процент'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияЧислоПроцент");
			Возврат;
		КонецЕсли;
		
		УстановитьПроцентСкидки(ВариантЗначенияЧислоПроцент);
		
	ИначеЕсли ТекущееДействие = "ОкруглитьЦеныДо" Тогда
		
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияПорядокОкругления) Тогда
			ТекстСообщения = НСтр("ru = 'Не указан порядок округления'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияПорядокОкругления");
			Возврат;
		КонецЕсли;
		
		ОкруглитьЦену(ВариантЗначенияПорядокОкругления);
			
	ИначеЕсли ТекущееДействие = "ОкруглитьЦеныВРозницеДо" Тогда
		
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияПорядокОкругления) Тогда
			ТекстСообщения = НСтр("ru = 'Не указан порядок округления'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияПорядокОкругления");
			Возврат;
		КонецЕсли;
		
		ОкруглитьЦенуВРознице(ВариантЗначенияПорядокОкругления);
		
	ИначеЕсли ТекущееДействие = "УстановитьСтавкуНДС" Тогда
		
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияСтавкаНДС) Тогда
			ТекстСообщения = НСтр("ru = 'Не указана ставка НДС'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияСтавкаНДС");
			Возврат;
		КонецЕсли;
		
		УстановитьСтавкуНДС(ВариантЗначенияСтавкаНДС);
		
	ИначеЕсли ТекущееДействие = "УстановитьСпособУчетаНДС" Тогда
		
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияСпособУчетаНДС) Тогда
			ТекстСообщения = НСтр("ru = 'Не указан способ учета НДС'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияСпособУчетаНДС");
			Возврат;
		КонецЕсли;
		
		УстановитьСпособУчетаНДС(ВариантЗначенияСпособУчетаНДС);
		
	ИначеЕсли ТекущееДействие = "УстановитьНомерГТД" Тогда
		
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияНомерГТД) Тогда
			ТекстСообщения = НСтр("ru = 'Не указан номер ГТД'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияНомерГТД");
			Возврат;
		КонецЕсли;
		
		УстановитьНомерГТД(ВариантЗначенияНомерГТД);
		
	ИначеЕсли ТекущееДействие = "УстановитьСтрануПроисхождения" Тогда
		
		Если НЕ ЗначениеЗаполнено(ВариантЗначенияСтранаПроисхождения) Тогда
			ТекстСообщения = НСтр("ru = 'Не указана страна происхождения'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияСтранаПроисхождения");
			Возврат;
		КонецЕсли;
		
		УстановитьСтрануПроисхождения(ВариантЗначенияСтранаПроисхождения);
		
	#Вставка
	//++ #Б-5154 смарт: Фролов 26.03.2026 //Изменение счета учета в документе через Изменить
	ИначеЕсли ТекущееДействие = "ИзменитьСчетОтправителя" Тогда

		Если НЕ ЗначениеЗаполнено(ЭтаФорма.ВариантЗначенияСчетОтправителя) Тогда
			ТекстСообщения = НСтр("ru = 'Не указан счет отправителя'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияСчетОтправителя");
			Возврат;
		КонецЕсли;

		смартИзменитьСчетОтправителя(ЭтаФорма.ВариантЗначенияСчетОтправителя);
	ИначеЕсли ТекущееДействие = "ИзменитьСчетПолучателя" Тогда

		Если НЕ ЗначениеЗаполнено(ЭтаФорма.ВариантЗначенияСчетПолучателя) Тогда
			ТекстСообщения = НСтр("ru = 'Не указан счет получателя'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВариантЗначенияСчетПолучателя");
			Возврат;
		КонецЕсли;

		смартИзменитьСчетПолучателя(ЭтаФорма.ВариантЗначенияСчетПолучателя);
	//-- #Б-5154 смарт: Фролов 26.03.2026	
	#КонецВставки
	
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущееДействие) Тогда
		
		ТекстСообщения = НСтр("ru = 'Не указано действие'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ТекущееДействие");
		Возврат;
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Действие указано не верно!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ТекущееДействие");
		Возврат;
		
	КонецЕсли;
	
	//Если используются Упаковки пересчитываем количество и цену за упаковку по строкам
	Если ИспользуютсяУпаковки Тогда
		ПересчитатьКоличествоЦенуУпаковкиНаСервере();
	КонецЕсли;
	

	Модифицированность = Истина;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры //-- #Б-5154 смарт: Фролов 26.03.2026

&НаСервере
//++ #Б-5154 смарт: Фролов 26.03.2026 //Изменение счета учета в документе через Изменить
Процедура смартИзменитьСчетОтправителя(СчетОтправителя) 
	
	Для Каждого СтрТовары Из Объект.Товары Цикл
		
		Если СтрТовары.Пометка Тогда
			
			СтрТовары.СчетУчета = СчетОтправителя;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры //-- #Б-5154 смарт: Фролов 26.03.2026

&НаСервере
//++ #Б-5154 смарт: Фролов 26.03.2026 //Изменение счета учета в документе через Изменить
Процедура смартИзменитьСчетПолучателя(СчетПолучателя) 
	
	Для Каждого СтрТовары Из Объект.Товары Цикл
		
		Если СтрТовары.Пометка Тогда
			
			СтрТовары.НовыйСчетУчета = СчетПолучателя;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры //-- #Б-5154 смарт: Фролов 26.03.2026
