

/////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда 
		Запись.Идентификатор = Строка(Новый УникальныйИдентификатор); 
		Если Параметры.ЗначенияЗаполнения.Свойство("Владелец") Тогда
			Элементы.Владелец.ТолькоПросмотр = Истина;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

#Область ОбработчикиКомандФормы

#КонецОбласти

/////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
