
#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("ПакетДокументов")
Функция смарт_ПакетДокументов(ТабличныеДокументы, ОбъектыПечати, ПечататьКомплектами, КоличествоЭкземпляров = 1)

	ПакетОтображаемыхДокументов = Новый ПакетОтображаемыхДокументов;
	ПакетОтображаемыхДокументов.РазборПоКопиям = Истина;
	КоллекцияПечатныхФорм = ТабличныеДокументы.ВыгрузитьЗначения();

	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		ПечататьКомплектами = ПечататьКомплектами Или ПечатнаяФорма.ДвусторонняяПечать <> ТипДвустороннейПечати.Нет;
	КонецЦикла;

	Если ПечататьКомплектами И ОбъектыПечати.Количество() > 1 Тогда 
		Для Каждого ОбъектПечати Из ОбъектыПечати Цикл
			ИмяОбласти = ОбъектПечати.Представление;
			Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
				Область = ПечатнаяФорма.Области.Найти(ИмяОбласти);
				Если Область = Неопределено Тогда
					Продолжить;
				КонецЕсли;

				ТабличныйДокумент = ПечатнаяФорма.ПолучитьОбласть(Область.Верх, , Область.Низ);
				СкопироватьСвойстваТабличногоДокумента(ТабличныйДокумент, ПечатнаяФорма);

				#Вставка
				//++ #Б680 смарт: Шляпников 29.10.2024 / Печать документов в БП, ИТСМ 1961
				ТабличныйДокумент.КоличествоЭкземпляров = ПечатнаяФорма.КоличествоЭкземпляров;
				//-- #Б680 смарт: Шляпников 29.10.2024
				#КонецВставки
				
				ПакетОтображаемыхДокументов.Состав.Добавить().Данные = ПакетСОднимТабличнымДокументом(ТабличныйДокумент);
			КонецЦикла;
		КонецЦикла;
	Иначе
		Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
			ТабличныйДокумент = Новый ТабличныйДокумент;
			ТабличныйДокумент.Вывести(ПечатнаяФорма);
			СкопироватьСвойстваТабличногоДокумента(ТабличныйДокумент, ПечатнаяФорма);
			
			#Вставка
			//++ #Б680 смарт: Шляпников 29.10.2024 / Печать документов в БП, ИТСМ 1961
			ТабличныйДокумент.КоличествоЭкземпляров = ПечатнаяФорма.КоличествоЭкземпляров;
			//-- #Б680 смарт: Шляпников 29.10.2024
			#КонецВставки
			
			ПакетОтображаемыхДокументов.Состав.Добавить().Данные = ПакетСОднимТабличнымДокументом(ТабличныйДокумент);
		КонецЦикла;
	КонецЕсли;

	ПакетКомплектов = Новый ПакетОтображаемыхДокументов;
	ПакетКомплектов.РазборПоКопиям = Истина;
	Для Номер = 1 По КоличествоЭкземпляров Цикл
		ПакетКомплектов.Состав.Добавить().Данные = ПакетОтображаемыхДокументов;
	КонецЦикла;

	Возврат ПакетКомплектов;

КонецФункции

//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
&ИзменениеИКонтроль("СформироватьПечатныеФормы")
Функция смарт_СформироватьПечатныеФормы(Знач ИмяМенеджераПечати, Знач ИменаМакетов, Знач МассивОбъектов, Знач ПараметрыПечати, 
	ДопустимыеТипыОбъектовПечати = Неопределено, Знач КодЯзыка = Неопределено, Знач ОбъектыПечати = Неопределено) Экспорт
	
	КоллекцияПечатныхФорм = ПодготовитьКоллекциюПечатныхФорм(Новый Массив);
	Если ОбъектыПечати = Неопределено Тогда
		ОбъектыПечати = Новый СписокЗначений;
	КонецЕсли;
	
	ПараметрыВывода = ПодготовитьСтруктуруПараметровВывода();
	Если ЗначениеЗаполнено(КодЯзыка) Тогда
		ПараметрыВывода.КодЯзыка = КодЯзыка;
	КонецЕсли;
	
	Если ТипЗнч(ИменаМакетов) = Тип("Строка") Тогда
		ИменаМакетов = СтрРазделить(ИменаМакетов, ",");
	Иначе // Тип("Массив")
		ИменаМакетов = ОбщегоНазначения.СкопироватьРекурсивно(ИменаМакетов);
	КонецЕсли;
	
	ОбщийМенеджерПечати = ИмяМодуляПечати();
	ПрефиксВнешнихПечатныхФорм = "ВнешняяПечатнаяФорма.";
	
	ИсточникВнешнихПечатныхФорм = ИмяМенеджераПечати;
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(МассивОбъектов)) Тогда
		ИсточникВнешнихПечатныхФорм = МассивОбъектов.Метаданные().ПолноеИмя();
	Иначе
		Если МассивОбъектов.Количество() > 0 Тогда
			ИсточникВнешнихПечатныхФорм = МассивОбъектов[0].Метаданные().ПолноеИмя();
		КонецЕсли;
	КонецЕсли;
	ВнешниеПечатныеФормы = СписокПечатныхФормИзВнешнихИсточников(ИсточникВнешнихПечатныхФорм);
	
	// Добавление внешних печатных форм в комплект.
	ДобавленныеВнешниеПечатныеФормы = Новый Массив;
	Если ТипЗнч(ПараметрыПечати) = Тип("Структура") 
		И ПараметрыПечати.Свойство("ДополнитьКомплектВнешнимиПечатнымиФормами") 
		И ПараметрыПечати.ДополнитьКомплектВнешнимиПечатнымиФормами Тогда 
		
		ИдентификаторыВнешнихПечатныхФорм = ВнешниеПечатныеФормы.ВыгрузитьЗначения();
		Для Каждого Идентификатор Из ИдентификаторыВнешнихПечатныхФорм Цикл
			ИменаМакетов.Добавить(ПрефиксВнешнихПечатныхФорм + Идентификатор);
			ДобавленныеВнешниеПечатныеФормы.Добавить(ПрефиксВнешнихПечатныхФорм + Идентификатор);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ИмяМакета Из ИменаМакетов Цикл
		// Проверка наличия уже напечатанной формы.
		НайденнаяПечатнаяФорма = КоллекцияПечатныхФорм.Найти(ИмяМакета, "ИмяМакета");
		Если НайденнаяПечатнаяФорма <> Неопределено Тогда
			ПоследняяДобавленнаяПечатнаяФорма = КоллекцияПечатныхФорм[КоллекцияПечатныхФорм.Количество() - 1];
			Если ПоследняяДобавленнаяПечатнаяФорма.ИмяМакета = НайденнаяПечатнаяФорма.ИмяМакета Тогда
				ПоследняяДобавленнаяПечатнаяФорма.Экземпляров = ПоследняяДобавленнаяПечатнаяФорма.Экземпляров + 1;
			Иначе
				КопияПечатнойФормы = КоллекцияПечатныхФорм.Добавить();
				ЗаполнитьЗначенияСвойств(КопияПечатнойФормы, НайденнаяПечатнаяФорма);
				КопияПечатнойФормы.Экземпляров = 1;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		// Поиск указания дополнительного менеджера печати в имени печатной формы.
		ИмяДополнительногоМенеджераПечати = "";
		Идентификатор = ИмяМакета;
		ВнешняяПечатнаяФорма = Неопределено;
		Если СтрНайти(Идентификатор, ПрефиксВнешнихПечатныхФорм) > 0 Тогда // это внешняя печатная форма
			Идентификатор = Сред(Идентификатор, СтрДлина(ПрефиксВнешнихПечатныхФорм) + 1);
			ВнешняяПечатнаяФорма = ВнешниеПечатныеФормы.НайтиПоЗначению(Идентификатор);
		ИначеЕсли СтрНайти(Идентификатор, ".") > 0 Тогда // Указан дополнительный менеджер печати.
			Если СтрНачинаетсяС(Идентификатор, ОбщийМенеджерПечати + ".") Тогда
				Идентификатор = Сред(Идентификатор, СтрДлина(ОбщийМенеджерПечати) + 2);
				ИмяДополнительногоМенеджераПечати = ОбщийМенеджерПечати;
			ИначеЕсли ИмяМенеджераПечати <> ОбщийМенеджерПечати Тогда
				Позиция = СтрНайти(Идентификатор, ".", НаправлениеПоиска.СКонца);
				ИмяДополнительногоМенеджераПечати = Лев(Идентификатор, Позиция - 1);
				Идентификатор = Сред(Идентификатор, Позиция + 1);
			КонецЕсли;
		КонецЕсли;
		
		// Определение внутреннего менеджера печати.
		ИспользуемыйМенеджерПечати = ИмяДополнительногоМенеджераПечати;
		Если ПустаяСтрока(ИспользуемыйМенеджерПечати) Тогда
			ИспользуемыйМенеджерПечати = ИмяМенеджераПечати;
		КонецЕсли;
		
		// Проверка соответствия печатаемых объектов выбранной печатной форме.
		ОбъектыСоответствующиеПечатнойФорме = МассивОбъектов;
		Если ДопустимыеТипыОбъектовПечати <> Неопределено И ДопустимыеТипыОбъектовПечати.Количество() > 0 Тогда
			Если ТипЗнч(МассивОбъектов) = Тип("Массив") Тогда
				ОбъектыСоответствующиеПечатнойФорме = Новый Массив;
				Для Каждого Объект Из МассивОбъектов Цикл
					Если ДопустимыеТипыОбъектовПечати.Найти(ТипЗнч(Объект)) = Неопределено Тогда
						СообщитьПечатнаяФормаНедоступна(Объект);
					Иначе
						ОбъектыСоответствующиеПечатнойФорме.Добавить(Объект);
					КонецЕсли;
				КонецЦикла;
				Если ОбъектыСоответствующиеПечатнойФорме.Количество() = 0 Тогда
					ОбъектыСоответствующиеПечатнойФорме = Неопределено;
				КонецЕсли;
			ИначеЕсли ОбщегоНазначения.ЗначениеСсылочногоТипа(МассивОбъектов) Тогда // передан не массив
				Если ДопустимыеТипыОбъектовПечати.Найти(ТипЗнч(МассивОбъектов)) = Неопределено Тогда
					СообщитьПечатнаяФормаНедоступна(МассивОбъектов);
					ОбъектыСоответствующиеПечатнойФорме = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		УправлениеПечатьюПереопределяемый.ПередПечатью(Идентификатор, ОбъектыСоответствующиеПечатнойФорме, ПараметрыПечати);
		
		ЗарплатаКадры.ПриОпределенииОбъектовПечатнойФормы(
			ОбъектыСоответствующиеПечатнойФорме, Идентификатор, ИспользуемыйМенеджерПечати, ПараметрыПечати);
		
		ВременнаяКоллекцияДляОднойПечатнойФормы = ПодготовитьКоллекциюПечатныхФорм(Идентификатор);
		
		// Вызов процедуры Печать из менеджера печати.
		Если ВнешняяПечатнаяФорма <> Неопределено Тогда
			// Менеджер печати во внешней печатной форме.
			ПечатьПоВнешнемуИсточнику(
				СсылкаДополнительнойПечатнойФормы(ВнешняяПечатнаяФорма.Значение, ИсточникВнешнихПечатныхФорм),
				Новый Структура("ИдентификаторКоманды, ОбъектыНазначения", ВнешняяПечатнаяФорма.Значение, ОбъектыСоответствующиеПечатнойФорме),
				ВременнаяКоллекцияДляОднойПечатнойФормы,
				ОбъектыПечати,
				ПараметрыВывода);
		Иначе
			Если Не ПустаяСтрока(ИспользуемыйМенеджерПечати) Тогда
				// Печать внутренней печатной формы.
				Если ОбъектыСоответствующиеПечатнойФорме <> Неопределено Тогда
					
					#Вставка
					//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
					//++ смарт:Демичев #895 14.11.2022((Доработка задачи Холопова по прослеживаемому товару
					СтруктураПроверки = смартВернутьСписокПроверяемыхОбъектов(ОбъектыСоответствующиеПечатнойФорме,ВременнаяКоллекцияДляОднойПечатнойФормы);
					
					Если СтруктураПроверки.МассивПрослеживаемыйТовар.Количество() Тогда
						
						ТекстПрослеживаемыйТовар ="Следующие документы исключены из печати,так как имеют в составе просеживаемый товар:" + Символы.ПС;
						ТекстДок = "";
						Для Каждого СтрокаПроверка из СтруктураПроверки.МассивПрослеживаемыйТовар Цикл
							
							ТекстДок = ТекстДок + Строка(СтрокаПроверка) + Символы.ПС;
							
						КонецЦикла;
						
						ТекстУведомление = "Документы с прослеживаемым товаром можно подписывать только по ЭДО!" + Символы.ПС;
						
						ОбщегоНазначения.СообщитьПользователю(ТекстПрослеживаемыйтовар + ТекстДок + ТекстУведомление);
						
					КонецЕсли;
					
					Если Не СтруктураПроверки.НовыйМассивОбъектов.Количество() Тогда
						
						ТекстСообщенияОбОшибке = "При формировании печатной формы не найдено ни одного документа для печати.Обратитесь к администратору.";
						//ВызватьИсключение ТекстСообщенияОбОшибке;
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке);
						
						мСтруктураВозвратаОшибка = Новый Структура;
						мСтруктураВозвратаОшибка.Вставить("СмартОшибкаНетПФ",Истина);
						
						Результат = Новый Структура;
						Результат.Вставить("КоллекцияПечатныхФорм", мСтруктураВозвратаОшибка);//Подсунем сюда, чтобы в модуле формы ПечатьДокументов переопределить поведение программы
						Результат.Вставить("ОбъектыПечати", ОбъектыПечати);
						Результат.Вставить("ПараметрыВывода", ПараметрыВывода); 
					
						Возврат Результат;
						
					Иначе
						
						ОбъектыСоответствующиеПечатнойФорме = СтруктураПроверки.НовыйМассивОбъектов;
						
					КонецЕсли;								
					//-- смарт:Демичев #895 14.11.2022))Доработка задачи Холопова по прослеживаемому товару
					//-- #Б-1828 смарт: Лопато 09.01.2025
					#КонецВставки
					
					ЭтоПечатнаяФормаСКД = ИспользуемыйМенеджерПечати = ИмяМодуляПечати();
					Если ЭтоПечатнаяФормаСКД Тогда
						// @skip-check query-in-loop - Малый цикл
						Печать(ОбъектыСоответствующиеПечатнойФорме, ПараметрыПечати, ВременнаяКоллекцияДляОднойПечатнойФормы, 
							ОбъектыПечати, ПараметрыВывода); 
					Иначе
						ОчиститьПоследнийИспользованныйМакет();
						МенеджерПечати = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИспользуемыйМенеджерПечати);
						Попытка
							МенеджерПечати.Печать(ОбъектыСоответствующиеПечатнойФорме, ПараметрыПечати, ВременнаяКоллекцияДляОднойПечатнойФормы, 
								ОбъектыПечати, ПараметрыВывода);
						Исключение
							Если ВременнаяКоллекцияДляОднойПечатнойФормы.Количество() <> 1 Тогда
								ВызватьИсключение;
							КонецЕсли;
							
							ЗаписьЖурналаРегистрации(НСтр("ru = 'Печать'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , ,
								ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							
							Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПользовательскиеМакетыПечати) Тогда
								ВызватьИсключение НСтр("ru = 'Не удалось сформировать печатную форму.
									|Обратитесь к администратору.'");
							КонецЕсли;
							
							Если Не ЗначениеЗаполнено(ВременнаяКоллекцияДляОднойПечатнойФормы[0].ПолныйПутьКМакету) Тогда
								ПолныйПутьКМакету = ПоследнийИспользованныйМакет();
								
								//@skip-check query-in-loop - список макетов заранее неизвестен.
								Если ЗначениеЗаполнено(ПолныйПутьКМакету) И ИспользуетсяПользовательскийМакет(ПолныйПутьКМакету) Тогда
									ВременнаяКоллекцияДляОднойПечатнойФормы[0].ПолныйПутьКМакету = ПоследнийИспользованныйМакет();
								Иначе
									ВызватьИсключение;
								КонецЕсли;
							КонецЕсли;
							
							ВременнаяКоллекцияДляОднойПечатнойФормы[0].ТабличныйДокумент = Новый ТабличныйДокумент;
							ВременнаяКоллекцияДляОднойПечатнойФормы[0].ТекстОшибкиФормирования = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
						КонецПопытки;
					КонецЕсли;
				Иначе
					ВременнаяКоллекцияДляОднойПечатнойФормы[0].ТабличныйДокумент = Новый ТабличныйДокумент;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка корректности заполнения коллекции печатных форм, полученной из менеджера печати.
		Для Каждого ОписаниеПечатнойФормы Из ВременнаяКоллекцияДляОднойПечатнойФормы Цикл
			ОбщегоНазначенияКлиентСервер.Проверить(
				ТипЗнч(ОписаниеПечатнойФормы.Экземпляров) = Тип("Число") И ОписаниеПечатнойФормы.Экземпляров > 0,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не задано количество экземпляров для печатной формы ""%1"".'"),
				?(ПустаяСтрока(ОписаниеПечатнойФормы.СинонимМакета), ОписаниеПечатнойФормы.ИмяМакета, ОписаниеПечатнойФормы.СинонимМакета)));
		КонецЦикла;
				
		// обновление коллекции
		Отказ = ВременнаяКоллекцияДляОднойПечатнойФормы.Количество() = 0;
		// Предполагается одна печатная форма, но для обратной совместимости принимается вся коллекция.
		Для Каждого ВременнаяПечатнаяФорма Из ВременнаяКоллекцияДляОднойПечатнойФормы Цикл 
			
			Если ТипЗнч(ВременнаяПечатнаяФорма.ОфисныеДокументы) = Тип("Соответствие") Тогда
				КоличествоФайлов = 0;
				
				Для Каждого ОфисныйДокумент Из ВременнаяПечатнаяФорма.ОфисныеДокументы Цикл
					Если ЭтоАдресВременногоХранилища(ОфисныйДокумент.Ключ) Тогда
						КоличествоФайлов = КоличествоФайлов + 1;
					КонецЕсли;
				КонецЦикла;
				
				Если КоличествоФайлов = 0 Тогда
					ВременнаяПечатнаяФорма.ОфисныеДокументы = Неопределено;
				КонецЕсли;
				
				ВременнаяПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
			КонецЕсли;
			
			Если Не МакетСуществует(ВременнаяПечатнаяФорма.ПолныйПутьКМакету) Тогда
				ВременнаяПечатнаяФорма.ПолныйПутьКМакету = "";
			КонецЕсли;
			
			Если ВременнаяПечатнаяФорма.ТабличныйДокумент <> Неопределено Тогда
				ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
				ЗаполнитьЗначенияСвойств(ПечатнаяФорма, ВременнаяПечатнаяФорма);
				Если ВременнаяКоллекцияДляОднойПечатнойФормы.Количество() = 1 Тогда
					ПечатнаяФорма.ИмяМакета = ИмяМакета;
					ПечатнаяФорма.ИмяВРЕГ = ВРег(ИмяМакета);
				КонецЕсли;
				ПечатнаяФорма.Защита = ВременнаяПечатнаяФорма.ТабличныйДокумент.Защита;
			Иначе
				// Возникла ошибка при формировании печатной формы.
				Отказ = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		// Вызов исключения при возникновении ошибки.
		Если Отказ Тогда
			ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
				"ru = 'Не удалось сформировать печатную форму ""%1"". Обратитесь к администратору.'"), ИмяМакета);
			ВызватьИсключение ТекстСообщенияОбОшибке;
		КонецЕсли;
		
	КонецЦикла;
	
	ИнтеграцияПодсистемБСП.ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	УправлениеПечатьюПереопределяемый.ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
	// Установка количества экземпляров табличным документам, проверка областей.
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		ПроверитьРазметкуТабличногоДокументаПоОбъектамПечати(ПечатнаяФорма.ТабличныйДокумент, 
			ОбъектыПечати, ИмяМенеджераПечати, ПечатнаяФорма.ИмяМакета);
		Если ДобавленныеВнешниеПечатныеФормы.Найти(ПечатнаяФорма.ИмяМакета) <> Неопределено Тогда
			ПечатнаяФорма.Экземпляров = 0; // Для автоматически добавленных форм.
		КонецЕсли;
		Если ПечатнаяФорма.ТабличныйДокумент <> Неопределено Тогда
			ПечатнаяФорма.ТабличныйДокумент.КоличествоЭкземпляров = ПечатнаяФорма.Экземпляров;
			УбратьПодписьИПечать(ПечатнаяФорма.ТабличныйДокумент);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	Результат.Вставить("ОбъектыПечати", ОбъектыПечати);
	Результат.Вставить("ПараметрыВывода", ПараметрыВывода);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ДоработкиСмарт

//++ #Б-1828 смарт: Лопато 09.01.2025 //Рефакторинг. Перенос изменений в расширение
//++ смарт:Демичев #895 14.11.2022((Доработка задачи Холопова по прослеживаемому товару
Функция смартВернутьСписокПроверяемыхОбъектов(МассивОбъектов,КоллекцияПечатныхФорм)
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("НовыйМассивОбъектов",Новый Массив);
	СтруктураВозврата.Вставить("МассивПроверок",Новый Массив);
	СтруктураВозврата.Вставить("МассивПрослеживаемыйТовар",Новый Массив);
	
	Отказ = Истина;
	
	ТаблицаПФОтказ = Новый ТаблицаЗначений;
	ТаблицаПФОтказ.Колонки.Добавить("ИмяВРЕГ");
	
	мМассивФорм = Новый Массив;
	мМассивФорм.Добавить("ТОРГ12");
	мМассивФорм.Добавить("ТОРГ12_БЕЗУСЛУГ");
	мМассивФорм.Добавить("СЧЕТФАКТУРАКОМПЛЕКТ");
	мМассивФорм.Добавить("УНИВЕРСАЛЬНЫЙПЕРЕДАТОЧНЫЙДОКУМЕНТКОМПЛЕКТ");
	мМассивФорм.Добавить("НАКЛАДНАЯРЕАЛИЗАЦИЯ");
	мМассивФорм.Добавить("СЧЕТФАКТУРА");
	мМассивФорм.Добавить("СЧЕТФАКТУРА1137");
	мМассивФорм.Добавить("СЧЕТФАКТУРА981");
	мМассивФорм.Добавить("СЧЕТФАКТУРА534");
	мМассивФорм.Добавить("СЧЕТФАКТУРА534ПРОСЛЕЖ");
	мМассивФорм.Добавить("УПДСТАТУС1");
	мМассивФорм.Добавить("УПДСТАТУС2");
	мМассивФорм.Добавить("УПДСТАТУС1_981");
	мМассивФорм.Добавить("УПДСТАТУС1_534");
	мМассивФорм.Добавить("УПДСТАТУС2_534");
	мМассивФорм.Добавить("УПДСТАТУС2_981");
	мМассивФорм.Добавить("УПДСТАТУС1_534ПРОСЛЕЖ");
	мМассивФорм.Добавить("АКТНАПЕРЕДАЧУПРАВ");
	
	Для Н=1 По 18 Цикл
		ТаблицаПФОтказ.Добавить();
	КонецЦикла; 
	ТаблицаПФОтказ.ЗагрузитьКолонку(мМассивФорм,"ИмяВРЕГ");
	
	Для Каждого СтрокаПФ из КоллекцияПечатныхФорм Цикл
		
		Если УправлениеПечатью.НужноПечататьМакет(ТаблицаПФОтказ, СтрокаПФ.ИмяВРЕГ) Тогда
			Отказ = Ложь;
			Прервать;
		КонецЕсли;
				
	КонецЦикла;
	
	//Нет макета,который нельзя печатать
	Если Отказ Тогда
		
		СтруктураВозврата.НовыйМассивОбъектов = МассивОбъектов;
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Для Каждого Строка из МассивОбъектов Цикл
		
		Если ТипЗнч(Строка.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") или ТипЗнч(Строка.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда	
			СтруктураВозврата.МассивПроверок.Добавить(Строка.Ссылка);		
		Иначе	
			СтруктураВозврата.НовыйМассивОбъектов.Добавить(Строка.Ссылка);	
		КонецЕсли;
		
	КонецЦикла;
	
	
	Если СтруктураВозврата.МассивПроверок.Количество() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугТовары.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар
		|ПОМЕСТИТЬ ВТ_Отобранные
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка В(&Список)
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.ПрослеживаемыйТовар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Отобранные.Ссылка КАК РТУПрослеживаемый
		|ПОМЕСТИТЬ ВТ_ПрослеживаемыйТовар
		|ИЗ
		|	ВТ_Отобранные КАК ВТ_Отобранные
		|ГДЕ
		|	(ВТ_Отобранные.Номенклатура.ПрослеживаемыйТовар
		|			ИЛИ ВТ_Отобранные.ПрослеживаемыйТовар)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Отобранные.Ссылка КАК РТУБезПрослеживаемого
		|ИЗ
		|	ВТ_Отобранные КАК ВТ_Отобранные
		|ГДЕ
		|	НЕ ВТ_Отобранные.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_ПрослеживаемыйТовар.РТУПрослеживаемый КАК Ссылка
		|				ИЗ
		|					ВТ_ПрослеживаемыйТовар КАК ВТ_ПрослеживаемыйТовар)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Отобранные.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПрослеживаемыйТовар.РТУПрослеживаемый КАК РТУПрослеживаемый
		|ИЗ
		|	ВТ_ПрослеживаемыйТовар КАК ВТ_ПрослеживаемыйТовар
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПрослеживаемыйТовар.РТУПрослеживаемый";
		
		СписокРТУ = Новый СписокЗначений;
		СписокРТУ.ЗагрузитьЗначения(СтруктураВозврата.МассивПроверок);
		
		Запрос.УстановитьПараметр("Список", СписокРТУ);
		
		РезультатЗапросаПрослеживаемый = Запрос.ВыполнитьПакет();
		
		СтруктураВозврата.МассивПрослеживаемыйТовар =  РезультатЗапросаПрослеживаемый[3].Выгрузить().ВыгрузитьКолонку("РТУПрослеживаемый");
		
		мВыборкаРТУБезПросеживаемого = РезультатЗапросаПрослеживаемый[2].Выбрать();
		
		Пока мВыборкаРТУБезПросеживаемого.Следующий() Цикл	
			СтруктураВозврата.НовыйМассивОбъектов.Добавить(мВыборкаРТУБезПросеживаемого.РТУБезПрослеживаемого);	
		КонецЦикла;
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТ_СФ
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Ссылка В(&Список)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка,
		|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТ_СФОснование
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|ГДЕ
		|	СчетФактураВыданныйДокументыОснования.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_СФ.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_СФ КАК ВТ_СФ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СФ.Ссылка КАК СФ,
		|	ВТ_СФ.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТ_ВыборкаСФ
		|ИЗ
		|	ВТ_СФ КАК ВТ_СФ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_СФОснование.Ссылка,
		|	ВТ_СФОснование.ДокументОснование
		|ИЗ
		|	ВТ_СФОснование КАК ВТ_СФОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыборкаСФ.СФ КАК СФ,
		|	ВложенныйЗапрос.Ссылка КАК РТУ,
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар
		|ПОМЕСТИТЬ ВТ_Отобранные
		|ИЗ
		|	ВТ_ВыборкаСФ КАК ВТ_ВыборкаСФ
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
		|			РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|			РеализацияТоваровУслугТовары.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар
		|		ИЗ
		|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ГДЕ
		|			РеализацияТоваровУслугТовары.Ссылка В
		|					(ВЫБРАТЬ
		|						ВТ_ВыборкаСФ.ДокументОснование КАК ДокументОснование
		|					ИЗ
		|						ВТ_ВыборкаСФ КАК ВТ_ВыборкаСФ)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			РеализацияТоваровУслугТовары.Ссылка,
		|			РеализацияТоваровУслугТовары.Номенклатура,
		|			РеализацияТоваровУслугТовары.ПрослеживаемыйТовар) КАК ВложенныйЗапрос
		|		ПО ВТ_ВыборкаСФ.ДокументОснование = ВложенныйЗапрос.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ПрослеживаемыйТовар,
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВТ_ВыборкаСФ.СФ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Отобранные.СФ КАК СФ,
		|	ВТ_Отобранные.РТУ КАК РТУ,
		|	ВТ_Отобранные.Номенклатура КАК Номенклатура,
		|	ВТ_Отобранные.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар
		|ПОМЕСТИТЬ ВТ_ПрослеживаемыйТовар
		|ИЗ
		|	ВТ_Отобранные КАК ВТ_Отобранные
		|ГДЕ
		|	(ВТ_Отобранные.ПрослеживаемыйТовар
		|			ИЛИ ВТ_Отобранные.Номенклатура.ПрослеживаемыйТовар)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыборкаСФ.СФ КАК СФНЕПрослеживаемый
		|ИЗ
		|	ВТ_ВыборкаСФ КАК ВТ_ВыборкаСФ
		|ГДЕ
		|	НЕ ВТ_ВыборкаСФ.СФ В
		|				(ВЫБРАТЬ
		|					ВТ_ПрослеживаемыйТовар.СФ КАК СФ
		|				ИЗ
		|					ВТ_ПрослеживаемыйТовар КАК ВТ_ПрослеживаемыйТовар)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВыборкаСФ.СФ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПрослеживаемыйТовар.СФ КАК СФПрослеживаемый
		|ИЗ
		|	ВТ_ПрослеживаемыйТовар КАК ВТ_ПрослеживаемыйТовар
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПрослеживаемыйТовар.СФ";
		
		СписокСФ = Новый СписокЗначений;
		СписокСФ.ЗагрузитьЗначения(СтруктураВозврата.МассивПроверок);

		Запрос.УстановитьПараметр("Список", СписокСФ);

		РезультатЗапросаПрослеживаемыйСФ = Запрос.ВыполнитьПакет();
		
		мТЗСФПрослеживаемый =  РезультатЗапросаПрослеживаемыйСФ[6].Выгрузить();
		
		Для Каждого СтрокаСФПрослеживаемый из мТЗСФПрослеживаемый Цикл
			
			СтруктураВозврата.МассивПрослеживаемыйТовар.Добавить(СтрокаСФПрослеживаемый.СФПрослеживаемый);
			
		КонецЦикла;
		
		мВыборкаСФНЕПрослеживаемый =  РезультатЗапросаПрослеживаемыйСФ[5].Выбрать();
		
		Пока мВыборкаСФНЕПрослеживаемый.Следующий() Цикл
			
			СтруктураВозврата.НовыйМассивОбъектов.Добавить(мВыборкаСФНЕПрослеживаемый.СФНЕПрослеживаемый);
			
		КонецЦикла;		
		
	КонецЕсли;
		
	Возврат СтруктураВозврата;	
		
КонецФункции //-- смарт:Демичев #895 14.11.2022((Доработка задачи Холопова по прослеживаемому товару	

#КонецОбласти

