
//++ смарт:ММ 572 04.07.2021 - есть отличия от Cмарт-Т Текстиль
Функция ПолучитьСмартПредопределенноеЗначение(СсылкаНаПредопределенноеЗначение, ВернутьМассив = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПредопределенныеЗначения.Значение КАК Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|ГДЕ
	|	смартПредопределенныеЗначения.Ссылка = &Ссылка
	|	И смартПредопределенныеЗначения.СписокЗначений = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартПредопределенныеЗначенияЗначения.Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &Ссылка
	|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений = ИСТИНА";
	
	УстановитьПривилегированныйРежим(Истина);

	Если ТипЗнч(СсылкаНаПредопределенноеЗначение) = Тип("Строка") Тогда
		Настройка = Справочники.смартПредопределенныеЗначения[СсылкаНаПредопределенноеЗначение];
		Запрос.УстановитьПараметр("Ссылка", Настройка);
	Иначе
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаПредопределенноеЗначение);
	КонецЕсли;
	
	Если ВернутьМассив Тогда
		Результат = Новый Массив;
	Иначе 
		Результат = Неопределено;
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();

	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Массив = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Значение");
	Если ВернутьМассив Тогда
		Результат = Массив;
	ИначеЕсли Массив.Количество() > 0 Тогда
		Результат = Массив[0];
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 04.07.2021

//++ смарт:ММ 572 04.07.2021
Функция ПолучитьИмяФайлаДляБуфераОбмена(ДокСсылка) Экспорт
	
	РезультатВозврат = "";
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		СчетФактура = Документы.СчетФактураВыданный.ПустаяСсылка();//rnp 06.10.2021
		СчетФактура = НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокСсылка);

		Если НЕ ЗначениеЗаполнено(СчетФактура) Тогда
			//Возврат РезультатВозврат; //rnp 06.10.2021  закомментировано
		КонецЕсли;
		
		СчетНаОплатуПокупателю = ДокСсылка.СчетНаОплатуПокупателю;
		
		Если НЕ ЗначениеЗаполнено(СчетНаОплатуПокупателю) Тогда
			//Возврат РезультатВозврат; //rnp 06.10.2021 закомментировано, заказ не может быть пустым
		КонецЕсли;

		ИмяКонтрагента = Лев(СокрЛП(СтрЗаменить(ДокСсылка.Контрагент.Наименование, "ООО", "")), 100);
		
		//++ смарт:ММ 572 06.10.2021 - ругается на длинное наименование
		ИмяКонтрагента = Лев(ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяКонтрагента, ""), 50);
		//-- смарт:ММ 06.10.2021
		//++rnp 06.10.2021
		Если Не ЗначениеЗаполнено(СчетФактура) Тогда
			РезультатВозврат = "СФ " + ДокСсылка.Номер + " " + Формат(ДокСсылка.Дата, "ДЛФ=D") + " (Счет " + СчетНаОплатуПокупателю.Номер + " " + Формат(СчетНаОплатуПокупателю.Дата, "ДЛФ=D") + ") " + ИмяКонтрагента;	
		Иначе//--rnp 06.10.2021
			РезультатВозврат = "СФ " + СчетФактура.Номер + " " + Формат(СчетФактура.Дата, "ДЛФ=D") + " (Счет " + СчетНаОплатуПокупателю.Номер + " " + Формат(СчетНаОплатуПокупателю.Дата, "ДЛФ=D") + ") " + ИмяКонтрагента;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатВозврат;
	
КонецФункции //-- смарт:ММ 04.07.2021

//++ смарт:ММ 572 04.07.2021
// ДокСсылка - РеализацияТоваровУслуг
Функция СформироватьТабличныйДокументУПД(ДокСсылка, ИмяФайла = "") Экспорт
	
	//++ смарт:ММ 572 20.07.2021
	//СчетФактура = НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокСсылка);

	ОбъектыПечатиРеализация = Новый Массив;
	ОбъектыПечатиРеализация.Добавить(ДокСсылка);
	
	НастройкиПечати = УчетНДСВызовСервера.ПолучитьНастройкиПечатиУниверсальныхПередаточныхДокументов(ОбъектыПечатиРеализация);

	СФ = НастройкиПечати.УниверсальныеПередаточныеДокументы;
	Если СФ = Неопределено ИЛИ СФ.Количество() = 0 Тогда
		СчетФактура = Неопределено;
	Иначе
		СчетФактура = СФ[0];
	КонецЕсли;
	//-- смарт:ММ 20.07.2021
	
	Если НЕ ЗначениеЗаполнено(СчетФактура) Тогда
		Возврат Неопределено;
	КонецЕсли;
			
    МассивОбъектов = Новый Массив;
    МассивОбъектов.Добавить(СчетФактура);
    
    //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.12.2021 11:39:35 задача 715
    НомерЗаказа = "";
    // Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокСсылка,"ДоговорКонтрагента") И СтрНайти(ДокСсылка.ДоговорКонтрагента.Номер,"ОПЦБ-")>0 Тогда
    Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокСсылка,"СчетНаОплатуПокупателю") И СтрНайти(ДокСсылка.СчетНаОплатуПокупателю.Номер,"ОПЦБ-")>0 Тогда
        //НомерЗаказа = ДокСсылка.ДоговорКонтрагента.Номер;
        НомерЗаказа = ДокСсылка.СчетНаОплатуПокупателю.Номер;
    КонецЕсли; 
    //Смарт }Подкин Алексей Иванович 01.12.2021 11:39:35
    
    //Смарт {[*](фрагмент ИЗМЕНЕН), Подкин Алексей Иванович 01.12.2021 12:07:15 задача 715
    ИмяФайла = "УПД № " + СчетФактура.Номер + " от " + Формат(СчетФактура.Дата, "ДФ='dd MMM yyyy ""г""'") +?(НомерЗаказа = "",""," (по сч. "+НомерЗаказа+")")+ ".pdf";
    //Смарт }Подкин Алексей Иванович 01.12.2021 12:07:15

	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(СчетФактура, "Документ_1");
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	ПараметрыПечати.Вставить("ИдентификаторВКомплекте", "УниверсальныйПередаточныйДокументКомплект");
	
	//++ смарт:ММ 572 20.07.2021
	//ТабДок = УчетНДС.ПечатьУниверсальныхПередаточныхДокументов981(МассивОбъектов, ОбъектыПечати, 
	//		Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(Истина, Истина, Истина),,, ПараметрыПечати);
			
	ВременнаяКоллекцияДляОднойПечатнойФормы = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(НастройкиПечати.СписокМакетов);
	ПараметрыВывода = Новый Структура;

	Обработки.ПечатьУПД.Печать(МассивОбъектов, ПараметрыПечати, ВременнаяКоллекцияДляОднойПечатнойФормы, 
						ОбъектыПечати, ПараметрыВывода);

	ТабДок = Неопределено;
	
	Если ВременнаяКоллекцияДляОднойПечатнойФормы.Количество() > 0 Тогда
		ТабДок = ВременнаяКоллекцияДляОднойПечатнойФормы[0].ТабличныйДокумент;
	КонецЕсли;
	//-- смарт:ММ 20.07.2021

	//++#1768 смарт: Лопато 10.04.2024 //При формировании УПД на Адмирал в базе БП некорректно удаляются подписи
	УправлениеПечатьюБП.ОчиститьФаксимильнуюПодписьИПечатьИзМакета(ТабДок, ОбъектыПечати, СчетФактура);
	//--#1768 смарт: Лопато 10.04.2024
	
	//++ смарт:ММ 572 14.07.2021
	//смарт:rnp закомментировано - добавлен отдельный контрагент для установки в качестве грузоотправителя
	// Грузоотправитель
	
	//ИмяОбласти = ТабДок.НайтиТекст("Грузоотправитель и его адрес:").Имя;
	//НомерСимвола = СтрНайти(ИмяОбласти, "C");
	//НачалоИмени = Лев(ИмяОбласти, НомерСимвола);
	//НомерКолонки = Прав(ИмяОбласти, СтрДлина(ИмяОбласти) - НомерСимвола);
	//Попытка
	//	НомерКолонкиГрузоотправитель = Число(НомерКолонки) + 1;
	//	ТабДок.Область(НачалоИмени + НомерКолонкиГрузоотправитель).Текст = "ООО ""Смарт-Т"", Московская область, Ленинский район, пос. Горки Ленинские, промзона «Технопарк», ул. Западная, владение 11, строение 1";
	//Исключение
	//КонецПопытки;

	// Убрать подписи
	
	ИмяОбласти = ТабДок.НайтиТекст("Руководитель организации
	|или иное уполномоченное лицо").Имя;
	НомерСимвола = СтрНайти(ИмяОбласти, "C");
	НачалоИмени = Лев(ИмяОбласти, НомерСимвола);
	НомерКолонки = Прав(ИмяОбласти, СтрДлина(ИмяОбласти) - НомерСимвола);
	Попытка
		НомерКолонкиРуководитель = Число(НомерКолонки) + 3;
		НомерКолонкиБухгалтер = Число(НомерКолонки) + 9;
		ТабДок.Область(НачалоИмени + НомерКолонкиРуководитель).Текст = "";
		ТабДок.Область(НачалоИмени + НомерКолонкиБухгалтер).Текст = "";
	Исключение
	КонецПопытки;

	ИмяОбласти = ТабДок.НайтиТекст("[10]").Имя;
	НомерСимвола = СтрНайти(ИмяОбласти, "C");
	НачалоИмени = Лев(ИмяОбласти, НомерСимвола);
	НомерКолонки = Прав(ИмяОбласти, СтрДлина(ИмяОбласти) - НомерСимвола);
	Попытка
		НомерКолонкиДолжность = Число(НомерКолонки) - 7;
		НомерКолонкиФИО = Число(НомерКолонки) - 1;
		ТабДок.Область(НачалоИмени + НомерКолонкиДолжность).Текст = "";
		ТабДок.Область(НачалоИмени + НомерКолонкиФИО).Текст = "";
	Исключение
	КонецПопытки;
	
	ИмяОбласти = ТабДок.НайтиТекст("[13]").Имя;
	НомерСимвола = СтрНайти(ИмяОбласти, "C");
	НачалоИмени = Лев(ИмяОбласти, НомерСимвола);
	НомерКолонки = Прав(ИмяОбласти, СтрДлина(ИмяОбласти) - НомерСимвола);
	Попытка
		НомерКолонкиДолжность = Число(НомерКолонки) - 7;
		НомерКолонкиФИО = Число(НомерКолонки) - 1;
		ТабДок.Область(НачалоИмени + НомерКолонкиДолжность).Текст = "";
		ТабДок.Область(НачалоИмени + НомерКолонкиФИО).Текст = "";
	Исключение
	КонецПопытки;
	//-- смарт:ММ 14.07.2021
	
	//++ смарт:ММ 572 20.07.2021
	// Убрать дату отгрузки, передачи
	
	ИмяОбласти = ТабДок.НайтиТекст("Дата отгрузки, передачи (сдачи)").Имя;
	НомерСимвола = СтрНайти(ИмяОбласти, "C");
	НачалоИмени = Лев(ИмяОбласти, НомерСимвола);
	НомерКолонки = Прав(ИмяОбласти, СтрДлина(ИмяОбласти) - НомерСимвола);
	Попытка
		НомерКолонкиУдалить = Число(НомерКолонки) + 3;
		ТабДок.Область(НачалоИмени + НомерКолонкиУдалить).Текст = "";
	Исключение
	КонецПопытки;			
	//-- смарт:ММ 20.07.2021

	Возврат ТабДок;
			
КонецФункции //-- смарт:ММ 04.07.2021

//++ смарт:ММ 572 04.07.2021
// ДокСсылка - РеализацияТоваровУслуг
Функция СформироватьТабличныйДокументСчет(ДокСсылка, ИмяФайла = "") Экспорт
	
	Счет = ДокСсылка.СчетНаОплатуПокупателю;

	Если НЕ ЗначениеЗаполнено(Счет) Тогда
		Возврат Неопределено;
	КонецЕсли;
    
    //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.12.2021 11:39:35 задача 715
    НомерЗаказа = "";
    
    Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокСсылка,"СчетНаОплатуПокупателю") И СтрНайти(ДокСсылка.СчетНаОплатуПокупателю.Номер,"ОПЦБ-")>0 Тогда
        //НомерЗаказа = ДокСсылка.ДоговорКонтрагента.Номер;
        НомерЗаказа = ДокСсылка.СчетНаОплатуПокупателю.Номер;
    КонецЕсли;
    //Смарт }Подкин Алексей Иванович 01.12.2021 11:39:35
    
    //Смарт {[*](фрагмент ИЗМЕНЕН), Подкин Алексей Иванович 01.12.2021 12:04:39 задача 715
    ИмяФайла = "Счет № " + Счет.Номер + " от " + Формат(Счет.Дата, "ДФ='dd MMM yyyy ""г""'") +?(НомерЗаказа = "",""," (по сч. "+НомерЗаказа+")")+ ".pdf";
    //Смарт }Подкин Алексей Иванович 01.12.2021 12:04:39
    
    МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокСсылка);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(Счет, "Документ_1");
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	ПараметрыПечати.Вставить("ИдентификаторВКомплекте", "УниверсальныйПередаточныйДокументКомплект");
	
	ИмяМенеджераПечати = "Обработка.ПечатьСчетаНаОплату";
	ИменаМакетов = "СчетЗаказ";
	ТипыОбъектовПечати = Неопределено;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	ДополнительныеПараметры.Вставить("ИдентификаторВКомплекте", "СчетЗаказКомплект");
	
	ПечатныеФормы = УправлениеПечатью.СформироватьПечатныеФормы(ИмяМенеджераПечати, ИменаМакетов,
			МассивОбъектов, ДополнительныеПараметры, ТипыОбъектовПечати);
			
	КоллекцияПФ = ПечатныеФормы.КоллекцияПечатныхФорм;
	Если КоллекцияПФ.Количество() > 0 Тогда
		Возврат КоллекцияПФ[0].ТабличныйДокумент;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции //-- смарт:ММ 04.07.2021

//++ смарт:ММ 572 04.07.2021
// ДокСсылка - РеализацияТоваровУслуг
Процедура ДобавитьЗаписьОСформированномПакете(ДокСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяЗапись = РегистрыСведений.смартСформированныеПакетыПФ.СоздатьМенеджерЗаписи();
	НоваяЗапись.Документ = ДокСсылка;
	НоваяЗапись.ПакетСформирован = Истина;
	НоваяЗапись.Записать(Истина);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //-- смарт:ММ 04.07.2021

//++ смарт:ММ 572 04.07.2021
Функция НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокСсылка) Экспорт
	
	Возврат УчетНДСПереопределяемый.НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокСсылка, , , Неопределено);
	
КонецФункции //-- смарт:ММ 04.07.2021

//++ смарт:ММ 572 04.07.2021
Функция ПолучитьРеквизитОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат Ссылка[ИмяРеквизита];
	
КонецФункции //-- смарт:ММ 04.07.2021

//++ смарт:ММ 572 05.07.2021
Функция ПакетПФУжеСформирован(ДокСсылка) Экспорт
	
	ПакетПФУжеСформирован = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартСформированныеПакетыПФ.Документ КАК Документ,
	|	смартСформированныеПакетыПФ.ПакетСформирован КАК ПакетСформирован
	|ИЗ
	|	РегистрСведений.смартСформированныеПакетыПФ КАК смартСформированныеПакетыПФ
	|ГДЕ
	|	смартСформированныеПакетыПФ.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", ДокСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.ПакетСформирован;
	КонецЕсли;
	
	Возврат ПакетПФУжеСформирован;

КонецФункции //-- смарт:ММ 05.07.2021

//++ смарт:ММ 572 05.07.2021
// ДокСсылка - РеализацияТоваровУслуг
Функция СформироватьТабличныйДокументЗаявкаНаМашину(ДокСсылка, ИмяФайла = "", РасширениеФайла = "xlsx", ПроксиWS = Неопределено) Экспорт
	
	РезультатТабДок = Неопределено;
	
	// Подключение к УТ через веб-сервис
	Если ПроксиWS = Неопределено Тогда
		ПроксиWS = ПодключениеК_УТ();	
	КонецЕсли;
	
	Если ПроксиWS = Неопределено Тогда
		Возврат РезультатТабДок;
	КонецЕсли; 

	Макет = ПолучитьОбщийМакет("смартЗаявкаНаМашину");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Номер", ДокСсылка.Номер);
	ПараметрыЗапроса.Вставить("Дата", ДокСсылка.Дата);
	
	Сериализатор = Новый СериализаторXDTO(ПроксиWS.ФабрикаXDTO);
	ПараметрыЗапросаXDTO = Сериализатор.ЗаписатьXDTO(ПараметрыЗапроса);
	
	//++ #1516 смарт: Фролов 20.10.2023 //Формирование адреса в заявке на машину в БП
	ЗапросТекст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ,
	|	ВложенныйЗапрос.Представление КАК АдресСклада
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СкладыКонтактнаяИнформация.Ссылка КАК Ссылка,
	|			СкладыКонтактнаяИнформация.Представление КАК Представление
	|		ИЗ
	|			Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация) КАК ВложенныйЗапрос
	|		ПО РеализацияТоваровУслуг.Склад = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|	И РеализацияТоваровУслуг.Дата = &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Контрагент.Наименование КАК Контрагент,
	|	ЗаказКлиента.Организация.Наименование КАК Организация,
	|	ЗаказКлиента.смартВидТранспорта КАК ВидТранспорта,
	|	ЗаказКлиента.смартНомерМашины КАК НомерМашины,
	|	ЗаказКлиента.смартНомерПрицепа КАК смартНомерПрицепа,
	|	ЗаказКлиента.смартФИОВодителя КАК ФИОВодителя,
	|	ЗаказКлиента.смартНомерСерияПаспортВодителя КАК смартНомерСерияПаспортВодителя,
	|	ЗаказКлиента.смартДатаВыдачиПаспортаВодителя КАК смартДатаВыдачиПаспортаВодителя,
	|	ЗаказКлиента.смартФИОВторогоВодителя КАК смартФИОВторогоВодителя,
	|	ЗаказКлиента.смартНомерСерияПаспортВторогоВодителя КАК смартНомерСерияПаспортВторогоВодителя,
	|	ЗаказКлиента.смартДатаВыдачиПаспортаВторогоВодителя КАК смартДатаВыдачиПаспортаВторогоВодителя,
	//++#1631 смарт: Лопато 14.02.2024 //Формирование пакета документов самовывоз со склада Адмирал  
	//|	ЗаказКлиента.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
	|	ЗаказКлиента.смартЖелаемаяДатаОтгрузкиАдмирал КАК ЖелаемаяДатаОтгрузки,
	//--#1631 смарт: Лопато 14.02.2024
	|	ЗаказКлиента.смартЖелаемоеВремяОтгрузки КАК смартЖелаемоеВремяОтгрузки,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиента.СпособДоставки) КАК СпособДоставки,
	|	ВТ_Заказ.АдресСклада КАК АдресСклада
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказ КАК ВТ_Заказ
	|		ПО ЗаказКлиента.Ссылка = ВТ_Заказ.Заказ
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";	
	
	//"ВЫБРАТЬ
	//|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
	//|ПОМЕСТИТЬ ВТ_Заказ
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//|ГДЕ
	//|	РеализацияТоваровУслуг.Номер = &Номер
	//|	И РеализацияТоваровУслуг.Дата = &Дата
	//|;
	//|
	////++ #1353 смарт: Фролов 18.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	////++ смарт:ММ 572 22.07.2021
	////|////////////////////////////////////////////////////////////////////////////////
	////|ВЫБРАТЬ
	////|	смартПредопределенныеЗначения.Значение КАК Значение
	////|ПОМЕСТИТЬ ВТ_СкладАдмирал
	////|ИЗ
	////|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	////|ГДЕ
	////|	смартПредопределенныеЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.СкладАдмирал)
	////|;
	////-- смарт:ММ 22.07.2021
	////-- #1353 смарт: Фролов 18.05.2023
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗаказКлиента.Номер КАК Номер,
	//|	ЗаказКлиента.Контрагент.Наименование КАК Контрагент,
	//|	ЗаказКлиента.Организация.Наименование КАК Организация,
	//|	ЗаказКлиента.смартВидТранспорта КАК ВидТранспорта,
	//|	ЗаказКлиента.смартНомерМашины КАК НомерМашины,
	//|	ЗаказКлиента.смартНомерПрицепа КАК смартНомерПрицепа,
	//|	ЗаказКлиента.смартФИОВодителя КАК ФИОВодителя,
	//|	ЗаказКлиента.смартНомерСерияПаспортВодителя КАК смартНомерСерияПаспортВодителя,
	//|	ЗаказКлиента.смартДатаВыдачиПаспортаВодителя КАК смартДатаВыдачиПаспортаВодителя, 
	////++ #1228 смарт: Фролов 24.11.2022 //Заказ клиента Раздел Доставка - доработать  
	//|	ЗаказКлиента.смартФИОВторогоВодителя КАК смартФИОВторогоВодителя,
	//|	ЗаказКлиента.смартНомерСерияПаспортВторогоВодителя КАК смартНомерСерияПаспортВторогоВодителя,
	//|	ЗаказКлиента.смартДатаВыдачиПаспортаВторогоВодителя КАК смартДатаВыдачиПаспортаВторогоВодителя, 
	////-- #1228 смарт: Фролов 24.11.2022
	//|	ЗаказКлиента.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
	//|	ЗаказКлиента.смартЖелаемоеВремяОтгрузки КАК смартЖелаемоеВремяОтгрузки,
	//|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиента.СпособДоставки) КАК СпособДоставки
	//|ИЗ
	//|	Документ.ЗаказКлиента КАК ЗаказКлиента
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказ КАК ВТ_Заказ
	//|		ПО (ЗаказКлиента.Ссылка = ВТ_Заказ.Заказ)
	////++ смарт:ММ 572 22.07.2021
	////++ #1353 смарт: Фролов 18.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
	////|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкладАдмирал КАК ВТ_СкладАдмирал
	////|		ПО ИСТИНА 
	////-- #1353 смарт: Фролов 18.05.2023
	//|ГДЕ
	//|	ВЫБОР 
	//|		КОГДА ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)
	//|      		ТОГДА ИСТИНА
	//|       ИНАЧЕ ЛОЖЬ
	//|   КОНЕЦ";
	//-- смарт:ММ 22.07.2021
	//-- #1516 смарт: Фролов 20.10.2023	
	ТаблицаХОПрокси = ПроксиWS.ПолучитьТаблицуРезультатаЗапроса(ЗапросТекст, ПараметрыЗапросаXDTO);	
	ТЗ_УТ1 = Сериализатор.ПрочитатьXDTO(ТаблицаХОПрокси);
		
	ЕстьДанные = Ложь;
	ДатаДокумента = ДокСсылка.Дата;
	
	Для Каждого Выборка Из ТЗ_УТ1 Цикл
		
		// В запросе условие добавить не получается, поэтому тут
		//Если СокрЛП(Выборка.СпособДоставки) <> "Самовывоз со склада Адмирал" Тогда
		//	Прервать;
		//КонецЕсли;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
				
		//++#1631 смарт: Лопато 14.02.2024 //Формирование пакета документов самовывоз со склада Адмирал  
		//ДатаВремя = Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		Если ЗначениеЗаполнено(Выборка.ЖелаемаяДатаОтгрузки) Тогда
			ДатаДокумента = Формат(Выборка.ЖелаемаяДатаОтгрузки, "ДФ=dd.MM.yyyy");
		Иначе
			ДатаДокумента = Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		КонецЕсли;	
		
		ДатаВремя = ДатаДокумента;
		//--#1631 смарт: Лопато 14.02.2024
		смартЖелаемоеВремяОтгрузки = Выборка.смартЖелаемоеВремяОтгрузки;
		
		Если ЗначениеЗаполнено(смартЖелаемоеВремяОтгрузки) Тогда
			ДатаВремя = ДатаВремя + " " + Формат(смартЖелаемоеВремяОтгрузки, "ДФ=HH:mm");	
		КонецЕсли;
				
		ОбластьШапка.Параметры.ДатаВремя 	= ДатаВремя;
		//++#1631 смарт: Лопато 14.02.2024 //Формирование пакета документов самовывоз со склада Адмирал  
		//ОбластьШапка.Параметры.ДатаОтгрузки = Формат(ДокСсылка.Дата, "ДФ=dd.MM.yyyy");
		//ОбластьШапка.Параметры.ДеньНедели 	= ВРег(Сред(формат(Выборка.ЖелаемаяДатаОтгрузки,"ДФ=дддд"),1,1)) + Сред(формат(Выборка.ЖелаемаяДатаОтгрузки,"ДФ=дддд"),2,СтрДлина(формат(Выборка.ЖелаемаяДатаОтгрузки,"ДФ=дддд"))+1);
		ОбластьШапка.Параметры.ДатаОтгрузки = ДатаДокумента;
		ОбластьШапка.Параметры.ДеньНедели 	= ВРег(Сред(формат(ДатаДокумента, "ДФ=дддд"), 1, 1)) 
											  	 + Сред(формат(ДатаДокумента, "ДФ=дддд"), 2, СтрДлина(формат(ДатаДокумента, "ДФ=дддд")) + 1);
		//--#1631 смарт: Лопато 14.02.2024
		//++ #1516 смарт: Фролов 19.10.2023 //Формирование адреса в заявке на машину в БП
		ОбластьШапка.Параметры.АдресСклада = Выборка.АдресСклада;
		//-- #1516 смарт: Фролов 19.10.2023
		ОбластьШапка.Параметры.Контрагент 	= Выборка.Контрагент;
		ОбластьШапка.Параметры.НомерЗаказа 	= Выборка.Номер;
		ОбластьШапка.Параметры.ВидТранспорта = Выборка.ВидТранспорта;
		ОбластьШапка.Параметры.НомерМашины 	= Выборка.НомерМашины;
		ОбластьШапка.Параметры.ФИОВодителя 	= Выборка.ФИОВодителя;
		
		Если ЗначениеЗаполнено(Выборка.смартДатаВыдачиПаспортаВодителя) Тогда
		//++ #1228 смарт: Фролов 24.11.2022 //Заказ клиента Раздел Доставка - доработать  
			ОбластьШапка.Параметры.Паспорт = Выборка.смартНомерСерияПаспортВодителя + " выдан: " + Формат(Выборка.смартДатаВыдачиПаспортаВодителя, "ДФ=dd.MM.yyyy");
		//-- #1228 смарт: Фролов 24.11.2022
		Иначе
			ОбластьШапка.Параметры.Паспорт = Выборка.смартНомерСерияПаспортВодителя;
		КонецЕсли; 
		//++ #1228 смарт: Фролов 24.11.2022 //Заказ клиента Раздел Доставка - доработать
		Если ЗначениеЗаполнено(Выборка.смартФИОВторогоВодителя) Тогда
			ОбластьШапка.Параметры.ФИОВодителя=ОбластьШапка.Параметры.ФИОВодителя+Символы.ПС+Выборка.смартФИОВторогоВодителя;	
		КонецЕсли;	                                                                                                         
		Если ЗначениеЗаполнено(Выборка.смартДатаВыдачиПаспортаВторогоВодителя) ТОгда
			ОбластьШапка.Параметры.Паспорт=ОбластьШапка.Параметры.Паспорт+Символы.ПС+Выборка.смартНомерСерияПаспортВторогоВодителя + " выдан: " + Формат(Выборка.смартДатаВыдачиПаспортаВторогоВодителя, "ДФ=dd.MM.yyyy");		
		Иначе
			ОбластьШапка.Параметры.Паспорт=ОбластьШапка.Параметры.Паспорт+Символы.ПС+Выборка.смартНомерСерияПаспортВторогоВодителя;
		КонецЕсли;	
		//-- #1228 смарт: Фролов 24.11.2022
		ОбластьШапка.Параметры.КолПаллет = 1;
		//ОбластьШапка.Параметры.КолЦелыхПаллет = 1;
		
		ТабДок.Вывести(ОбластьШапка);

		ЕстьДанные = Истина;
	КонецЦикла;	
			
	Если ЕстьДанные Тогда
		ИмяФайла = "Заявка на машину по заказу клиента №" + Выборка.Номер + "." + РасширениеФайла;
		Возврат ТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции //-- смарт:ММ 05.07.2021

//++ смарт:ММ 572 05.07.2021
Функция ПодключениеК_УТ()
	
	//+- смарт:Каратеев 11.10.2022 // Добавить Предопределенные значения и включить проверку 
	//Если смартОбщегоНазначения.смартРабочаяБаза() Тогда
		Адрес = "http://sdb/smart/ws/reports_ut.1cws/?wsdl";
		//Адрес = "http://sdbdev/timofeeva_smart_dev/ws/reports_ut.1cws/?wsdl";
		
		Пользователь = "wshttp";
		Пароль = "%*o7f7&pt#2xy&r4A39k";
		
		// Создание WS-определений
		ОпределениеWS 		= Новый WSОпределения(Адрес, Пользователь, Пароль);
		Сервис 				= ОпределениеWS.Сервисы.Получить(0);
		ИмяСервиса 			= Сервис.Имя;
		ИмяТочкиПодключения = Сервис.ТочкиПодключения.Получить(0).Имя;
		
		// Создание WS-прокси
		ПроксиWS 				= Новый WSПрокси(ОпределениеWS, Сервис.URIПространстваИмен, ИмяСервиса, ИмяТочкиПодключения);
		ПроксиWS.Пользователь 	= Пользователь;
		ПроксиWS.Пароль 		= Пароль;
		
		Возврат ПроксиWS;	
	//+- смарт:Каратеев 11.10.2022 // Добавить Предопределенные значения и включить проверку	
	//Иначе
	//	СообщенияБЗК.СообщитьОПроблеме("Не удалось подключиться к базе УТ. 
	//									|Настройки РабочийСевер и РабочаяБазаБП не установлены или не соответствуют! 
	//									|Проверьте настройкаи в справочнике Предопределенные значения (Смарт)", 
	//									Неопределено, "");
	
	//Каратеев: или использовать ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезОтправки.Сообщение);
	
	//	Возврат Неопределено;
	//КонецЕсли;
	
КонецФункции //-- смарт:ММ 05.07.2021

//++ смарт:ММ 572 06.07.2021
Функция ОтправитьПакетДокументовНаПочту(МассивСтруктурВложений, ДокСсылка) Экспорт
	
	//++ #1353 смарт: Фролов 18.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	//МассивАдресов = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение("АдресДляОтправкиПакетаНаСкладАдмирал", Истина);
	Запрос=Новый Запрос("ВЫБРАТЬ
		|	СкладысмартАдресаДляОтправкиПакетаНаСклад.смартАдресДляОтправкиПакетаНаСклад КАК Адрес
		|ИЗ
		|	Справочник.Склады.смартАдресаДляОтправкиПакетаНаСклад КАК СкладысмартАдресаДляОтправкиПакетаНаСклад
		|ГДЕ
		|	СкладысмартАдресаДляОтправкиПакетаНаСклад.Ссылка = &Склад"); 
	Запрос.УстановитьПараметр("Склад",ДокСсылка.Склад); 
	МассивАдресов=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Адрес");	
	//-- #1353 смарт: Фролов 18.05.2023
	Если МассивАдресов.Количество() > 0 Тогда
		
		АдресаДляОтправкиСтрокой = "";
		МассивАдресовДляОтправки = Новый Массив;
		
		Для Каждого АдресСтрока Из МассивАдресов Цикл
			МассивАдресовДляОтправки.Добавить(Новый Структура("Адрес,Представление", АдресСтрока, АдресСтрока));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + АдресСтрока;
		КонецЦикла;
		
		Вложения = Новый Массив;

		Для Каждого СтруктураВложение Из МассивСтруктурВложений Цикл		
			ДанныеВложения = Новый Структура();
			ДанныеВложения.Вставить("Представление", СтруктураВложение.ИмяФайла);
			ДанныеВложения.Вставить("АдресВоВременномХранилище", СтруктураВложение.АдресХранилища);
			Вложения.Добавить(ДанныеВложения);
		КонецЦикла;
				
		//++ смарт:ММ 572 20.07.2021
		//УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("buh@smart-t.ru");
		//-- смарт:ММ 20.07.2021
		
		ТемаПисьма = "Пакет документов " + ПолучитьИмяФайлаДляБуфераОбмена(ДокСсылка);
		ТекстПисьма = "Во вложении прикреплен " + ТемаПисьма;
		
		ДанныеОтправки = Новый Структура("Тема,Заголовок,Вложения", ТемаПисьма, ТекстПисьма, Вложения);
			
		//++ смарт:ММ 572 20.07.2021
		//ПараметрыПисьма = ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
		ПараметрыПисьма = ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, ,,,,,, Ложь);

		ПараметрыПисьма.Вставить("АдресОтвета", "buh@smart-t.ru");
		//-- смарт:ММ 20.07.2021
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);			
			
			ТекстСообщения = "Пакет документов отправлен на электронную почту " + АдресаДляОтправкиСтрокой;
						
			ЗаписьЖурналаРегистрации("смартОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Исключение
			ТекстСообщения = "Не удалось отправить пакет документов на электронную почту" + Символы.ПС + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("смартОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;

		Для Каждого СтруктураВложение Из МассивСтруктурВложений Цикл
			УдалитьИзВременногоХранилища(СтруктураВложение.АдресХранилища);
		КонецЦикла;
	КонецЕсли;

КонецФункции //-- смарт:ММ 06.07.2021

//++ смарт:ММ 572 06.07.2021
//++ смарт:ММ 572 20.07.2021
//Функция ПолучитьПараметрыОтправки(МассивАдресов, Данные, МассивАдресовКопия = Неопределено, ТестовыеАдресаМассив = Неопределено, ТестовыеАдресаСтрока = "", ЭтоТестоваяБаза = Ложь, Важность = Неопределено, ФорматироватьТекст = Истина) Экспорт
Функция ПолучитьПараметрыОтправки(МассивАдресов, Данные, МассивАдресовКопия = Неопределено, ТестовыеАдресаМассив = Неопределено, ТестовыеАдресаСтрока = "", ЭтоТестоваяБаза = Ложь, Важность = Неопределено, ФорматироватьТекст = Истина, ВыводитьПодписьНеТребуетОтвета = Истина) Экспорт
//-- смарт:ММ 20.07.2021
	ДанныеДляОтправки = Новый Структура;
	
	ДанныеДляОтправки.Вставить("Кому",	 	МассивАдресов);
	ДанныеДляОтправки.Вставить("Тема", 		Данные.Тема);

	Если НЕ ФорматироватьТекст Тогда
		ДанныеДляОтправки.Вставить("Тело", 	Данные.Заголовок);	
	Иначе
		//++ смарт:ММ 572 20.07.2021
		//ДанныеДляОтправки.Вставить("Тело", ПолучитьФорматированныйТекст(Данные));
		ДанныеДляОтправки.Вставить("Тело", ПолучитьФорматированныйТекст(Данные, ВыводитьПодписьНеТребуетОтвета));
		//-- смарт:ММ 20.07.2021
	КонецЕсли;
	
	ДанныеДляОтправки.Вставить("ТипТекста",	ТипТекстаПочтовогоСообщения.HTML);
	 
	Если НЕ ЗначениеЗаполнено(Важность) Тогда
		ВажностьСообщения = ВажностьИнтернетПочтовогоСообщения.Обычная;
	Иначе
		ВажностьСообщения = Важность;
	КонецЕсли;
	
	ДанныеДляОтправки.Вставить("Важность", ВажностьСообщения);
	
	Если МассивАдресовКопия <> Неопределено 
		И НЕ ЭтоТестоваяБаза Тогда
		ДанныеДляОтправки.Вставить("Копии", МассивАдресовКопия);
	КонецЕсли;
			
	ДанныеДляОтправки.Вставить("ТестовыеАдреса", "");
	ДанныеДляОтправки.Вставить("ТестоваяБаза", ЭтоТестоваяБаза);
	
	Если ЗначениеЗаполнено(ТестовыеАдресаМассив) 
		И ТестовыеАдресаМассив.Количество() > 0 Тогда
		
		ДанныеДляОтправки.Вставить("ТестовыеАдреса", ТестовыеАдресаСтрока);
		ДанныеДляОтправки.Вставить("Кому", ТестовыеАдресаМассив);	
	КонецЕсли;
	
	Если Данные.Свойство("Вложения") Тогда
		ДанныеДляОтправки.Вставить("Вложения", Данные.Вложения);
	КонецЕсли;
	
	Возврат ДанныеДляОтправки;
	
КонецФункции //-- смарт:ММ 06.07.2021

//++ смарт:ММ 572 06.07.2021
Функция ПолучитьФорматированныйТекст(ДанныеОтправки, ВыводитьПодписьНеТребуетОтвета = Истина)
	
	Док = Новый ФорматированныйДокумент;
	
	мЗаголовок = Док.Добавить("Уведомление.", ТипЭлементаФорматированногоДокумента.Текст);
	мЗаголовок.Шрифт = Новый Шрифт("Arial", 16, Истина);
	
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	
	КоличествоЭлементов = Док.Элементы[0].Элементы.Количество();
	
	Абзац = Док.Добавить(ДанныеОтправки.Заголовок, ТипЭлементаФорматированногоДокумента.Текст);
	
	Для Сч = КоличествоЭлементов + 1 По Док.Элементы[0].Элементы.Количество() Цикл 
		Если ТипЗнч(Док.Элементы[0].Элементы[Сч-1]) = Тип("ТекстФорматированногоДокумента") Тогда 
			Док.Элементы[0].Элементы[Сч-1].Шрифт = Новый Шрифт("Arial", 12);
		КонецЕсли;
	КонецЦикла;
	
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
		
	//++ смарт:ММ 572 20.07.2021
	Если ВыводитьПодписьНеТребуетОтвета Тогда
	//-- смарт:ММ 20.07.2021
	
	Подпись = Док.Добавить("Письмо создано роботом и не требует ответа.", ТипЭлементаФорматированногоДокумента.Текст);
	
	Подпись.Шрифт = Новый Шрифт("Arial", 8);
	
	//++ смарт:ММ 572 20.07.2021
	КонецЕсли;
	//-- смарт:ММ 20.07.2021

	Возврат Док;
	
КонецФункции //-- смарт:ММ 06.07.2021

//++ смарт:ММ 572 07.07.2021
// ДокСсылка - РеализацияТоваровУслуг
Функция СформироватьТабличныйДокументЗаявкаНаОтгрузку(ДокСсылка, ИмяФайла = "", РасширениеФайла = "xlsx", ПроксиWS = Неопределено) Экспорт
	
	РезультатТабДок = Новый ТабличныйДокумент;
		
	// Подключение к УТ через веб-сервис
	Если ПроксиWS = Неопределено Тогда
		ПроксиWS = ПодключениеК_УТ();	
	КонецЕсли;
	
	Если ПроксиWS = Неопределено Тогда
		Возврат РезультатТабДок;
	КонецЕсли;
	
	Макет = ПолучитьОбщийМакет("смартЗаявкаНаОтгрузку");
		
	НазваниеДокумента = НСтр("ru = 'Заявка на отгрузку'");
	
	ОбластьЗаголовка = Макет.ПолучитьОбласть("ЗаголовокПеремещение");	
	ОбластьЗаголовка.Параметры.ТекстЗаголовка = НазваниеДокумента; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Организации.НаименованиеСокращенное <> """"
	|			ТОГДА Организации.НаименованиеСокращенное
	|		ИНАЧЕ Организации.Наименование
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслуг.Склад) КАК Склад,
	|	Контрагенты.Наименование КАК Контрагент,
	|	РеализацияТоваровУслуг.Грузоотправитель КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Грузополучатель КАК Грузополучатель
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО РеализацияТоваровУслуг.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО РеализацияТоваровУслуг.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();

	ВыборкаШапка.Следующий();
	
	ОрганизацияНаименование = ВыборкаШапка.ОрганизацияНаименование;
	СкладОтправитель = ВыборкаШапка.Склад;
	СкладПолучатель = ВыборкаШапка.Контрагент;
	
	ОбластьЗаголовка.Параметры.ОрганизацияПредставление = СокрЛП(ОрганизацияНаименование);
	ОбластьЗаголовка.Параметры.ОтправительПредставление = СокрЛП(СкладОтправитель);
	ОбластьЗаголовка.Параметры.ПолучательПредставление = СокрЛП(СкладПолучатель);
	
	РезультатТабДок.Вывести(ОбластьЗаголовка);

	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Номер", ДокСсылка.Номер);
	ПараметрыЗапроса.Вставить("Дата", ДокСсылка.Дата); 
	//++ #1353 смарт: Фролов 25.10.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
	ПараметрыЗапроса.Вставить("СкладОтправитель", СкладОтправитель);
	//-- #1353 смарт: Фролов 25.10.2023
	
	//++ смарт:ММ 606 14.09.2021
	//++ смарт:ММ 663 02.10.2021 
	//ПараметрыЗапроса.Вставить("Период", ТекущаяДата());
	//-- смарт:ММ 02.10.2021
	//// ОТЛАДКА
	//ПараметрыЗапроса.Вставить("Период", Дата("20210810235959"));
	
	//-- смарт:ММ 14.09.2021
	
	Сериализатор = Новый СериализаторXDTO(ПроксиWS.ФабрикаXDTO);
	ПараметрыЗапросаXDTO = Сериализатор.ЗаписатьXDTO(ПараметрыЗапроса);
	
	ЗапросТекст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|	И РеализацияТоваровУслуг.Дата = &Дата
	|;
	//++ #1353 смарт: Фролов 18.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	// ++ 10.08.2021
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	смартПредопределенныеЗначения.Значение КАК Значение
	//|ПОМЕСТИТЬ ВТ_СкладАдмирал
	//|ИЗ
	//|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	//|ГДЕ
	//|	смартПредопределенныеЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.СкладАдмирал)
	//|;
	//// -- 
	//-- #1353 смарт: Фролов 18.05.2023
	|
	|////////////////////////////////////////////////////////////////////////////////
	//++ смарт:ММ 634 14.09.2021
	//|ВЫБРАТЬ
	//|	ЗаказКлиента.Номер КАК Номер,
	//|	ЗаказКлиента.Дата КАК Дата,
	//|	ЗаказКлиента.Контрагент.Наименование КАК Контрагент,
	//|	ЗаказКлиента.Организация.Наименование КАК Организация,
	//|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиента.СпособДоставки) КАК СпособДоставки,
	//|   НоменклатураСпр.Наименование КАК Наименование,
	//|   НоменклатураСпр.Артикул КАК Артикул,
	//|   ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаТовары.Серия) КАК Серия,
	//|   ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	//|   ПРЕДСТАВЛЕНИЕ(НоменклатураСпр.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
	//|ИЗ
	//|	Документ.ЗаказКлиента КАК ЗаказКлиента
	//|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	//|      	 	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	//|      	 	ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураСпр.Ссылка
	//|      	ПО ЗаказКлиента.Ссылка = ЗаказКлиентаТовары.Ссылка
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказ КАК ВТ_Заказ
	//|		ПО (ЗаказКлиента.Ссылка = ВТ_Заказ.Заказ)
	////++ смарт:ММ 572 22.07.2021
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкладАдмирал КАК ВТ_СкладАдмирал
	//|		ПО ИСТИНА
	////-- смарт:ММ 22.07.2021
	//|ГДЕ
	//| 	ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	////++ смарт:ММ 572 22.07.2021
	////| 	И ВЫБОР
	////|   	КОГДА ЗаказКлиентаТовары.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	////|   		ТОГДА ЗаказКлиентаТовары.Склад.Наименование
	////|   	ИНАЧЕ ЗаказКлиента.Склад.Наименование
	////|   КОНЕЦ = ""Адмирал""
	//|	И ВЫБОР 
	//|		КОГДА ЗаказКлиента.Склад = ВТ_СкладАдмирал.Значение
	//|			И ЗаказКлиента.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	//|      		ТОГДА ИСТИНА
	//|		КОГДА ЗаказКлиентаТовары.Склад = ВТ_СкладАдмирал.Значение
	//|      		ТОГДА ИСТИНА
	//|       ИНАЧЕ ЛОЖЬ
	//|   КОНЕЦ
	//// ++ 10.08.2021 - для Заявки на отгурзку проверка на способ доставки не нужна
	////|	И ВЫБОР 
	////|		КОГДА ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)
	////|      		ТОГДА ИСТИНА
	////|       ИНАЧЕ ЛОЖЬ
	////|   КОНЕЦ";
	//|";
	//// --
	////-- смарт:ММ 22.07.2021
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказКлиента).Номер КАК Номер, 
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказКлиента).Дата КАК Дата,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказКлиента).Контрагент.Наименование КАК Контрагент,
	|	ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказКлиента).Организация.Наименование КАК Организация,
	//|	ПРЕДСТАВЛЕНИЕ(ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказКлиента).СпособДоставки) КАК СпособДоставки,
	|	ТоварыКОтгрузкеОстатки.Номенклатура.Наименование КАК Наименование,
	|	ТоварыКОтгрузкеОстатки.Номенклатура.Артикул КАК Артикул,
	//++ смарт:ММ 706 09.11.2021
	|	ТоварыКОтгрузкеОстатки.Номенклатура.Код КАК Код,
	//-- смарт:ММ 09.11.2021
	|	ПРЕДСТАВЛЕНИЕ(ТоварыКОтгрузкеОстатки.Серия) КАК Серия,
	|	ПРЕДСТАВЛЕНИЕ(ТоварыКОтгрузкеОстатки.Характеристика) КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КоличествоУпаковок,
	|	ПРЕДСТАВЛЕНИЕ(ТоварыКОтгрузкеОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
	|ИЗ
	//++ смарт:ММ 663 02.10.2021 
	//|	РегистрНакопления.ТоварыКОтгрузке.Остатки(&Период, Склад В (ВЫБРАТЬ ВТ.Значение ИЗ ВТ_СкладАдмирал КАК ВТ) И ДокументОтгрузки В (ВЫБРАТЬ ВТ.Заказ ИЗ ВТ_Заказ КАК ВТ)) КАК ТоварыКОтгрузкеОстатки";
	//++ #1353 смарт: Фролов 18.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)
	//|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад В (ВЫБРАТЬ ВТ.Значение ИЗ ВТ_СкладАдмирал КАК ВТ) И ДокументОтгрузки В (ВЫБРАТЬ ВТ.Заказ ИЗ ВТ_Заказ КАК ВТ)) КАК ТоварыКОтгрузкеОстатки";
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад.смартАвтоматическиФормироватьДокументы И Склад.Наименование ПОДОБНО &СкладОтправитель И ДокументОтгрузки В (ВЫБРАТЬ ВТ.Заказ ИЗ ВТ_Заказ КАК ВТ)) КАК ТоварыКОтгрузкеОстатки";
	//-- #1353 смарт: Фролов 18.05.2023
	//-- смарт:ММ 02.10.2021
	//-- смарт:ММ 14.09.2021

	//++ #2552 смарт: Тимофеева 20.10.2025 / Сделать обязательную комплектацию оборудования каталогом
	ЗапросТекст = ЗапросТекст + "
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаСсылка.Номер,
	|	ЗаказКлиентаСсылка.Дата,
	|	ЗаказКлиентаСсылка.Контрагент.Наименование,
	|	ЗаказКлиентаСсылка.Организация.Наименование,
	|	Каталог.Наименование,
	|	Каталог.Артикул,
	|	Каталог.Код,
	|	"""",
	|	"""",
	|	УсловияНаСвязанныеДокументы.Количество,
	|	ПРЕДСТАВЛЕНИЕ(Каталог.ЕдиницаИзмерения)
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаСсылка
	|	ПО ВТ_Заказ.Заказ = ЗаказКлиентаСсылка.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента
	|		ИЗ
	|		Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|	ГДЕ
	|		ЗаказКлиентаТовары.Ссылка В
	|					(ВЫБРАТЬ
	|			ВТ.Заказ
	|				ИЗ
	|					ВТ_Заказ КАК ВТ)
	|		И ЗаказКлиентаТовары.Номенклатура В
	|				(ВЫБРАТЬ
	|					Сегменты.Номенклатура КАК Номенклатура
	|				ИЗ
	|					РегистрСведений.НоменклатураСегмента КАК Сегменты
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|						ПО
	|							смартПредопределенныеЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.СегментОборудованияДляКомплектации)
	|								И Сегменты.Сегмент = смартПредопределенныеЗначения.Значение)) КАК УсловияНаОборудование
	|	ПО ВТ_Заказ.Заказ = УсловияНаОборудование.ЗаказКлиента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		ВТ.Значение КАК Ссылка,
	|		СпрНоменклатура.Наименование КАК Наименование,
	|		СпрНоменклатура.Код КАК Код,
	|		СпрНоменклатура.Артикул КАК Артикул,
	|		СпрНоменклатура.Описание КАК Описание,
	|		СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|	ИЗ
	|		Справочник.смартПредопределенныеЗначения КАК ВТ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО ВТ.Значение = СпрНоменклатура.Ссылка
	|	ГДЕ
	|		ВТ.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.КаталогДляКомплектации)) КАК Каталог
	|	ПО (ИСТИНА)
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		ЗаказыНаВнутреннееПотреблениеОстатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|		ЗаказыНаВнутреннееПотреблениеОстатки.ЗаказНаВнутреннееПотребление.ДокументОснование КАК ЗаказКлиента,
	|		ЗаказыНаВнутреннееПотреблениеОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюПриход КАК Количество
	|	ИЗ
	|		РегистрНакопления.ЗаказыНаВнутреннееПотребление.ОстаткиИОбороты(
	|				,
	|				,
	|				,
	|				,
	//++ #5970  смарт: Тимофеева 23.04.2026 / Списание каталогов. Формирование пакета документов при отгрузке со складов ответственного хранения.               
	|               Склад.Наименование ПОДОБНО &СкладОтправитель И 
	//-- #5970  смарт: Тимофеева 23.04.2026
	|				ЗаказНаВнутреннееПотребление.ДокументОснование В
	|					(ВЫБРАТЬ
	|						ВТ.Заказ
	|					ИЗ
	|						ВТ_Заказ КАК ВТ)) КАК ЗаказыНаВнутреннееПотреблениеОстатки
	|	ГДЕ
	|		ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюПриход > 0
	|		И ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюОборот = 0) КАК УсловияНаСвязанныеДокументы
	|	ПО ВТ_Заказ.Заказ = УсловияНаСвязанныеДокументы.ЗаказКлиента
	|		И (УсловияНаСвязанныеДокументы.Номенклатура = Каталог.Ссылка)
	|";
	//-- #2552 смарт: Тимофеева 20.10.2025
	
	ТаблицаХОПрокси = ПроксиWS.ПолучитьТаблицуРезультатаЗапроса(ЗапросТекст, ПараметрыЗапросаXDTO);	
	ТЗ_УТ = Сериализатор.ПрочитатьXDTO(ТаблицаХОПрокси);
		
	ЕстьДанные = Ложь;
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	РезультатТабДок.Вывести(ОбластьШапкаТаблицы);
	
	НомерЗаказа = "";
	ДатаЗаказа = "";
	НомерСтроки = 0;
    
    //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 30.11.2021 18:10:30
    ИтогУпаковок=0;
    //Смарт }Подкин Алексей Иванович 30.11.2021 18:10:30

	Для Каждого ВыборкаТЧ Из ТЗ_УТ Цикл
								
		НомерЗаказа = ВыборкаТЧ.Номер;
		ДатаЗаказа = ВыборкаТЧ.Дата;
		
		Серия = ВыборкаТЧ.Серия;
		Если ЗначениеЗаполнено(Серия) Тогда
			Если Найти(Серия, "до") > 0 Тогда
				Серия = Сред(Серия, 1, Найти(Серия, "до") - 1);
			КонецЕсли;	
		КонецЕсли;
		//++rnp 19.08.2021 для рулонных материалов надо выводить намотку
		Если ЗначениеЗаполнено(ВыборкаТЧ.Характеристика) Тогда
			Серия =  Строка(Серия) + " " + Строка(ВыборкаТЧ.Характеристика)
		КонецЕсли;
		//--rnp 19.08.2021
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрока.Параметры.Товар 		= ВыборкаТЧ.Наименование;
		//++ смарт:ММ 706 09.11.2021
		ОбластьСтрока.Параметры.Код 		= ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(ВыборкаТЧ.Код, Истина, Истина);
		//-- смарт:ММ 09.11.2021
		//++ смарт:ММ 709 10.11.2021 
		//ОбластьСтрока.Параметры.Артикул 	= ВыборкаТЧ.Артикул;
		Артикул = СтрЗаменить(ВыборкаТЧ.Артикул, " ", "");
		ОбластьСтрока.Параметры.Артикул 	= Артикул;
        //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 30.11.2021 11:48:32
        ОбластьСтрока.Параметры.АртикулEN 	= СтроковыеФункции.СтрокаЛатиницей(Артикул);
        //Смарт }Подкин Алексей Иванович 30.11.2021 11:48:32
		//-- смарт:ММ 10.11.2021
		ОбластьСтрока.Параметры.Серия 		= Серия;
		
		ОбластьСтрока.Параметры.КоличествоУпаковок = ВыборкаТЧ.КоличествоУпаковок;
        //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 30.11.2021 18:10:43
        ИтогУпаковок=ИтогУпаковок+ВыборкаТЧ.КоличествоУпаковок;
        //Смарт }Подкин Алексей Иванович 30.11.2021 18:10:43
		ОбластьСтрока.Параметры.ПредставлениеЕдининицыИзмеренияУпаковки = ВыборкаТЧ.ЕдиницаИзмерения;
		
		ОбластьСтрока.Параметры.ПредставлениеБазовойЕдиницыИзмерения = "паллет";
		
		РезультатТабДок.Вывести(ОбластьСтрока);

		ЕстьДанные = Истина;

	КонецЦикла;
	ИмяФайла = "Заявка на отгрузку по заказу клиента №" + НомерЗаказа + "." + РасширениеФайла;

	ПредставлениеЗаказаКлиента = "Заказ клиента " + НомерЗаказа + " от " + ДатаЗаказа;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
    //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 30.11.2021 18:11:36
    Если ИтогУпаковок>0 Тогда
        ОбластьПодвал.Параметры.ИтогУпаковок 		= ИтогУпаковок;
    КонецЕсли; 
    //Смарт }Подкин Алексей Иванович 30.11.2021 18:11:36
	РезультатТабДок.Вывести(ОбластьПодвал);

	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	ОбластьПодписи.Параметры.ФИОМенеджер = "Нечипоренко В.В.";
	РезультатТабДок.Вывести(ОбластьПодписи);
	
	ОбластьКомментарий = Макет.ПолучитьОбласть("Комментарий");
	ОбластьКомментарий.Параметры.Документы = ПредставлениеЗаказаКлиента;
	РезультатТабДок.Вывести(ОбластьКомментарий);
	
	РезультатТабДок.ОтображатьСетку = Ложь;
	РезультатТабДок.АвтоМасштаб = Истина;
	
	Если ЕстьДанные Тогда		
		Возврат РезультатТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции //-- смарт:ММ 07.07.2021

#Область РаботасАтлантом

Функция НомерДокумента(Заказ)
	
	СчетаФактуры = УчетНДСПереопределяемый.НайтиПодчиненныеСчетаФактурыВыданныеНаРеализацию(Заказ);
	Если ЗначениеЗаполнено(СчетаФактуры[Заказ]) Тогда
		Номер = СчетаФактуры[Заказ].Номер;
	Иначе
		Номер = Заказ.Номер;
	КонецЕсли;
	
	Номер = СтрШаблон("%1_%2", Номер, "РЕАЛ");
	Возврат Номер;
	
КонецФункции

//++ #Б3572 смарт: Шляпников 17.06.2025 / Интеграция с WMS. Атлант. Отгрузка. Разработка
Функция СформироватьТабличныйДокументЗаявкаНаОтгрузкуАтлант(ДокСсылка, ИмяФайла = "", РасширениеФайла = "xls", ПроксиWS = Неопределено) Экспорт
	
	РезультатТабДок = Новый ТабличныйДокумент;
		
	// Подключение к УТ через веб-сервис
	Если ПроксиWS = Неопределено Тогда
		ПроксиWS = ПодключениеК_УТ();	
	КонецЕсли;
	
	Если ПроксиWS = Неопределено Тогда
		Возврат РезультатТабДок;
	КонецЕсли;
	
	Макет = ПолучитьОбщийМакет("смартЗаявкаНаОтгрузкуАтлант");
		
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Номер", ДокСсылка.Номер);
	ПараметрыЗапроса.Вставить("Дата", ДокСсылка.Дата); 
	ПараметрыЗапроса.Вставить("ВидНоменклатурыНаименование", "ТоварРулоныХарактеристики");
	
	Сериализатор = Новый СериализаторXDTO(ПроксиWS.ФабрикаXDTO);
	ПараметрыЗапросаXDTO = Сериализатор.ЗаписатьXDTO(ПараметрыЗапроса);
	
	ЗапросТекст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|	И РеализацияТоваровУслуг.Дата = &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	НоменклатураСпр.НаименованиеПолное КАК НоменклатураНаименование,
	|	НоменклатураСпр.Код КАК НоменклатураКод,
	|	НоменклатураСпр.Артикул КАК НоменклатураАртикул,
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Серия КАК Серия,
	|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КоличествоУпаковок,
	|	НоменклатураСпр.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	НоменклатураСпр.Описание КАК НоменклатураОписание,
	|	НоменклатураСпр.ВидНоменклатуры.Наименование КАК ВидНоменклатурыНаименование
	|ПОМЕСТИТЬ ВТ_ЗаказКлиентаОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	|	,Склад.смартАвтоматическиФормироватьДокументы
	|			И ДокументОтгрузки В
	|				(ВЫБРАТЬ
	|					ВТ.Заказ
	|				ИЗ
	|					ВТ_Заказ КАК ВТ)) КАК ТоварыКОтгрузкеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО ТоварыКОтгрузкеОстатки.Номенклатура = НоменклатураСпр.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаСсылка.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Контрагент) КАК Контрагент,
	|	ЗаказКлиентаСсылка.смартНомерМашины + "" "" + ЗаказКлиентаСсылка.смартВидТранспорта КАК ТранспортноеСредство,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Организация) КАК Перевозчик,
	|	ЗаказКлиентаСсылка.смартВидТранспорта КАК Марка,
	|	ЗаказКлиентаСсылка.смартНомерМашины КАК НомерМашины,
	|	ЗаказКлиентаСсылка.смартНомерПрицепа КАК смартНомерПрицепа,
	|	ЗаказКлиентаСсылка.смартФИОВодителя КАК ФИОВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВодителя КАК смартНомерСерияПаспортВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВодителя КАК смартДатаВыдачиПаспортаВодителя,
	|	ЗаказКлиентаСсылка.смартФИОВторогоВодителя КАК смартФИОВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВторогоВодителя КАК смартНомерСерияПаспортВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВторогоВодителя КАК смартДатаВыдачиПаспортаВторогоВодителя, 
	|	ЗаказКлиентаСсылка.смартЖелаемаяДатаОтгрузкиАдмирал КАК ЖелаемаяДатаОтгрузки,
	|	ЗаказКлиентаСсылка.смартЖелаемоеВремяОтгрузки КАК смартЖелаемоеВремяОтгрузки,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураАртикул КАК НоменклатураАртикул,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураКод КАК НоменклатураКод,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Ссылка) КАК ЗаказКлиента,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураОписание КАК НоменклатураОписание,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.Серия) КАК Серия,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.Серия.Номер) КАК СерияНомер,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.Характеристика) КАК Характеристика,
	|	ВТ_ЗаказКлиентаОстатки.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.НоменклатураЕдиницаИзмерения) КАК НоменклатураЕдиницаИзмерения,
	|	ЗаказКлиентаСсылка.АдресДоставки КАК АдресДоставки,
	|	ВЫБОР КОГДА ВТ_ЗаказКлиентаОстатки.ВидНоменклатурыНаименование = &ВидНоменклатурыНаименование ТОГДА Истина Иначе Ложь КОНЕЦ КАК ЭтоНоменклатураВПогонныхМетрах
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаСсылка
	|		ПО ВТ_Заказ.Заказ = ЗаказКлиентаСсылка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказКлиентаОстатки КАК ВТ_ЗаказКлиентаОстатки
	|		ПО ВТ_Заказ.Заказ = ВТ_ЗаказКлиентаОстатки.ДокументОтгрузки
	|ГДЕ
	|	ЗаказКлиентаСсылка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)";
	
	//++ #2552 смарт: Тимофеева 20.10.2025 / Сделать обязательную комплектацию оборудования каталогом
	ЗапросТекст = ЗапросТекст + "
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаСсылка.Номер,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Контрагент),
	|	ЗаказКлиентаСсылка.смартНомерМашины + "" "" + ЗаказКлиентаСсылка.смартВидТранспорта,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Организация),
	|	ЗаказКлиентаСсылка.смартВидТранспорта,
	|	ЗаказКлиентаСсылка.смартНомерМашины,
	|	ЗаказКлиентаСсылка.смартНомерПрицепа,
	|	ЗаказКлиентаСсылка.смартФИОВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВодителя,
	|	ЗаказКлиентаСсылка.смартФИОВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартЖелаемаяДатаОтгрузкиАдмирал,
	|	ЗаказКлиентаСсылка.смартЖелаемоеВремяОтгрузки,
	|	Каталог.Наименование,
	|	Каталог.Артикул,
	|	Каталог.Код,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Ссылка),
	|	Каталог.Описание,
	|	"""",
	|	"""",
	|	"""",
	|	УсловияНаСвязанныеДокументы.Количество,
	|	ПРЕДСТАВЛЕНИЕ(Каталог.ЕдиницаИзмерения),
	|	ЗаказКлиентаСсылка.АдресДоставки,
	|	ЛОЖЬ
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаСсылка
	|		ПО ВТ_Заказ.Заказ = ЗаказКлиентаСсылка.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента
	|	ИЗ
	|		Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|	ГДЕ
	|		ЗаказКлиентаТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ.Заказ
	|				ИЗ
	|					ВТ_Заказ КАК ВТ)
	|		И ЗаказКлиентаТовары.Номенклатура В
	|				(ВЫБРАТЬ
	|					Сегменты.Номенклатура КАК Номенклатура
	|				ИЗ
	|					РегистрСведений.НоменклатураСегмента КАК Сегменты
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|						ПО
	|							смартПредопределенныеЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.СегментОборудованияДляКомплектации)
	|								И Сегменты.Сегмент = смартПредопределенныеЗначения.Значение)) КАК УсловияНаОборудование
	|	ПО ВТ_Заказ.Заказ = УсловияНаОборудование.ЗаказКлиента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		ВТ.Значение КАК Ссылка,
	|		СпрНоменклатура.Наименование,
	|		СпрНоменклатура.Код,
	|		СпрНоменклатура.Артикул,
	|		СпрНоменклатура.Описание,
	|		СпрНоменклатура.ЕдиницаИзмерения
	|	ИЗ
	|		Справочник.смартПредопределенныеЗначения КАК ВТ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО ВТ.Значение = СпрНоменклатура.Ссылка
	|	ГДЕ
	|		ВТ.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.КаталогДляКомплектации)
	|		) КАК Каталог
	|		ПО ИСТИНА
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		ЗаказыНаВнутреннееПотреблениеОстатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|		ЗаказыНаВнутреннееПотреблениеОстатки.ЗаказНаВнутреннееПотребление.ДокументОснование КАК ЗаказКлиента,
	|		ЗаказыНаВнутреннееПотреблениеОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюПриход КАК Количество
	|	ИЗ
	|		РегистрНакопления.ЗаказыНаВнутреннееПотребление.ОстаткиИОбороты(
	|				,
	|				,
	|				,
	|				,
	//++ #5970  смарт: Тимофеева 23.04.2026 / Списание каталогов. Формирование пакета документов при отгрузке со складов ответственного хранения.               
	|               Склад.смартНастройкаОбменомСАтлант <> ЗНАЧЕНИЕ(ПланОбмена.смартОбменСоСкладомАтлант.ПустаяСсылка) И 
	//-- #5970  смарт: Тимофеева 23.04.2026
	|				ЗаказНаВнутреннееПотребление.ДокументОснование В
	|					(ВЫБРАТЬ
	|						ВТ.Заказ
	|					ИЗ
	|						ВТ_Заказ КАК ВТ)) КАК ЗаказыНаВнутреннееПотреблениеОстатки
	|	ГДЕ
	|		ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюПриход > 0
	|		И ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюОборот = 0) КАК УсловияНаСвязанныеДокументы
	|	ПО ВТ_Заказ.Заказ = УсловияНаСвязанныеДокументы.ЗаказКлиента
	|		И (УсловияНаСвязанныеДокументы.Номенклатура = Каталог.Ссылка)
	|ГДЕ
	|	ЗаказКлиентаСсылка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)
	|";
	//-- #2552 смарт: Тимофеева 20.10.2025

	ТаблицаХОПрокси = ПроксиWS.ПолучитьТаблицуРезультатаЗапроса(ЗапросТекст, ПараметрыЗапросаXDTO);	
	ТЗ_УТ = Сериализатор.ПрочитатьXDTO(ТаблицаХОПрокси);
		
	ЕстьДанные = Ложь;
	
	НомерЗаказа = "";
	ДатаЗаказа = "";
	НомерСтроки = 0;
    
    ИтогУпаковок=0;

	Для Каждого ВыборкаТЧ Из ТЗ_УТ Цикл
		
		Если НЕ ЕстьДанные Тогда
			
			НомерЗаказа = СокрЛП(ВыборкаТЧ.Номер);
			
			Область = Макет.ПолучитьОбласть("Шапка");
			Область.Параметры.Номер = НомерЗаказа;
			Область.Параметры.Дата = Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
			Область.Параметры.Менеджер = "Нечипоренко Владимир Валерьевич";
			Область.Параметры.Получатель = СтрШаблон("ООО ""Смарт-Т"" / %1", "Нечипоренко Владимир Валерьевич");
			Область.Параметры.ДатаДоставки = ВыборкаТЧ.ЖелаемаяДатаОтгрузки + (ВыборкаТЧ.смартЖелаемоеВремяОтгрузки - Дата(1,1,1));
			Область.Параметры.Автомобиль = СокрЛП(СтрШаблон("%1 %2/%3", ВыборкаТЧ.Марка, ВыборкаТЧ.НомерМашины, ВыборкаТЧ.смартНомерПрицепа));
			Область.Параметры.Водитель = ВыборкаТЧ.ФИОВодителя;
			Область.Параметры.КоличествоСтрок = ТЗ_УТ.Количество();
			РезультатТабДок.Вывести(Область);
			
		КонецЕсли;
		
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Код = ВыборкаТЧ.НоменклатураКод;
		Область.Параметры.НоменклатураНаименованиеПолное = ВыборкаТЧ.НоменклатураНаименование;
		Если ЗначениеЗаполнено(ВыборкаТЧ.СерияНомер) Тогда
			Область.Параметры.Серия = ВыборкаТЧ.СерияНомер;
		Иначе
			Область.Параметры.Серия = ВыборкаТЧ.Серия;
		КонецЕсли;
		Область.Параметры.Количество = ВыборкаТЧ.КоличествоУпаковок;
		
		Если ЗначениеЗаполнено(ВыборкаТЧ.Характеристика) Тогда
			Область.Параметры.НоменклатураНаименованиеПолное = СтрШаблон("%1 (%2)", ВыборкаТЧ.Наименование, ВыборкаТЧ.Характеристика);
		КонецЕсли;
		
		РезультатТабДок.Вывести(Область);
		
		ЕстьДанные = Истина;

	КонецЦикла;
	
	ИмяФайла = СтрШаблон("SO_Уведомление об отгрузке %1 от %2 (по сч. %3).%4", НомерДокумента(ДокСсылка), Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy"), НомерЗаказа, РасширениеФайла);

	РезультатТабДок.ОтображатьСетку = Ложь;
	РезультатТабДок.АвтоМасштаб = Истина;
	
	Если ЕстьДанные Тогда		
		Возврат РезультатТабДок;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции //-- смарт:ММ 07.07.2021

//++ #Б3572 смарт: Шляпников 17.06.2025 / Интеграция с WMS. Атлант. Отгрузка. Разработка
Функция СформироватьXMLПоЗаявкаНаОтгрузкуАтлант(ДокСсылка, ИмяФайла, ПроксиWS)
	
	// Подключение к УТ через веб-сервис
	Если ПроксиWS = Неопределено Тогда
		ПроксиWS = ПодключениеК_УТ();	
	КонецЕсли;
	
	Если ПроксиWS = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Номер", ДокСсылка.Номер);
	ПараметрыЗапроса.Вставить("Дата", ДокСсылка.Дата);
	ПараметрыЗапроса.Вставить("ВидНоменклатурыНаименование", "ТоварРулоныХарактеристики");
	
	Сериализатор = Новый СериализаторXDTO(ПроксиWS.ФабрикаXDTO);
	ПараметрыЗапросаXDTO = Сериализатор.ЗаписатьXDTO(ПараметрыЗапроса);

	ЗапросТекст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|	И РеализацияТоваровУслуг.Дата = &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	НоменклатураСпр.Наименование КАК НоменклатураНаименование,
	|	НоменклатураСпр.Код КАК НоменклатураКод,
	|	НоменклатураСпр.Артикул КАК НоменклатураАртикул,
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Серия КАК Серия,
	|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КоличествоУпаковок,
	|	НоменклатураСпр.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	НоменклатураСпр.Описание КАК НоменклатураОписание,
	|	НоменклатураСпр.ВидНоменклатуры.Наименование КАК ВидНоменклатурыНаименование
	|ПОМЕСТИТЬ ВТ_ЗаказКлиентаОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	|	,Склад.смартАвтоматическиФормироватьДокументы
	|			И ДокументОтгрузки В
	|				(ВЫБРАТЬ
	|					ВТ.Заказ
	|				ИЗ
	|					ВТ_Заказ КАК ВТ)) КАК ТоварыКОтгрузкеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО ТоварыКОтгрузкеОстатки.Номенклатура = НоменклатураСпр.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаСсылка.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Контрагент) КАК Контрагент,
	|	ЗаказКлиентаСсылка.смартНомерМашины + "" "" + ЗаказКлиентаСсылка.смартВидТранспорта КАК ТранспортноеСредство,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Организация) КАК Перевозчик,
	|	ЗаказКлиентаСсылка.смартВидТранспорта КАК Марка,
	|	ЗаказКлиентаСсылка.смартНомерМашины КАК НомерМашины,
	|	ЗаказКлиентаСсылка.смартНомерПрицепа КАК смартНомерПрицепа,
	|	ЗаказКлиентаСсылка.смартФИОВодителя КАК ФИОВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВодителя КАК смартНомерСерияПаспортВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВодителя КАК смартДатаВыдачиПаспортаВодителя,
	|	ЗаказКлиентаСсылка.смартФИОВторогоВодителя КАК смартФИОВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВторогоВодителя КАК смартНомерСерияПаспортВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВторогоВодителя КАК смартДатаВыдачиПаспортаВторогоВодителя, 
	|	ЗаказКлиентаСсылка.смартЖелаемаяДатаОтгрузкиАдмирал КАК ЖелаемаяДатаОтгрузки,
	|	ЗаказКлиентаСсылка.смартЖелаемоеВремяОтгрузки КАК смартЖелаемоеВремяОтгрузки,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураАртикул КАК НоменклатураАртикул,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураКод КАК НоменклатураКод,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Ссылка) КАК ЗаказКлиента,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураОписание КАК НоменклатураОписание,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.Серия) КАК Серия,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.Серия.Номер) КАК СерияНомер,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.Характеристика) КАК Характеристика,
	|	ВТ_ЗаказКлиентаОстатки.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.НоменклатураЕдиницаИзмерения) КАК НоменклатураЕдиницаИзмерения,
	|	ЗаказКлиентаСсылка.АдресДоставки КАК АдресДоставки,
	|	ВЫБОР КОГДА ВТ_ЗаказКлиентаОстатки.ВидНоменклатурыНаименование = &ВидНоменклатурыНаименование ТОГДА Истина Иначе Ложь КОНЕЦ КАК ЭтоНоменклатураВПогонныхМетрах
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаСсылка
	|		ПО ВТ_Заказ.Заказ = ЗаказКлиентаСсылка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказКлиентаОстатки КАК ВТ_ЗаказКлиентаОстатки
	|		ПО ВТ_Заказ.Заказ = ВТ_ЗаказКлиентаОстатки.ДокументОтгрузки
	|ГДЕ
	|	ЗаказКлиентаСсылка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)";
	
	//++ #2552 смарт: Тимофеева 20.10.2025 / Сделать обязательную комплектацию оборудования каталогом
	ЗапросТекст = ЗапросТекст + "
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаСсылка.Номер,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Контрагент),
	|	ЗаказКлиентаСсылка.смартНомерМашины + "" "" + ЗаказКлиентаСсылка.смартВидТранспорта,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Организация),
	|	ЗаказКлиентаСсылка.смартВидТранспорта,
	|	ЗаказКлиентаСсылка.смартНомерМашины,
	|	ЗаказКлиентаСсылка.смартНомерПрицепа,
	|	ЗаказКлиентаСсылка.смартФИОВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВодителя,
	|	ЗаказКлиентаСсылка.смартФИОВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартЖелаемаяДатаОтгрузкиАдмирал,
	|	ЗаказКлиентаСсылка.смартЖелаемоеВремяОтгрузки,
	|	Каталог.Наименование,
	|	Каталог.Артикул,
	|	Каталог.Код,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Ссылка),
	|	Каталог.Описание,
	|	"""",
	|	"""",
	|	"""",
	|	УсловияНаСвязанныеДокументы.Количество,
	|	ПРЕДСТАВЛЕНИЕ(Каталог.ЕдиницаИзмерения),
	|	ЗаказКлиентаСсылка.АдресДоставки,
	|	ЛОЖЬ
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаСсылка
	|		ПО ВТ_Заказ.Заказ = ЗаказКлиентаСсылка.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента
	|	ИЗ
	|		Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|	ГДЕ
	|		ЗаказКлиентаТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ.Заказ
	|				ИЗ
	|					ВТ_Заказ КАК ВТ)
	|		И ЗаказКлиентаТовары.Номенклатура В
	|				(ВЫБРАТЬ
	|					Сегменты.Номенклатура КАК Номенклатура
	|				ИЗ
	|					РегистрСведений.НоменклатураСегмента КАК Сегменты
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|						ПО
	|							смартПредопределенныеЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.СегментОборудованияДляКомплектации)
	|								И Сегменты.Сегмент = смартПредопределенныеЗначения.Значение)) КАК УсловияНаОборудование
	|	ПО ВТ_Заказ.Заказ = УсловияНаОборудование.ЗаказКлиента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		ВТ.Значение КАК Ссылка,
	|		СпрНоменклатура.Наименование,
	|		СпрНоменклатура.Код,
	|		СпрНоменклатура.Артикул,
	|		СпрНоменклатура.Описание,
	|		СпрНоменклатура.ЕдиницаИзмерения
	|	ИЗ
	|		Справочник.смартПредопределенныеЗначения КАК ВТ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО ВТ.Значение = СпрНоменклатура.Ссылка
	|	ГДЕ
	|		ВТ.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.КаталогДляКомплектации)
	|		) КАК Каталог
	|		ПО ИСТИНА
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		ЗаказыНаВнутреннееПотреблениеОстатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|		ЗаказыНаВнутреннееПотреблениеОстатки.ЗаказНаВнутреннееПотребление.ДокументОснование КАК ЗаказКлиента,
	|		ЗаказыНаВнутреннееПотреблениеОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюПриход КАК Количество
	|	ИЗ
	|		РегистрНакопления.ЗаказыНаВнутреннееПотребление.ОстаткиИОбороты(
	|				,
	|				,
	|				,
	|				,
	//++ #5970  смарт: Тимофеева 23.04.2026 / Списание каталогов. Формирование пакета документов при отгрузке со складов ответственного хранения.               
	|               Склад.смартНастройкаОбменомСАтлант <> ЗНАЧЕНИЕ(ПланОбмена.смартОбменСоСкладомАтлант.ПустаяСсылка) И 
	//-- #5970  смарт: Тимофеева 23.04.2026
	|				ЗаказНаВнутреннееПотребление.ДокументОснование В
	|					(ВЫБРАТЬ
	|						ВТ.Заказ
	|					ИЗ
	|						ВТ_Заказ КАК ВТ)) КАК ЗаказыНаВнутреннееПотреблениеОстатки
	|	ГДЕ
	|		ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюПриход > 0
	|		И ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюОборот = 0) КАК УсловияНаСвязанныеДокументы
	|	ПО ВТ_Заказ.Заказ = УсловияНаСвязанныеДокументы.ЗаказКлиента
	|		И (УсловияНаСвязанныеДокументы.Номенклатура = Каталог.Ссылка)
	|ГДЕ
	|	ЗаказКлиентаСсылка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)
	|";
	//-- #2552 смарт: Тимофеева 20.10.2025

	ТаблицаХОПрокси = ПроксиWS.ПолучитьТаблицуРезультатаЗапроса(ЗапросТекст, ПараметрыЗапросаXDTO);	
	ВыгрузкаВыборкаАвто = Сериализатор.ПрочитатьXDTO(ТаблицаХОПрокси);
			
	Если ВыгрузкаВыборкаАвто.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь)); 
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();    
    ЗаписьXML.ЗаписатьНачалоЭлемента("instock");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("id");
	ЗаписьXML.ЗаписатьТекст(СокрЛП(ДокСсылка.УникальныйИдентификатор()));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("date");
	ЗаписьXML.ЗаписатьТекст(Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd hh:mm:ss'"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("source_system");
	ЗаписьXML.ЗаписатьТекст("1c_ut");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("owner");
	ЗаписьXML.ЗаписатьТекст("");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("whse");
	ЗаписьXML.ЗаписатьТекст("01");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("documents");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("document");
	ЗаписьXML.ЗаписатьАтрибут("type", "SO");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("header");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("doc_number");
	ЗаписьXML.ЗаписатьТекст(НомерДокумента(ДокСсылка));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("status");
	ЗаписьXML.ЗаписатьТекст("NEW");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("type");
	ЗаписьXML.ЗаписатьТекст("DEFAULT");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("created_date");
	ЗаписьXML.ЗаписатьТекст(Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd hh:mm:ss'"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("expected_date");
	ЗаписьXML.ЗаписатьТекст(Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd hh:mm:ss'"));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("receiverId");
	ЗаписьXML.ЗаписатьТекст("");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ship_address");
	ЗаписьXML.ЗаписатьТекст("");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //header
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("lines");
	
	Счетчик = 0;
	
	Для каждого стрТовары Из ВыгрузкаВыборкаАвто Цикл
		
		Счетчик = Счетчик + 1;
		
		НомерЗаказа = стрТовары.Номер;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("line");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("sku");
		ЗаписьXML.ЗаписатьТекст(стрТовары.НоменклатураКод);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("line_no");
		ЗаписьXML.ЗаписатьТекст(Формат(Счетчик, "ЧЦ=5; ЧВН=; ЧГ="));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(стрТовары.Серия) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("lot_string");
			Если ЗначениеЗаполнено(стрТовары.СерияНомер) Тогда
				ЗаписьXML.ЗаписатьТекст(СокрЛП(стрТовары.СерияНомер));
			Иначе
				ЗаписьXML.ЗаписатьТекст(СокрЛП(стрТовары.Серия));
			КонецЕсли;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ordered_quantity");
		ЗаписьXML.ЗаписатьТекст(Формат(стрТовары.КоличествоУпаковок, "ЧДЦ=3; ЧРД=."));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //line
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //lines
	ЗаписьXML.ЗаписатьКонецЭлемента(); //document
	ЗаписьXML.ЗаписатьКонецЭлемента(); //documents
	ЗаписьXML.ЗаписатьКонецЭлемента(); //instock
	
   	ЗаписьXML.Закрыть();
	
	ИмяФайла = СтрШаблон("Уведомление об отгрузке %1 от %2 (по сч. %3).xml", НомерДокумента(ДокСсылка), Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy"), НомерЗаказа);
	
	Двоичное = Новый ДвоичныеДанные(ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Двоичное;

КонецФункции

//++ #Б3572 смарт: Шляпников 17.06.2025 / Интеграция с WMS. Атлант. Отгрузка. Разработка
Функция ПолучитьFTPСоединение(Склад) Экспорт

	АдресFTP  = Склад.АтлантFTPАдрес;
	ЛогинFTP  = Склад.АтлантFTPЛогин;
	ПарольFTP = Склад.АтлантFTPПароль;
	
	Если НЕ (ЗначениеЗаполнено(АдресFTP) И ЗначениеЗаполнено(ЛогинFTP) И ЗначениеЗаполнено(ПарольFTP)) Тогда
		Возврат	Неопределено;
	КонецЕсли;	
			 
    Попытка
		FTPСоединение = Новый FTPСоединение(АдресFTP, , ЛогинFTP, ПарольFTP, , Истина, 50);
	Исключение
		Возврат	Неопределено;
	КонецПопытки;
	
	Возврат FTPСоединение;
	
КонецФункции

//++ #Б3572 смарт: Шляпников 17.06.2025 / Интеграция с WMS. Атлант. Отгрузка. Разработка
Функция ЗаписатьФайлВКаталог(FTPСоединениеАтлант, Каталог, ИмяФайлаЛокальныйПуть, ИмяФайла, ТестовыйРежим = Ложь) Экспорт

	//in - запросы на приемку, мы размещаем
	//ex_in - ответы по приемкам, мы читаем
	//out - запросы на отгрузку, мы размещаем
	//ex_out - ответы по отгрузкам, мы читаем
	//md - справочник товаров, мы размещаем
	
	//Каталоги для тестирования имеют постфикс "1".

	ПутьКаталога = "/" + Каталог + ?(ТестовыйРежим, "1", "");

	Попытка
	
		FTPСоединениеАтлант.УстановитьТекущийКаталог(ПутьКаталога);

		FTPСоединениеАтлант.Записать(ИмяФайлаЛокальныйПуть, ИмяФайла);	

		Результат = Истина;
		
	Исключение

		ЗаписьЖурналаРегистрации("Обмен со складом Атлант", УровеньЖурналаРегистрации.Ошибка, , ,
								 "Не удалось записать файл " + ИмяФайла + " в каталог " + ПутьКаталога);
		
		Результат = Ложь;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

//++ #Б3572 смарт: Шляпников 17.06.2025 / Интеграция с WMS. Атлант. Отгрузка. Разработка
Процедура ОтправитьЗаявкуВАтлантСервер(ИмяФайла, ДвоичныеДанные, Склад) Экспорт
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Соединение = ПолучитьFTPСоединение(Склад);
	Если Соединение = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось установить FTP соединение с сервером Атлант");
		Возврат;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	Если НЕ	ЗаписатьФайлВКаталог(Соединение, "out", ИмяВременногоФайла, ИмяФайла) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось установить записать файл %1 на FTP", ИмяФайла));
	КонецЕсли;
	
	УдалитьФайлы(ИмяВременногоФайла);
		
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("На FTP Атлант выгружен файл %1", ИмяФайла));
	
КонецПроцедуры

#КонецОбласти

//++ смарт:ММ 572 08.07.2021
// ДокСсылка - РеализацияТоваровУслуг
Функция СформироватьТабличныеДокументыПоДаннымУТ(ДокСсылка) Экспорт
	
	СтруктураВозврат = Новый Структура;
	
	ПроксиWS = Неопределено;
	
	//++ смарт:ММ 572 22.07.2021
	СтруктураВозврат.Вставить("ТабДокЗаявкаНаМашину", 	Неопределено);
	СтруктураВозврат.Вставить("ИмяФайлаЗаявкаНаМашину", "");
	СтруктураВозврат.Вставить("ТабДокЗаявкаНаОтгрузку", Неопределено);
	СтруктураВозврат.Вставить("ИмяФайлаЗаявкаНаОтгрузку", "");
	СтруктураВозврат.Вставить("НазваниеАвто", "");
	СтруктураВозврат.Вставить("НомерАвто", "");
	
	СпособОтгрузкиСоСкладаАдмирал = Ложь;
	ВЗаказеСкладАдмирал = Ложь;
	НазваниеАвто = "";
	НомерАвто = "";
	ПроверитьЗаказКлиента(ПроксиWS, ДокСсылка, СпособОтгрузкиСоСкладаАдмирал, ВЗаказеСкладАдмирал, НазваниеАвто, НомерАвто);
	
	//++ #Б3572 смарт: Шляпников 17.06.2025 / Интеграция с WMS. Атлант. Отгрузка. Разработка
	Если ВЗаказеСкладАдмирал = "Атлант" Тогда
		ВЗаказеСкладАдмирал = Истина;
		ЭтоАтлант = Истина;
	Иначе
		ЭтоАтлант = Ложь;
	КонецЕсли;
	//-- #Б3572 смарт: Шляпников 17.06.2025

	СтруктураВозврат.Вставить("СпособОтгрузкиСоСкладаАдмирал", СпособОтгрузкиСоСкладаАдмирал);
	СтруктураВозврат.Вставить("ВЗаказеСкладАдмирал", ВЗаказеСкладАдмирал);
	СтруктураВозврат.Вставить("НазваниеАвто", НазваниеАвто);
	СтруктураВозврат.Вставить("НомерАвто", НомерАвто);
	СтруктураВозврат.Вставить("ЭтоАтлант", ЭтоАтлант);

	//++ смарт:ММ 606 12.09.2021
	СтруктураВозврат.Вставить("ДвоичныеДанныеXML", Неопределено);
	//-- смарт:ММ 12.09.2021
	
	Если НЕ ВЗаказеСкладАдмирал Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;
	
	Если СпособОтгрузкиСоСкладаАдмирал Тогда
	//-- смарт:ММ 22.07.2021
	
	ИмяФайлаЗаявкаНаМашину = "";
	//++ #Б3572 смарт: Шляпников 17.06.2025 / Интеграция с WMS. Атлант. Отгрузка. Разработка
	Если ЭтоАтлант Тогда
		ТабДокЗаявкаНаМашину = Неопределено;
	Иначе
		ТабДокЗаявкаНаМашину = СформироватьТабличныйДокументЗаявкаНаМашину(ДокСсылка, ИмяФайлаЗаявкаНаМашину, "xlsx", ПроксиWS);
	КонецЕсли;
	//-- #Б3572 смарт: Шляпников 17.06.2025
	
	//++ смарт:ММ 572 22.07.2021
	Иначе
		ИмяФайлаЗаявкаНаМашину = "";
		ТабДокЗаявкаНаМашину = Неопределено;
	КонецЕсли;
	//-- смарт:ММ 22.07.2021

	ИмяФайлаЗаявкаНаОтгрузку = "";
	//++ #Б3572 смарт: Шляпников 17.06.2025 / Интеграция с WMS. Атлант. Отгрузка. Разработка
	Если ЭтоАтлант Тогда
		ТабДокЗаявкаНаОтгрузку = СформироватьТабличныйДокументЗаявкаНаОтгрузкуАтлант(ДокСсылка, ИмяФайлаЗаявкаНаОтгрузку, "xls", ПроксиWS);
	Иначе
		ТабДокЗаявкаНаОтгрузку = СформироватьТабличныйДокументЗаявкаНаОтгрузку(ДокСсылка, ИмяФайлаЗаявкаНаОтгрузку, "xlsx", ПроксиWS);
	КонецЕсли;
	//-- #Б3572 смарт: Шляпников 17.06.2025
	
	СтруктураВозврат.Вставить("ТабДокЗаявкаНаМашину", 	ТабДокЗаявкаНаМашину);
	СтруктураВозврат.Вставить("ИмяФайлаЗаявкаНаМашину", ИмяФайлаЗаявкаНаМашину);
	СтруктураВозврат.Вставить("ТабДокЗаявкаНаОтгрузку", ТабДокЗаявкаНаОтгрузку);
	СтруктураВозврат.Вставить("ИмяФайлаЗаявкаНаОтгрузку", ИмяФайлаЗаявкаНаОтгрузку);
	
	//++ смарт:ММ 606 12.09.2021
	//++ #Б3572 смарт: Шляпников 17.06.2025 / Интеграция с WMS. Атлант. Отгрузка. Разработка
	ИмяФайлаXML = "";
	Если ЭтоАтлант Тогда
		ДвоичныеДанныеXML = СформироватьXMLПоЗаявкаНаОтгрузкуАтлант(ДокСсылка, ИмяФайлаXML, ПроксиWS);
	Иначе
		ДвоичныеДанныеXML = СформироватьXMLПоЗаявкаНаОтгрузку(ДокСсылка, "ПакетДанныхПоЗаявкамНаОтгрузку.XML", ПроксиWS);
	КонецЕсли;
	СтруктураВозврат.Вставить("ИмяФайлаXML", ИмяФайлаXML);
	//-- #Б3572 смарт: Шляпников 17.06.2025
	СтруктураВозврат.Вставить("ДвоичныеДанныеXML", ДвоичныеДанныеXML);
	//-- смарт:ММ 12.09.2021
	
	ПроксиWS = Неопределено;
	
	Возврат СтруктураВозврат;
	
КонецФункции //-- смарт:ММ 08.07.2021

//++ смарт:ММ 572 22.07.2021
Процедура ПроверитьЗаказКлиента(ПроксиWS, ДокСсылка, СпособОтгрузкиСоСкладаАдмирал, ВЗаказеСкладАдмирал, НазваниеАвто, НомерАвто)
	
	// Подключение к УТ через веб-сервис
	Если ПроксиWS = Неопределено Тогда
		ПроксиWS = ПодключениеК_УТ();	
	КонецЕсли;
	
	Если ПроксиWS = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Номер", ДокСсылка.Номер);
	ПараметрыЗапроса.Вставить("Дата", ДокСсылка.Дата);
	
	Сериализатор = Новый СериализаторXDTO(ПроксиWS.ФабрикаXDTO);
	ПараметрыЗапросаXDTO = Сериализатор.ЗаписатьXDTO(ПараметрыЗапроса);
	
	ЗапросТекст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РеализацияТоваровУслуг.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|					И РеализацияТоваровУслуг.Склад.смартАвтоматическиФормироватьДокументы
	|				ТОГДА ИСТИНА
	|			КОГДА РеализацияТоваровУслугТовары.Склад.смартАвтоматическиФормироватьДокументы
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВЗаказеСкладАдмирал,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РеализацияТоваровУслуг.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПУстаяСсылка)
	|					И РеализацияТоваровУслуг.Склад.смартАвтоматическиФормироватьДокументы И РеализацияТоваровУслуг.Склад.смартНастройкаОбменомСАтлант <> ЗНАЧЕНИЕ(ПланОбмена.смартОбменСоСкладомАтлант.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			КОГДА РеализацияТоваровУслугТовары.Склад.смартАвтоматическиФормироватьДокументы И РеализацияТоваровУслугТовары.Склад.смартНастройкаОбменомСАтлант <> ЗНАЧЕНИЕ(ПланОбмена.смартОбменСоСкладомАтлант.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВЗаказеСкладАтлант
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугТовары.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|	И РеализацияТоваровУслуг.Дата = &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК СпособОтгрузкиСоСкладаАдмирал,
	|	МАКСИМУМ(ВТ_Заказ.ВЗаказеСкладАдмирал) КАК ВЗаказеСкладАдмирал,
	|	МАКСИМУМ(ВТ_Заказ.ВЗаказеСкладАтлант) КАК ВЗаказеСкладАтлант,
	|	МАКСИМУМ(ЗаказКлиента.смартВидТранспорта) КАК смартВидТранспорта,
	|	МАКСИМУМ(ЗаказКлиента.смартНомерМашины) КАК НомерМашины,
	|	МАКСИМУМ(ЗаказКлиента.смартНомерПрицепа) КАК смартНомерПрицепа
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказ КАК ВТ_Заказ
	|		ПО ЗаказКлиента.Ссылка = ВТ_Заказ.Заказ";
	
	ТаблицаХОПрокси = ПроксиWS.ПолучитьТаблицуРезультатаЗапроса(ЗапросТекст, ПараметрыЗапросаXDTO);	
	ТЗ_УТ1 = Сериализатор.ПрочитатьXDTO(ТаблицаХОПрокси);
	
	Для Каждого ТекСтрока Из ТЗ_УТ1 Цикл
		
		СпособОтгрузкиСоСкладаАдмирал = ТекСтрока.СпособОтгрузкиСоСкладаАдмирал;
		ВЗаказеСкладАдмирал = ТекСтрока.ВЗаказеСкладАдмирал;
		НазваниеАвто = ТекСтрока.смартВидТранспорта;
		НомерАвто = СтрШаблон("%1 %2", СокрЛП(ТекСтрока.НомерМашины), ТекСтрока.смартНомерПрицепа);
		
		//++ #Б3572 смарт: Шляпников 17.06.2025 / Интеграция с WMS. Атлант. Отгрузка. Разработка
		Если ТекСтрока.ВЗаказеСкладАтлант Тогда
			ВЗаказеСкладАдмирал = "Атлант";
		КонецЕсли;
		//-- #Б3572 смарт: Шляпников 17.06.2025
		
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 22.07.2021

//++ смарт:ММ 572 14.07.2021
Функция СформироватьТабличныйДокументТранспортнаяНакладная(ДокСсылка, ИмяФайла = "", НазваниеАвто = "", НомерАвто = "") Экспорт
	
	//// ++ 26.08.2021
	//Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокСсылка.Номер, Истина, Истина);
	//// --
    
     //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.12.2021 11:39:35 задача 715
    НомерЗаказа = "";
    Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокСсылка,"СчетНаОплатуПокупателю") И СтрНайти(ДокСсылка.СчетНаОплатуПокупателю.Номер,"ОПЦБ-")>0 Тогда
        //НомерЗаказа = ДокСсылка.ДоговорКонтрагента.Номер;
        НомерЗаказа = ДокСсылка.СчетНаОплатуПокупателю.Номер;
    КонецЕсли;
    //Смарт }Подкин Алексей Иванович 01.12.2021 11:39:35
	
	//++ #3984 смарт: Шляпников 06.08.2025 / Интеграция с WMS. Атлант. Отгрузка. Дополнение.
	НомерТТН = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокСсылка.Номер, Истина, Истина);
	
    //Смарт {[*](фрагмент ИЗМЕНЕН), Подкин Алексей Иванович 01.12.2021 12:13:53 задача 715
    ИмяФайла = "Транспортная накладная № " + НомерТТН + " от " + Формат(ДокСсылка.Дата, "ДФ='dd MMMM yyyy ""г""'") +?(НомерЗаказа = "",""," (по сч. "+НомерЗаказа+")")+ ".pdf";
    //Смарт }Подкин Алексей Иванович 01.12.2021 12:13:53
	//-- #3984 смарт: Шляпников 06.08.2025
    
    МассивОбъектов = Новый Массив;
    МассивОбъектов.Добавить(ДокСсылка);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(ДокСсылка, "Документ_1");
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	
	ПараметрыВывода = Новый Структура;
	//++ смарт:ММ 663 02.10.2021 
	ПараметрыВывода.Вставить("смартЭтоСкладАдмирал", Истина);
	//-- смарт:ММ 02.10.2021
	
	ВременнаяКоллекцияДляОднойПечатнойФормы = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("ТранспортнаяНакладная");

	Обработки.ПечатьТранспортнойНакладной.Печать(МассивОбъектов, ПараметрыПечати, ВременнаяКоллекцияДляОднойПечатнойФормы, 
						ОбъектыПечати, ПараметрыВывода);

	ТабДок = Неопределено;
	
	Если ВременнаяКоллекцияДляОднойПечатнойФормы.Количество() > 0 Тогда
		ТабДок = ВременнаяКоллекцияДляОднойПечатнойФормы[0].ТабличныйДокумент;
		
		//++ смарт:ММ 572 28.07.2021
		// Заполнение авто
		Если ЗначениеЗаполнено(НомерАвто) ИЛИ ЗначениеЗаполнено(НазваниеАвто) Тогда
			ИмяОбласти = ТабДок.НайтиТекст("(тип, марка, грузоподъемность (в тоннах), вместимость (в кубических метрах)").Имя;
			НомерСимвола = СтрНайти(ИмяОбласти, "C");
			КонецИмени = Сред(ИмяОбласти, НомерСимвола, СтрДлина(ИмяОбласти) - НомерСимвола + 1);
			НомерСтроки = Сред(ИмяОбласти, 2, НомерСимвола - 2);
			
			НомерКолонки = Прав(ИмяОбласти, СтрДлина(ИмяОбласти) - НомерСимвола);
			
			Попытка
				НомерСтрокиТС = Число(НомерСтроки);
				ТабДок.Область("R" + (НомерСтрокиТС - 3) + КонецИмени).Текст = НазваниеАвто;  
				
				НомерКолонки = Число(НомерКолонки) + 28;
				ТабДок.Область("R" + (НомерСтрокиТС - 1) + "C" + НомерКолонки).Текст = НомерАвто;  
			Исключение
			КонецПопытки;
		КонецЕсли;
		//-- смарт:ММ 28.07.2021
		
		//++ смарт:ММ 572 26.08.2021
		// Заполнение номера заказа
		НомерЗаказа = ДокСсылка.СчетНаОплатуПокупателю.Номер;
		НомерЗаказа = НомерЗаказа;//ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерЗаказа, Истина, Истина);
		ТабДок.Область("R8C46:R8C56").Текст = НомерЗаказа;
		
		ТабДок.Область("R8C32:R8C40").Текст = ДокСсылка.СчетНаОплатуПокупателю.Дата;
		//-- смарт:ММ 26.08.2021
		
		//++ смарт:ММ 663 01.10.2021 
		ТабДок.Область("R8C18:R8C28").Текст = ДокСсылка.Номер;
		//-- смарт:ММ 01.10.2021
	КонецЕсли;
	
	Возврат ТабДок;
	
КонецФункции //-- смарт:ММ 14.07.2021

//++ смарт:rnp 572 25.08.2021 - есть отличия от Смарт-Т Текстиль
Функция ЭтоУниверсальныйДокумент(ДокССылка) Экспорт    
    //++ смарт:Подкин #982 15.04.2022 17:43:11 Для Смарт-Т Текстиль выгружаем ТОРГ12, для всех остальных УПД
   Возврат ?(ДокССылка.Организация.ИНН="9701053617", Ложь, Истина); 
    //-- смарт:Подкин #982 15.04.2022 17:43:11
	//Возврат Истина;//ДокСсылка.ЭтоУниверсальныйДокумент;
КонецФункции

//++ смарт:ММ 572 25.08.2021
Функция СформироватьТабличныйДокументТОРГ12(ДокСсылка, ИмяФайла = "") Экспорт
    
    //Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 01.12.2021 11:39:35 задача 715
    НомерЗаказа = "";
    Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокСсылка,"СчетНаОплатуПокупателю") И СтрНайти(ДокСсылка.СчетНаОплатуПокупателю.Номер,"ОПЦБ-")>0 Тогда
        //НомерЗаказа = ДокСсылка.ДоговорКонтрагента.Номер;
        НомерЗаказа = ДокСсылка.СчетНаОплатуПокупателю.Номер;
    КонецЕсли;
    //Смарт }Подкин Алексей Иванович 01.12.2021 11:39:35
    
    //++ смарт:ММ 572 27.08.2021
    //ИмяФайла = "ТОРГ12 № " + ДокСсылка.Номер + " от " + Формат(ДокСсылка.Дата, "ДФ='dd MMM yyyy ""г""'") + ".pdf";
    //Смарт {[*](фрагмент ИЗМЕНЕН), Подкин Алексей Иванович 01.12.2021 12:05:30 задача 715
    ИмяФайла = "ТОРГ12 № " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокСсылка.Номер) + " от " + Формат(ДокСсылка.Дата, "ДФ='dd MMMM yyyy ""г""'") +?(НомерЗаказа = "",""," (по сч. "+НомерЗаказа+")")+ ".pdf";
    //Смарт }Подкин Алексей Иванович 01.12.2021 12:05:30
    //-- смарт:ММ 27.08.2021
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокСсылка);
	
	ВключатьУслуги = Ложь;
	
	МассивИД = Новый Массив;
	МассивИД.Добавить("ТОРГ12_БезУслуг");
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(МассивИД);
	
	ОбъектыПечати = Новый СписокЗначений;

	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);
	
	ТаблицаСведенийТОРГ12 = Документы.РеализацияТоваровУслуг.ПолучитьТаблицуСведенийТОРГ12(МассивОбъектов, ВключатьУслуги);
		ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_ТОРГ12");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТОРГ12_БезУслуг", "ТОРГ-12 (Товарная накладная с услугами)", 
			ПечатьТорговыхДокументов.ПечатьТОРГ12(ТаблицаСведенийТОРГ12, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_ТОРГ12");

	ТабДок = Неопределено;
	
	Если КоллекцияПечатныхФорм.Количество() > 0 Тогда
		ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	КонецЕсли;
	
	//++#1768 смарт: Лопато 10.04.2024 //При формировании УПД на Адмирал в базе БП некорректно удаляются подписи
	УправлениеПечатьюБП.ОчиститьФаксимильнуюПодписьИПечатьИзМакета(ТабДок, ОбъектыПечати, ДокСсылка);
	//--#1768 смарт: Лопато 10.04.2024
	
	// ++ 26.08.2021
	// Убрать подписи
	
	ИмяОбласти = ТабДок.НайтиТекст("Отпуск груза разрешил").Имя;
	НомерСимвола = СтрНайти(ИмяОбласти, "C");
	НачалоИмени = Лев(ИмяОбласти, НомерСимвола);
	НомерКолонки = Число(Прав(ИмяОбласти, СтрДлина(ИмяОбласти) - НомерСимвола));
	НомерСтроки = Число(Сред(НачалоИмени, 2, СтрДлина(НачалоИмени) - 2));
	Попытка
		НомерКолонкиДолжность = Число(НомерКолонки) + 1;
		НомерКолонкиФИОРук = Число(НомерКолонки) + 5;
		ТабДок.Область(НачалоИмени + НомерКолонкиДолжность).Текст = "";
		ТабДок.Область(НачалоИмени + НомерКолонкиФИОРук).Текст = "";
		ТабДок.Область("R" + (НомерСтроки + 4) + "C" + НомерКолонкиДолжность).Текст = ""; // Должность кладовщик
		ТабДок.Область("R" + (НомерСтроки + 4) + "C" + НомерКолонкиФИОРук).Текст = ""; // ФИО кладовщик
		ТабДок.Область("R" + (НомерСтроки + 2) + "C" + НомерКолонкиФИОРук).Текст = ""; // ФИО бух
		
		// Дата
		ТабДок.Область("R" + (НомерСтроки + 7) + "C" + (НомерКолонки + 2)).Текст = ""; 
		ТабДок.Область("R" + (НомерСтроки + 7) + "C" + (НомерКолонки + 3)).Текст = ""; 
		ТабДок.Область("R" + (НомерСтроки + 7) + "C" + (НомерКолонки + 4)).Текст = ""; 
	Исключение
	КонецПопытки;
	
	Возврат ТабДок;
			
КонецФункции //-- смарт:ММ 25.08.2021

//++ смарт:ММ 606 12.09.2021
// Возвращает двоичные данные XML-файла
Функция СформироватьXMLПоЗаявкаНаОтгрузку(ДокСсылка, ИмяФайла, ПроксиWS)
	
	// Подключение к УТ через веб-сервис
	Если ПроксиWS = Неопределено Тогда
		ПроксиWS = ПодключениеК_УТ();	
	КонецЕсли;
	
	Если ПроксиWS = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Номер", ДокСсылка.Номер);
	ПараметрыЗапроса.Вставить("Дата", ДокСсылка.Дата);
	ПараметрыЗапроса.Вставить("ВидНоменклатурыНаименование", "ТоварРулоныХарактеристики");//++смарт: rnp 11.10.2021
	//++ смарт:ММ 663 02.10.2021 
	//ПараметрыЗапроса.Вставить("Период", ТекущаяДата());
	//-- смарт:ММ 02.10.2021
	//// ОТЛАДКА
	//ПараметрыЗапроса.Вставить("Период", Дата("20210810235959"));
	
	Сериализатор = Новый СериализаторXDTO(ПроксиWS.ФабрикаXDTO);
	ПараметрыЗапросаXDTO = Сериализатор.ЗаписатьXDTO(ПараметрыЗапроса);
	
	//++ смарт:ММ 663 01.10.2021 
	//ЗапросТекст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
	//|ПОМЕСТИТЬ ВТ_Заказ
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//|ГДЕ
	//|	РеализацияТоваровУслуг.Номер = &Номер
	//|	И РеализацияТоваровУслуг.Дата = &Дата
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК Ссылка
	//|ПОМЕСТИТЬ ВТ_ЗаданиеНаПеревозку
	//|ИЗ
	//|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказ КАК ВТ_Заказ
	//|		ПО ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = ВТ_Заказ.Заказ
	//|			И (НЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ПометкаУдаления)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки.Номер КАК Номер,
	//|	ВЫБОР
	//|		КОГДА ТоварыКОтгрузкеОстатки.ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента
	//|			ТОГДА ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказКлиента).Контрагент.Наименование
	//|		КОГДА ТоварыКОтгрузкеОстатки.ДокументОтгрузки ССЫЛКА Документ.ЗаказНаПеремещение
	//|			ТОГДА ВЫРАЗИТЬ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК Документ.ЗаказНаПеремещение).СкладПолучатель.Наименование
	//|	КОНЕЦ КАК Контрагент,
	//|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки.СпособДоставки КАК СпособДоставки,
	//|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ЗаказКлиента,
	//|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки.Организация.Наименование КАК Организация,
	//|	ТоварыКОтгрузкеОстатки.Номенклатура.Наименование КАК НоменклатураНаименование,
	//|	ТоварыКОтгрузкеОстатки.Номенклатура.Код КАК НоменклатураКод,
	//|	ТоварыКОтгрузкеОстатки.Номенклатура.Артикул КАК НоменклатураАртикул,
	//|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	//|	ТоварыКОтгрузкеОстатки.Серия КАК Серия,
	//|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	//|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КоличествоУпаковок,
	//|	ТоварыКОтгрузкеОстатки.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	//|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки.АдресДоставки КАК АдресДоставки
	//|ПОМЕСТИТЬ ВТ_ЗаказКлиента
	//|ИЗ
	//|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	//|			&Период,
	//|			ДокументОтгрузки В
	//|				(ВЫБРАТЬ
	//|					ВТ.Заказ
	//|				ИЗ
	//|					ВТ_Заказ КАК ВТ)) КАК ТоварыКОтгрузкеОстатки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ВТ_ЗаказКлиента.Номер КАК Номер,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиента.Контрагент) КАК Контрагент,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиента.Организация) КАК Организация,
	//|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.ТранспортноеСредство) КАК ТранспортноеСредство,
	//|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.ЗаданиеВыполняет) КАК ЗаданиеВыполняет,
	//|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.Перевозчик) КАК Перевозчик,
	//|	ТранспортныеСредства.Марка КАК Марка,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиента.СпособДоставки) КАК СпособДоставки,
	//|	ПРЕДСТАВЛЕНИЕ(ТранспортныеСредства.Тип) КАК ВидТранспорта,
	//|	ТранспортныеСредства.Код КАК НомерМашины,
	//|	ТранспортныеСредства.ГосударственныйНомерПрицепа КАК смартНомерПрицепа,
	//|	ЕСТЬNULL(ФИОФизическихЛицСрезПоследних.Фамилия + "" "" + ФИОФизическихЛицСрезПоследних.Имя + "" "" + ФИОФизическихЛицСрезПоследних.Отчество, ЗаданиеНаПеревозку.Водитель.Наименование) КАК ФИОВодителя,
	//|	ЕСТЬNULL(ДокументыФизическихЛицСрезПоследних.Серия, """") + "" "" + ЕСТЬNULL(ДокументыФизическихЛицСрезПоследних.Номер, """") КАК смартНомерСерияПаспортВодителя,
	//|	ЕСТЬNULL(ДокументыФизическихЛицСрезПоследних.ДатаВыдачи, """") КАК смартДатаВыдачиПаспортаВодителя,
	//|	ЗаданиеНаПеревозку.ДатаВремяРейсаПланС КАК ЖелаемаяДатаОтгрузки,
	//|	ДАТАВРЕМЯ(1, 1, 1, 9, 30, 0) КАК смартЖелаемоеВремяОтгрузки,
	//|	ВТ_ЗаказКлиента.НоменклатураНаименование КАК НоменклатураНаименование,
	//|	ВТ_ЗаказКлиента.НоменклатураАртикул КАК НоменклатураАртикул,
	//|	ВТ_ЗаказКлиента.НоменклатураКод КАК НоменклатураКод,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиента.Номенклатура) КАК Номенклатура,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиента.ЗаказКлиента) КАК ЗаказКлиента,
	//|	ВТ_ЗаказКлиента.Номенклатура.Описание КАК НоменклатураОписание,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиента.Серия) КАК Серия,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиента.Характеристика) КАК Характеристика,
	//|	ВТ_ЗаказКлиента.КоличествоУпаковок КАК КоличествоУпаковок,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиента.НоменклатураЕдиницаИзмерения) КАК НоменклатураЕдиницаИзмерения,
	//|	ВТ_ЗаказКлиента.АдресДоставки КАК АдресДоставки
	//|ИЗ
	//|	ВТ_ЗаданиеНаПеревозку КАК ВТ_ЗаданиеНаПеревозку
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	//|			ПО ЗаданиеНаПеревозку.ТранспортноеСредство = ТранспортныеСредства.Ссылка
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
	//|			ПО ЗаданиеНаПеревозку.Водитель = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	//|					,
	//|					ВидДокумента В (ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
	//|						ИЛИ ВидДокумента.Наименование = ""Паспорт гражданина другой страны"") КАК ДокументыФизическихЛицСрезПоследних
	//|			ПО ЗаданиеНаПеревозку.Водитель = ДокументыФизическихЛицСрезПоследних.Физлицо
	//|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента
	//|			ПО (ИСТИНА)
	//|		ПО ВТ_ЗаданиеНаПеревозку.Ссылка = ЗаданиеНаПеревозку.Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаданиеНаПеревозку.ТранспортноеСредство,
	//|	ВТ_ЗаказКлиента.Номенклатура,
	//|	ВТ_ЗаказКлиента.Номенклатура.Описание,
	//|	ВТ_ЗаказКлиента.Номер,
	//|	ВТ_ЗаказКлиента.Контрагент,
	//|	ВТ_ЗаказКлиента.Организация,
	//|	ЗаданиеНаПеревозку.ЗаданиеВыполняет,
	//|	ЗаданиеНаПеревозку.Перевозчик,
	//|	ТранспортныеСредства.Марка,
	//|	ВТ_ЗаказКлиента.СпособДоставки,
	//|	ТранспортныеСредства.Тип,
	//|	ТранспортныеСредства.Код,
	//|	ТранспортныеСредства.ГосударственныйНомерПрицепа,
	//|	ЗаданиеНаПеревозку.ДатаВремяРейсаПланС,
	//|	ВТ_ЗаказКлиента.НоменклатураНаименование,
	//|	ВТ_ЗаказКлиента.НоменклатураАртикул,
	//|	ВТ_ЗаказКлиента.НоменклатураКод,
	//|	ЕСТЬNULL(ФИОФизическихЛицСрезПоследних.Фамилия + "" "" + ФИОФизическихЛицСрезПоследних.Имя + "" "" + ФИОФизическихЛицСрезПоследних.Отчество, ЗаданиеНаПеревозку.Водитель.Наименование),
	//|	ЕСТЬNULL(ДокументыФизическихЛицСрезПоследних.Серия, """") + "" "" + ЕСТЬNULL(ДокументыФизическихЛицСрезПоследних.Номер, """"),
	//|	ЕСТЬNULL(ДокументыФизическихЛицСрезПоследних.ДатаВыдачи, """"),
	//|	ВТ_ЗаказКлиента.ЗаказКлиента,
	//|	ВТ_ЗаказКлиента.Серия,
	//|	ВТ_ЗаказКлиента.Характеристика,
	//|	ВТ_ЗаказКлиента.КоличествоУпаковок,
	//|	ВТ_ЗаказКлиента.НоменклатураЕдиницаИзмерения,
	//|	ВТ_ЗаказКлиента.АдресДоставки";
	ЗапросТекст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|	И РеализацияТоваровУслуг.Дата = &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	НоменклатураСпр.Наименование КАК НоменклатураНаименование,
	|	НоменклатураСпр.Код КАК НоменклатураКод,
	|	НоменклатураСпр.Артикул КАК НоменклатураАртикул,
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Серия КАК Серия,
	|	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	|	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КоличествоУпаковок,
	|	НоменклатураСпр.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	НоменклатураСпр.Описание КАК НоменклатураОписание,
	|	НоменклатураСпр.ВидНоменклатуры.Наименование КАК ВидНоменклатурыНаименование
	|ПОМЕСТИТЬ ВТ_ЗаказКлиентаОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	//|			&Период,
	//++ #1353 смарт: Фролов 18.05.2023 //Доработать логику взаимодействия с Адмирал по нескольким складам (УТ + БП)  
	//|	,Склад В (ВЫБРАТЬ смартПредопределенныеЗначения.Значение ИЗ Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения ГДЕ смартПредопределенныеЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.СкладАдмирал))
	|	,Склад.смартАвтоматическиФормироватьДокументы
	//-- #1353 смарт: Фролов 18.05.2023
	|			И ДокументОтгрузки В
	|				(ВЫБРАТЬ
	|					ВТ.Заказ
	|				ИЗ
	|					ВТ_Заказ КАК ВТ)) КАК ТоварыКОтгрузкеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО ТоварыКОтгрузкеОстатки.Номенклатура = НоменклатураСпр.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаСсылка.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Контрагент) КАК Контрагент,
	|	ЗаказКлиентаСсылка.смартНомерМашины + "" "" + ЗаказКлиентаСсылка.смартВидТранспорта КАК ТранспортноеСредство,
	//++смарт:rnp 691 24.10.2021
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Организация) КАК Перевозчик,
	//--смарт:rnp 691 24.10.2021
	|	ЗаказКлиентаСсылка.смартВидТранспорта КАК Марка,
	|	ЗаказКлиентаСсылка.смартНомерМашины КАК НомерМашины,
	|	ЗаказКлиентаСсылка.смартНомерПрицепа КАК смартНомерПрицепа,
	|	ЗаказКлиентаСсылка.смартФИОВодителя КАК ФИОВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВодителя КАК смартНомерСерияПаспортВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВодителя КАК смартДатаВыдачиПаспортаВодителя,
	//++ #1228 смарт: Фролов 24.11.2022 //Заказ клиента Раздел Доставка - доработать  
	|	ЗаказКлиентаСсылка.смартФИОВторогоВодителя КАК смартФИОВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВторогоВодителя КАК смартНомерСерияПаспортВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВторогоВодителя КАК смартДатаВыдачиПаспортаВторогоВодителя, 
	//-- #1228 смарт: Фролов 24.11.2022
	|	ЗаказКлиентаСсылка.смартЖелаемаяДатаОтгрузкиАдмирал КАК ЖелаемаяДатаОтгрузки,
	|	ЗаказКлиентаСсылка.смартЖелаемоеВремяОтгрузки КАК смартЖелаемоеВремяОтгрузки,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураАртикул КАК НоменклатураАртикул,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураКод КАК НоменклатураКод,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Ссылка) КАК ЗаказКлиента,
	|	ВТ_ЗаказКлиентаОстатки.НоменклатураОписание КАК НоменклатураОписание,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.Серия) КАК Серия,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.Характеристика) КАК Характеристика,
	|	ВТ_ЗаказКлиентаОстатки.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ЗаказКлиентаОстатки.НоменклатураЕдиницаИзмерения) КАК НоменклатураЕдиницаИзмерения,
	|	ЗаказКлиентаСсылка.АдресДоставки КАК АдресДоставки,
	//++смарт:rnp 11.10.2021
	|	ВЫБОР КОГДА ВТ_ЗаказКлиентаОстатки.ВидНоменклатурыНаименование = &ВидНоменклатурыНаименование ТОГДА Истина Иначе Ложь КОНЕЦ КАК ЭтоНоменклатураВПогонныхМетрах
	//--смарт:rnp 11.10.2021
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаСсылка
	|		ПО ВТ_Заказ.Заказ = ЗаказКлиентаСсылка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказКлиентаОстатки КАК ВТ_ЗаказКлиентаОстатки
	|		ПО ВТ_Заказ.Заказ = ВТ_ЗаказКлиентаОстатки.ДокументОтгрузки
	|ГДЕ
	|	ЗаказКлиентаСсылка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)";

	//-- смарт:ММ 01.10.2021
	
	//++ #2552 смарт: Тимофеева 20.10.2025 / Сделать обязательную комплектацию оборудования каталогом
	ЗапросТекст = ЗапросТекст + "
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаСсылка.Номер,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Контрагент),
	|	ЗаказКлиентаСсылка.смартНомерМашины + "" "" + ЗаказКлиентаСсылка.смартВидТранспорта,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Организация),
	|	ЗаказКлиентаСсылка.смартВидТранспорта,
	|	ЗаказКлиентаСсылка.смартНомерМашины,
	|	ЗаказКлиентаСсылка.смартНомерПрицепа,
	|	ЗаказКлиентаСсылка.смартФИОВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВодителя,
	|	ЗаказКлиентаСсылка.смартФИОВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартНомерСерияПаспортВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартДатаВыдачиПаспортаВторогоВодителя,
	|	ЗаказКлиентаСсылка.смартЖелаемаяДатаОтгрузкиАдмирал,
	|	ЗаказКлиентаСсылка.смартЖелаемоеВремяОтгрузки,
	|	Каталог.Наименование,
	|	Каталог.Артикул,
	|	Каталог.Код,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказКлиентаСсылка.Ссылка),
	|	Каталог.Описание,
	|	"""",
	|	"""",
	|	УсловияНаСвязанныеДокументы.Количество,
	|	ПРЕДСТАВЛЕНИЕ(Каталог.ЕдиницаИзмерения),
	|	ЗаказКлиентаСсылка.АдресДоставки,
	|	ЛОЖЬ
	|ИЗ
	|	ВТ_Заказ КАК ВТ_Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаСсылка
	|		ПО ВТ_Заказ.Заказ = ЗаказКлиентаСсылка.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента
	|	ИЗ
	|		Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|	ГДЕ
	|		ЗаказКлиентаТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ.Заказ
	|				ИЗ
	|					ВТ_Заказ КАК ВТ)
	|		И ЗаказКлиентаТовары.Номенклатура В
	|				(ВЫБРАТЬ
	|					Сегменты.Номенклатура КАК Номенклатура
	|				ИЗ
	|					РегистрСведений.НоменклатураСегмента КАК Сегменты
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|						ПО
	|							смартПредопределенныеЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.СегментОборудованияДляКомплектации)
	|								И Сегменты.Сегмент = смартПредопределенныеЗначения.Значение)) КАК УсловияНаОборудование
	|	ПО ВТ_Заказ.Заказ = УсловияНаОборудование.ЗаказКлиента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		ВТ.Значение КАК Ссылка,
	|		СпрНоменклатура.Наименование,
	|		СпрНоменклатура.Код,
	|		СпрНоменклатура.Артикул,
	|		СпрНоменклатура.Описание,
	|		СпрНоменклатура.ЕдиницаИзмерения
	|	ИЗ
	|		Справочник.смартПредопределенныеЗначения КАК ВТ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО ВТ.Значение = СпрНоменклатура.Ссылка
	|	ГДЕ
	|		ВТ.Ссылка = ЗНАЧЕНИЕ(Справочник.смартПредопределенныеЗначения.КаталогДляКомплектации)
	|		) КАК Каталог
	|		ПО ИСТИНА
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		ЗаказыНаВнутреннееПотреблениеОстатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|		ЗаказыНаВнутреннееПотреблениеОстатки.ЗаказНаВнутреннееПотребление.ДокументОснование КАК ЗаказКлиента,
	|		ЗаказыНаВнутреннееПотреблениеОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюПриход КАК Количество
	|	ИЗ
	|		РегистрНакопления.ЗаказыНаВнутреннееПотребление.ОстаткиИОбороты(
	|				,
	|				,
	|				,
	|				,
	//++ #5970  смарт: Тимофеева 23.04.2026 / Списание каталогов. Формирование пакета документов при отгрузке со складов ответственного хранения.               
	|               НЕ Склад.смартНастройкаОбменомСАтлант <> ЗНАЧЕНИЕ(ПланОбмена.смартОбменСоСкладомАтлант.ПустаяСсылка) И 
	//-- #5970  смарт: Тимофеева 23.04.2026
	|				ЗаказНаВнутреннееПотребление.ДокументОснование В
	|					(ВЫБРАТЬ
	|						ВТ.Заказ
	|					ИЗ
	|						ВТ_Заказ КАК ВТ)) КАК ЗаказыНаВнутреннееПотреблениеОстатки
	|	ГДЕ
	|		ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюПриход > 0
	|		И ЗаказыНаВнутреннееПотреблениеОстатки.КОформлениюОборот = 0) КАК УсловияНаСвязанныеДокументы
	|	ПО ВТ_Заказ.Заказ = УсловияНаСвязанныеДокументы.ЗаказКлиента
	|		И (УсловияНаСвязанныеДокументы.Номенклатура = Каталог.Ссылка)
	|ГДЕ
	|	ЗаказКлиентаСсылка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал)
	|";
	//-- #2552 смарт: Тимофеева 20.10.2025
	
	ТаблицаХОПрокси = ПроксиWS.ПолучитьТаблицуРезультатаЗапроса(ЗапросТекст, ПараметрыЗапросаXDTO);	
	ВыгрузкаВыборкаАвто = Сериализатор.ПрочитатьXDTO(ТаблицаХОПрокси);
			
	//++ смарт:ММ 663 02.10.2021 
	Если ВыгрузкаВыборкаАвто.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	//-- смарт:ММ 02.10.2021

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Автомобиль");
	//++ смарт:ММ 706 11.11.2021
	ТЗ.Колонки.Добавить("Trip");
	//-- смарт:ММ 11.11.2021
	ТЗ.Колонки.Добавить("Avto_Num");
	ТЗ.Колонки.Добавить("Avto_Num_Trailer");
	ТЗ.Колонки.Добавить("Avto_Model");
	ТЗ.Колонки.Добавить("Data");
	ТЗ.Колонки.Добавить("Date_Plan");
	ТЗ.Колонки.Добавить("Driver");
	ТЗ.Колонки.Добавить("Driver_Pasport");
	ТЗ.Колонки.Добавить("Driver_Phone");
	//++ смарт:rnp 674 13.10.2021 
	ТЗ.Колонки.Добавить("Driver2");
	ТЗ.Колонки.Добавить("Driver2_Pasport");
	ТЗ.Колонки.Добавить("Driver2_Phone");
	//-- смарт:rnp 13.10.2021
	ТЗ.Колонки.Добавить("Provider");
	ТЗ.Колонки.Добавить("Client");
	ТЗ.Колонки.Добавить("Shipment");
	ТЗ.Колонки.Добавить("Delivery");
	ТЗ.Колонки.Добавить("Adres");
	ТЗ.Колонки.Добавить("Id_Adr");
	ТЗ.Колонки.Добавить("March_num");
	ТЗ.Колонки.Добавить("Delivery_Type");
	ТЗ.Колонки.Добавить("Code_Prod");
	ТЗ.Колонки.Добавить("Id_Prod");
	ТЗ.Колонки.Добавить("Name");
	ТЗ.Колонки.Добавить("Serial_Number");
	ТЗ.Колонки.Добавить("Quan_Pallet");
	ТЗ.Колонки.Добавить("Date_partii");
	ТЗ.Колонки.Добавить("Lable");
	ТЗ.Колонки.Добавить("Quan");
	ТЗ.Колонки.Добавить("QuanSTUOM");
	//++ смарт:ММ 636 16.09.2021 
	ТЗ.Колонки.Добавить("QuanST");
	//-- смарт:ММ 16.09.2021
	
	СписокАвто = Новый ТаблицаЗначений;
	СписокАвто.Колонки.Добавить("Автомобиль");
	//++ смарт:ММ 706 11.11.2021
	СписокАвто.Колонки.Добавить("Trip");
	//-- смарт:ММ 11.11.2021
	СписокАвто.Колонки.Добавить("Avto_Num");
	СписокАвто.Колонки.Добавить("Avto_Num_Trailer");
	СписокАвто.Колонки.Добавить("Avto_Model");
	СписокАвто.Колонки.Добавить("Data");
	СписокАвто.Колонки.Добавить("Date_Plan");
	СписокАвто.Колонки.Добавить("Driver");
	СписокАвто.Колонки.Добавить("Driver_Pasport");
	СписокАвто.Колонки.Добавить("Driver_Phone");
	СписокАвто.Колонки.Добавить("Driver2");
	СписокАвто.Колонки.Добавить("Driver2_Pasport");
	СписокАвто.Колонки.Добавить("Driver2_Phone");
	Для каждого ВыборкаАвто из ВыгрузкаВыборкаАвто Цикл
		Если Не ЗначениеЗаполнено(ВыборкаАвто.КоличествоУпаковок) Тогда Продолжить КонецЕсли; //++смарт: rnp 11.10.2021
		смартЖелаемоеВремяОтгрузки = ВыборкаАвто.смартЖелаемоеВремяОтгрузки;

		//++#1631 смарт: Лопато 14.02.2024 //Формирование пакета документов самовывоз со склада Адмирал  
		//ДатаВремя = Формат(ДокСсылка.Дата, "ДФ=dd.MM.yyyy");//смарт:rnp 14.10.2021 дату отгрузки на самовывоз берем по дате реализации //Формат(ВыборкаАвто.ЖелаемаяДатаОтгрузки, "ДФ=dd.MM.yyyy");
		Если ЗначениеЗаполнено(ВыборкаАвто.ЖелаемаяДатаОтгрузки) Тогда
			ДатаДокумента = Формат(ВыборкаАвто.ЖелаемаяДатаОтгрузки, "ДФ=dd.MM.yyyy");
		Иначе
			ДатаДокумента = Формат(ДокСсылка.Дата, "ДФ=dd.MM.yyyy");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(смартЖелаемоеВремяОтгрузки) Тогда
			ДатаВремя = ДатаДокумента + " " + Формат(смартЖелаемоеВремяОтгрузки, "ДФ=HH:mm");
		иначе
			ДатаВремя = ДатаДокумента + " " + Формат(ТекущаяДата() + 60 * 60 *2, "ДФ=HH:mm"); //смарт:rnp 14.10.2021 если желаемое время не заполнено, то +2 часа к текущему
		КонецЕсли;
		//--#1631 смарт: Лопато 14.02.2024
					
		аа = ТЗ.Добавить();
		аа.Автомобиль 		= СокрЛП(ВыборкаАвто.ТранспортноеСредство);
		//++ смарт:ММ 706 11.11.2021
		Trip = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаАвто.Номер, Истина, Истина);
		аа.Trip 			= Trip;
		//-- смарт:ММ 11.11.2021
		аа.Avto_Num 		= СокрЛП(ВыборкаАвто.НомерМашины);
		аа.Avto_Num_Trailer = СокрЛП(ВыборкаАвто.смартНомерПрицепа);
		аа.Avto_Model 		= СокрЛП(ВыборкаАвто.Марка);
		//++#1631 смарт: Лопато 14.02.2024 //Формирование пакета документов самовывоз со склада Адмирал  
		//аа.Data 			= Формат(ДокСсылка.Дата, "ДФ=dd.MM.yyyy"); //смарт:rnp 14.10.2021 дату отгрузки на самовывоз берем по дате реализации//Формат(ВыборкаАвто.ЖелаемаяДатаОтгрузки, "ДФ=dd.MM.yyyy");
		аа.Data 			= ДатаДокумента;
		//--#1631 смарт: Лопато 14.02.2024
		аа.Date_Plan 		= ДатаВремя;
		аа.Driver 			= СокрЛП(ВыборкаАвто.ФИОВодителя);
		Если ЗначениеЗаполнено(ВыборкаАвто.смартДатаВыдачиПаспортаВодителя) Тогда
			аа.Driver_Pasport = СокрЛП(ВыборкаАвто.смартНомерСерияПаспортВодителя + " выдан: " + Формат(ВыборкаАвто.смартДатаВыдачиПаспортаВодителя, "ДФ=dd.MM.yyyy"));
		Иначе
			аа.Driver_Pasport = СокрЛП(ВыборкаАвто.смартНомерСерияПаспортВодителя);
		КонецЕсли;
		аа.Driver_Phone = ""; 
		//++ #1228 смарт: Фролов 24.11.2022 //Заказ клиента Раздел Доставка - доработать 
		//++ смарт:rnp 674 13.10.2021 
		//аа.Driver2 = "";
		//аа.Driver2_Pasport = "";
		//аа.Driver2_Phone = "";
		//-- смарт:rnp 13.10.2021  
		аа.Driver2 = СокрЛП(ВыборкаАвто.смартФИОВторогоВодителя);
		Если ЗначениеЗаполнено(ВыборкаАвто.смартДатаВыдачиПаспортаВторогоВодителя) Тогда
			аа.Driver2_Pasport = СокрЛП(ВыборкаАвто.смартНомерСерияПаспортВторогоВодителя + " выдан: " + Формат(ВыборкаАвто.смартДатаВыдачиПаспортаВторогоВодителя, "ДФ=dd.MM.yyyy"));
		Иначе
			аа.Driver2_Pasport = СокрЛП(ВыборкаАвто.смартНомерСерияПаспортВторогоВодителя);
		КонецЕсли;
		аа.Driver2_Phone = "";
		//-- #1228 смарт: Фролов 24.11.2022
		Отбор = Новый Структура();
		Отбор.Вставить("Автомобиль",		аа.Автомобиль);
		//++ смарт:ММ 706 11.11.2021
		Отбор.Вставить("Trip", 				аа.Trip);
		//-- смарт:ММ 11.11.2021
		Отбор.Вставить("Avto_Num",			аа.Avto_Num);
		Отбор.Вставить("Avto_Num_Trailer",	аа.Avto_Num_Trailer);
		Отбор.Вставить("Avto_Model",		аа.Avto_Model);
		Отбор.Вставить("Data",				аа.Data);
		Отбор.Вставить("Date_Plan",			аа.Date_Plan);
		Отбор.Вставить("Driver",			аа.Driver);
		Отбор.Вставить("Driver_Pasport",	аа.Driver_Pasport);
		
		Нашел = СписокАвто.НайтиСтроки(Отбор);
		
		Если Нашел.Количество() = 0 Тогда
			СтрокаСписокАвто = СписокАвто.Добавить();
			СтрокаСписокАвто.Автомобиль			= аа.Автомобиль;
			//++ смарт:ММ 706 11.11.2021
			СтрокаСписокАвто.Trip 				= аа.Trip;
			//-- смарт:ММ 11.11.2021
			СтрокаСписокАвто.Avto_Num			= аа.Avto_Num;
			СтрокаСписокАвто.Avto_Num_Trailer 	= аа.Avto_Num_Trailer;
			СтрокаСписокАвто.Avto_Model			= аа.Avto_Model;
			СтрокаСписокАвто.Data				= аа.Data;
			СтрокаСписокАвто.Date_Plan			= аа.Date_Plan;
			СтрокаСписокАвто.Driver				= аа.Driver;
			СтрокаСписокАвто.Driver_Pasport		= аа.Driver_Pasport;
			СтрокаСписокАвто.Driver_Phone 		= "";
			//++ смарт:rnp 674 13.10.2021 
			СтрокаСписокАвто.Driver2			= аа.Driver2;
			СтрокаСписокАвто.Driver2_Pasport	= аа.Driver2_Pasport;
			СтрокаСписокАвто.Driver2_Phone 		= аа.Driver2_Phone;
			//-- смарт:rnp 13.10.2021
		КонецЕсли;
		
		Серия = ВыборкаАвто.Серия;
		Если ЗначениеЗаполнено(Серия) Тогда
			Если Найти(Серия, "до") > 0 Тогда
				Серия = Сред(Серия, 1, Найти(Серия, "до") - 1);
			КонецЕсли;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаАвто.Характеристика) Тогда
			Серия =  Строка(Серия) + " " + Строка(ВыборкаАвто.Характеристика)
		КонецЕсли;
		Серия = СокрЛП(Серия);
		
		//++ смарт:ММ 663 01.10.2021 
		//Если ВыборкаАвто.Перевозчик = "" Тогда
		//	Перевозчик 	= СокрЛП(ВыборкаАвто.Организация); 
		//Иначе //перевозчик
		//	Перевозчик 	= СокрЛП(ВыборкаАвто.Перевозчик);
		//КонецЕсли;
		Перевозчик = СокрЛП(ВыборкаАвто.Перевозчик);
		//-- смарт:ММ 01.10.2021
		
		аа.Provider 		= Перевозчик;
		аа.Client 			= СокрЛП(ВыборкаАвто.Контрагент);
		аа.Shipment 		= СокрЛП(ВыборкаАвто.Номер);
		аа.Delivery 		= СокрЛП(ВыборкаАвто.ЗаказКлиента);
		аа.Adres 			= СокрЛП(ВыборкаАвто.АдресДоставки);
		аа.Id_Adr 			= "";
		аа.March_num 		= "";
		аа.Delivery_Type 	= "Otgruzka";
		//++ смарт:ММ 667 06.10.2021 
		//аа.Code_Prod 		= СокрЛП(ВыборкаАвто.НоменклатураКод);
		аа.Code_Prod 		= ОбработатьКодНоменклатуры(ВыборкаАвто.НоменклатураКод);
		//-- смарт:ММ 06.10.2021
		//++ смарт:ММ 706 11.11.2021
		//аа.Id_Prod 			= СокрЛП(ВыборкаАвто.НоменклатураАртикул);
		//аа.Name = СокрЛП(Лев(ВыборкаАвто.НоменклатураНаименование,255));
		
		Id_Prod = СтроковыеФункции.СтрокаЛатиницей(СокрЛП(ВыборкаАвто.НоменклатураАртикул));
		аа.Id_Prod 			= Id_Prod;		
		Name = СтрЗаменить(СокрЛП(Лев(ВыборкаАвто.НоменклатураНаименование,255)), """", "");
		аа.Name 			= Name;                        
		//-- смарт:ММ 11.11.2021
		аа.Serial_Number 	= Серия;
		аа.Quan_Pallet	 	= "1";
		аа.Date_partii 		= "";
		аа.Lable 			= СокрЛП(Лев(ВыборкаАвто.НоменклатураОписание,255));
		аа.Quan 			= Формат(ВыборкаАвто.КоличествоУпаковок,"ЧДЦ=3; ЧГ=0");//++смарт: rnp 11.10.2021
		аа.QuanSTUOM 		= СокрЛП(ВыборкаАвто.НоменклатураЕдиницаИзмерения);
		//++ смарт:ММ 636 16.09.2021
		аа.QuanST = "";
		Если ЗначениеЗаполнено(ВыборкаАвто.Характеристика)
			//++смарт: rnp 11.10.2021
			И ВыборкаАвто.ЭтоНоменклатураВПогонныхМетрах  Тогда
			//++смарт:rnp 691 24.10.2021
			//аа.QuanST 			= Формат(ВыборкаАвто.КоличествоУпаковок,"ЧДЦ=3; ЧГ=0");//здесь будут погонные метры
			аа.QuanST = Строка(ВыборкаАвто.Характеристика);
			аа.Serial_Number 	= "";
			//--смарт:rnp 691 24.10.2021
			аа.QuanSTUOM 		= СокрЛП("рул");
			Намотка = Число(ВыборкаАвто.Характеристика);
			аа.Quan 			= Формат(ВыборкаАвто.КоличествоУпаковок/Намотка,"ЧДЦ=3; ЧГ=0");//здесь будет количество рулонов !!! Деление на ноль не обрабатываем, чтобы если возникнет ошибка, сразу сообщили.
			//--смарт: rnp 11.10.2021
		КонецЕсли;
		//аа.QuanST = СокрЛП(QuanST); //смарт: rnp 11.10.2021 закомментировано
		//-- смарт:ММ 16.09.2021
	КонецЦикла;
		
	ПолныйФайл = КаталогВременныхФайлов() + "\" + ИмяФайла;
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПолныйФайл, "windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();    
	ЗаписьXML.ЗаписатьНачалоЭлемента("Delivery_export");
	
	Для каждого Стр Из СписокАвто Цикл
		
		Отбор = Новый Структура();
		
		Отбор.Вставить("Автомобиль",		Стр.Автомобиль);
		//++ смарт:ММ 706 11.11.2021
		Отбор.Вставить("Trip", 				Стр.Trip);
		//-- смарт:ММ 11.11.2021
		Отбор.Вставить("Avto_Num",			Стр.Avto_Num);
		Отбор.Вставить("Avto_Num_Trailer",	Стр.Avto_Num_Trailer);
		Отбор.Вставить("Avto_Model",		Стр.Avto_Model);
		Отбор.Вставить("Data",				Стр.Data);
		Отбор.Вставить("Date_Plan",			Стр.Date_Plan);
		Отбор.Вставить("Driver",			Стр.Driver);
		Отбор.Вставить("Driver_Pasport",	Стр.Driver_Pasport);
		
		Нашел2 = ТЗ.НайтиСтроки(Отбор);
		
		Если Нашел2.Количество() > 0 Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Delivery");
			//++ смарт:ММ 706 11.11.2021
			ЗаписьXML.ЗаписатьАтрибут("Trip", 				Стр.Trip);
			//-- смарт:ММ 11.11.2021
			ЗаписьXML.ЗаписатьАтрибут("Avto_Num", 			Стр.Avto_Num);
			ЗаписьXML.ЗаписатьАтрибут("Avto_Num_Trailer", 	Стр.Avto_Num_Trailer);
			ЗаписьXML.ЗаписатьАтрибут("Avto_Model", 		Стр.Avto_Model);
			ЗаписьXML.ЗаписатьАтрибут("Data", 				Стр.Data);
			ЗаписьXML.ЗаписатьАтрибут("Date_Plan", 			Стр.Date_Plan);
			ЗаписьXML.ЗаписатьАтрибут("Driver", 			Стр.Driver);
			ЗаписьXML.ЗаписатьАтрибут("Driver_Pasport", 	Стр.Driver_Pasport);
			ЗаписьXML.ЗаписатьАтрибут("Driver_Phone", 		Стр.Driver_Phone);
			//++ смарт:rnp 674 13.10.2021 
			ЗаписьXML.ЗаписатьАтрибут("Driver2", 			Стр.Driver2);
			ЗаписьXML.ЗаписатьАтрибут("Driver2_Pasport", 	Стр.Driver2_Pasport);
			ЗаписьXML.ЗаписатьАтрибут("Driver2_Phone", 		Стр.Driver2_Phone);
			//-- смарт:rnp 13.10.2021
			Для каждого Стр2 Из Нашел2 Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("Delivery_detail");
				ЗаписьXML.ЗаписатьАтрибут("Provider", 		Стр2.Provider);
				ЗаписьXML.ЗаписатьАтрибут("Client", 		Стр2.Client);
				ЗаписьXML.ЗаписатьАтрибут("Shipment", 		Стр2.Shipment);
				ЗаписьXML.ЗаписатьАтрибут("Delivery", 		Стр2.Delivery);
				ЗаписьXML.ЗаписатьАтрибут("Adres", 			Стр2.Adres);
				ЗаписьXML.ЗаписатьАтрибут("Id_Adr", 		Стр2.Id_Adr);
				ЗаписьXML.ЗаписатьАтрибут("March_num", 		Стр2.March_num);
				ЗаписьXML.ЗаписатьАтрибут("Delivery_Type", 	Стр2.Delivery_Type);
				ЗаписьXML.ЗаписатьАтрибут("Code_Prod", 		Стр2.Code_Prod);
				ЗаписьXML.ЗаписатьАтрибут("Id_Prod", 		Стр2.Id_Prod);
				ЗаписьXML.ЗаписатьАтрибут("Name", 			Стр2.Name);
				ЗаписьXML.ЗаписатьАтрибут("Serial_Number", 	Стр2.Serial_Number);
				ЗаписьXML.ЗаписатьАтрибут("Quan_Pallet", 	Стр2.Quan_Pallet);
				ЗаписьXML.ЗаписатьАтрибут("Date_partii", 	Стр2.Date_partii);
				ЗаписьXML.ЗаписатьАтрибут("Lable", 			Стр2.Lable);
				ЗаписьXML.ЗаписатьАтрибут("Quan", 			Стр2.Quan);
				ЗаписьXML.ЗаписатьАтрибут("QuanSTUOM", 		Стр2.QuanSTUOM);
				//++ смарт:ММ 636 16.09.2021 
				ЗаписьXML.ЗаписатьАтрибут("QuanST", 		Стр2.QuanST);
				//-- смарт:ММ 16.09.2021
				ЗаписьXML.ЗаписатьКонецЭлемента(); // Delivery_detail
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Delivery
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Delivery_export
	ЗаписьXML.Закрыть();

	Двоичное = Новый ДвоичныеДанные(ПолныйФайл);
	
	Возврат Двоичное;
	//Адрес = ПоместитьВоВременноеХранилище(Двоичное, Новый УникальныйИдентификатор);
	//
	//Возврат Адрес;
	
КонецФункции //-- смарт:ММ 12.09.2021

//++ смарт:ММ 667 06.10.2021 
Функция ОбработатьКодНоменклатуры(знач ИсходныйКод) Экспорт
	
	Результат = "";
	
	ИсходныйКод = СокрЛП(ИсходныйКод);
	
	Кириллица = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЫЪЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщыъьэюя"; 

	ВсеНеДопустимыеСимволы = Новый Соответствие;
	Для Позиция = 1 По СтрДлина(Кириллица) Цикл
		ВсеНеДопустимыеСимволы[Сред(Кириллица, Позиция, 1)] = Истина;
	КонецЦикла;
	
	Для Позиция = 1 По СтрДлина(ИсходныйКод) Цикл
		ТекСимвол = Сред(ИсходныйКод, Позиция, 1);
		Если ВсеНеДопустимыеСимволы[ТекСимвол] = Неопределено Тогда
			Результат = Результат + ТекСимвол;
		КонецЕсли;
	КонецЦикла;
	
	Если Лев(Результат, 1) = "-" Тогда
		Результат = Сред(Результат, 2);
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции //-- смарт:ММ 06.10.2021

//++ #Б5134 смарт: Шляпников 18.12.2025 / Маркировка радиоэлектронной продукции. Доработка справочника "Коды ТН ВЭД". Добавить перечисления Вид маркировки.
Функция ВернутьЗначениеПеречисленияПоСинониму(ИмяПеречисления, ЗначениеСинонимаТекст) Экспорт
	
	ЭлементПеречисления = Неопределено;

	Для каждого ТекЭлемент Из Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления Цикл

		Если ТекЭлемент.Синоним = ЗначениеСинонимаТекст Тогда
			ЭлементПеречисления = Перечисления[ИмяПеречисления][ТекЭлемент.Имя];
			Прервать;
		КонецЕсли;

	КонецЦикла; 

	Возврат ЭлементПеречисления; // возвращаем значение перечисления или Неопределено
	
КонецФункции  

//++ #6654  смарт: Тимофеева 19.05.2026 / Взаиморасчеты. Часть5. Взаимозачет между тремя юр лицами.

Процедура смарт_ОперацияБухПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	ДатаНачалаОбменаЧерезУФ = Справочники.смартПредопределенныеЗначения.ДатаНачалаОбменаДокументамиСУТЧерезУниверсальныйФормат.Значение;
	Если ЗначениеЗаполнено(ДатаНачалаОбменаЧерезУФ)
		И Источник.Дата >= ДатаНачалаОбменаЧерезУФ Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Дата >= Дата("20260101") Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
		ФЗ = ДлительныеОперации.ВыполнитьВФоне("смартОбщегоНазначения.ОтправитьОперациюБух", Новый Структура("Источник", Источник.Ссылка), ПараметрыВыполнения);
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьОперациюБух(Параметры, Адрес) Экспорт
	
	ОбщегоНазначенияБТС.Пауза(5);
	
	ИсточникДанных = Параметры.Источник;
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ВерсияФормата", "1.7");
	
	ТзДополнительнаяРегистрация = Новый ТаблицаЗначений;
	ТзДополнительнаяРегистрация.Колонки.Добавить("ВыборПериода", Новый ОписаниеТипов("Булево"));
	ТзДополнительнаяРегистрация.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТзДополнительнаяРегистрация.Колонки.Добавить("Отбор");
	ТзДополнительнаяРегистрация.Колонки.Добавить("ОтборСтрокой", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТзДополнительнаяРегистрация.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТзДополнительнаяРегистрация.Колонки.Добавить("ПолноеИмяМетаданных", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТзДополнительнаяРегистрация.Колонки.Добавить("Представление", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	ПользовательскиеОтборы = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
	ЭлементОтбора = ПользовательскиеОтборы.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ИсточникДанных;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.Применение = ТипПримененияОтбораКомпоновкиДанных.Элементы;
	
	СтандартПериод = Новый СтандартныйПериод;
	СтандартПериод.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	НоваяСтрокаТЗрегистрации = ТзДополнительнаяРегистрация.Добавить();
	НоваяСтрокаТЗрегистрации.ВыборПериода = Ложь;
	НоваяСтрокаТЗрегистрации.Количество = "";
	НоваяСтрокаТЗрегистрации.Отбор = ПользовательскиеОтборы;
	НоваяСтрокаТЗрегистрации.ОтборСтрокой = Строка(ПользовательскиеОтборы);
	НоваяСтрокаТЗрегистрации.Период = СтандартПериод;
	НоваяСтрокаТЗрегистрации.ПолноеИмяМетаданных = "Документ.Операциябух";
	НоваяСтрокаТЗрегистрации.Представление = "Операциябух";
	
	СтруктураПараметров.Вставить("МестоВыгрузки", 1);
	СтруктураПараметров.Вставить("ПериодОтбораВсехДокументов", СтандартПериод);
	СтруктураПараметров.Вставить("ПутьКМенеджеруОбменаВыгрузки", "");
	СтруктураПараметров.Вставить("УзелОбмена", Неопределено);
	СтруктураПараметров.Вставить("ЭтоФоновоеЗадание", Истина);
	СтруктураПараметров.Вставить("ДополнительнаяРегистрация", ТзДополнительнаяРегистрация);
	
	Обработка = Обработки.ВыгрузкаЗагрузкаEnterpriseData.Создать();
	РезультатВыгрузки = Обработка.РезультатВыгрузкиВXML(СтруктураПараметров);
	XMLответ = ПолучитьИзВременногоХранилища(РезультатВыгрузки);
	
	ДобавитьДанныеДляОтправкиВУТ(XMLответ, "/hs/smartaddocum/add/offset", ИсточникДанных);
	
КонецПроцедуры

Процедура смартСинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ДатаНачалаОбменаЧерезУФ = Справочники.смартПредопределенныеЗначения.ДатаНачалаОбменаДокументамиСУТЧерезУниверсальныйФормат.Значение;
	Если НЕ ЗначениеЗаполнено(ДатаНачалаОбменаЧерезУФ)
		ИЛИ Источник.Дата < ДатаНачалаОбменаЧерезУФ Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроведениеСервер.ГрупповоеПерепроведение(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("СинхронизацияДанныхЧерезУниверсальныйФормат", Источник, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

//-- #6654  смарт: Тимофеева 19.05.2026