#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		АдресФайла = ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("Объект").Правила, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
		ТекущийОбъект.Правила = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла), Новый СжатиеДанных(9));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ЗагрузитьПравилаИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьПравилаИзФайлаЗавершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПравилаИзФайлаЗавершение(Значение, ДопПараметры) Экспорт
	
	Если НЕ Значение = Неопределено Тогда
		
		Данные = Новый Двоичныеданные(Значение[0]);
		АдресФайла = ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
		
		Файл = Новый Файл(Значение[0]);
		Объект.ИмяФайла = Файл.Имя;
		Объект.ДатаЗагрузки = ТекущаяДата();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПравилаВФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Показать(Новый ОписаниеОповещения("ВыгрузитьПравилаВФайлЗавершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПравилаВФайлЗавершение(Значение, ДопПараметры) Экспорт
	
	Если НЕ Значение = Неопределено Тогда
		
		Данные = ПолучитьИзВременногоХранилища(АдресФайла);
		Данные.Записать(Значение[0]);
		
		Сообщить(СтрШаблон("Правила сохранены в файл %1", Значение[0]));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти