#Область ПеренесеноСдоработками

&ИзменениеИКонтроль("ТекстЗапросаДанныеДляПечатиКорректировочныхСчетовФактур")
Функция смарт_ТекстЗапросаДанныеДляПечатиКорректировочныхСчетовФактур(НомераТаблиц, ПередачаТоваровВСоставеРабот)

	НомераТаблиц.Вставить("ВалютаРегламентированногоУчета",           НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаРеквизиты",                НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты",                                НомераТаблиц.Количество());
		
	Если Не ПередачаТоваровВСоставеРабот Тогда 
		НомераТаблиц.Вставить("ВТ_РублевыеСуммыДокументовВВалюте",        НомераТаблиц.Количество()); 
		НомераТаблиц.Вставить("СтраныПроисхожденияПоУслугам",             НомераТаблиц.Количество());
		НомераТаблиц.Вставить("СтраныПроисхожденияПоУслугамСводно",       НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВременнаяТаблицаНоменклатуры",             НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВременнаяТаблицаДокумента",                НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ШтрихкодыУпаковок",                        НомераТаблиц.Количество());
	Иначе
		НомераТаблиц.Вставить("ВременнаяТаблицаДокумента",                НомераТаблиц.Количество());
	КонецЕсли;
	
	НомераТаблиц.Вставить("СведенияОПрослеживаемостиПредварительная", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СведенияОПрослеживаемости",                НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КонстантаВалютаРегламентированногоУчета.Значение КАК ВалютаРеглУчета
	|ПОМЕСТИТЬ КонстантаВалютаРегламентированногоУчета
	|ИЗ
	|	Константа.ВалютаРегламентированногоУчета КАК КонстантаВалютаРегламентированногоУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	Реквизиты.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА КонстантаВалютаРегламентированногоУчета.ВалютаРеглУчета <> Реквизиты.ВалютаДокумента
	|				И Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|			ТОГДА КонстантаВалютаРегламентированногоУчета.ВалютаРеглУчета
	|		ИНАЧЕ Реквизиты.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаДокумента,
	|	Реквизиты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА КонстантаВалютаРегламентированногоУчета.ВалютаРеглУчета <> Реквизиты.ВалютаДокумента
	|				И Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК БратьСуммыИзРегистраРублевыеСуммы,
	|	ВЫБОР
	|		КОГДА Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Исправление,
	|	Реквизиты.ОтветственныйЗаОформление КАК ОтветственныйЗаОформление,
	|	Реквизиты.СопроводительныеДокументы КАК СопроводительныеДокументы,
	|	Реквизиты.БанковскийСчетОрганизации КАК БанковскийСчетПродавца
	|ПОМЕСТИТЬ ВременнаяТаблицаРеквизиты
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонстантаВалютаРегламентированногоУчета КАК КонстантаВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ПодразделениеОрганизации КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|						ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|					ИНАЧЕ Реквизиты.Организация
	|				КОНЕЦ
	|		КОГДА &ПредставлениеПоставщика <> """"
	|			ТОГДА &ПредставлениеПоставщика
	|		КОГДА СчетФактураВыданный.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И СчетФактураВыданный.Продавец <> СчетФактураВыданный.Контрагент
	|			ТОГДА ВЫБОР
	|					КОГДА СчетФактураВыданный.Продавец.ОбособленноеПодразделение
	|							И СчетФактураВыданный.Продавец.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|						ТОГДА СчетФактураВыданный.Продавец.ГоловнойКонтрагент
	|					ИНАЧЕ СчетФактураВыданный.Продавец
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|				ИНАЧЕ Реквизиты.Организация
	|			КОНЕЦ
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА &АдресПоставщика <> """"
	|			ТОГДА &АдресПоставщика
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресПоставщика,
	|	ВЫБОР
	|		КОГДА &ИННКПППоставщика <> """"
	|			ТОГДА &ИННКПППоставщика
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИННКПППоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|						ТОГДА Реквизиты.Организация.ГоловнаяОрганизация.ИНН
	|					ИНАЧЕ Реквизиты.Организация.ИНН
	|				КОНЕЦ
	|		КОГДА СчетФактураВыданный.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И СчетФактураВыданный.Продавец <> СчетФактураВыданный.Контрагент
	|			ТОГДА СчетФактураВыданный.Продавец.ИНН
	|		ИНАЧЕ Реквизиты.Организация.ИНН
	|	КОНЕЦ КАК ИННПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|						ТОГДА Реквизиты.ПодразделениеОрганизации
	|					ИНАЧЕ Реквизиты.Организация
	|				КОНЕЦ
	|		КОГДА СчетФактураВыданный.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И СчетФактураВыданный.Продавец <> СчетФактураВыданный.Контрагент
	|			ТОГДА СчетФактураВыданный.Продавец
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.Контрагент.ИНН КАК ИННпокупателя,
	|	Реквизиты.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ДоговорКонтрагента.Представление КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ОтветственныйЗаОформление КАК ОтветственныйЗаОформление,
	|	Реквизиты.СопроводительныеДокументы КАК СопроводительныеДокументы,
	|	Реквизиты.БанковскийСчетПродавца КАК БанковскийСчетПродавца
	|ИЗ
	|	ВременнаяТаблицаРеквизиты КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО Реквизиты.Ссылка = СчетФактураВыданный.ДокументОснование
	|			И (НЕ СчетФактураВыданный.ПометкаУдаления)"  + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Если Не ПередачаТоваровВСоставеРабот Тогда
		ТекстЗапроса = Текстзапроса + "ВЫБРАТЬ
		|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор КАК Регистратор,
		|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	ВЫБОР
		|		КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ТоварыДоИзменения)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
		|		КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.УслугиДоИзменения)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги)
		|		КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.АгентскиеУслугиДоИзменения)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.АгентскиеУслуги)
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента
		|	КОНЕЦ КАК ТабличнаяЧастьДокумента,
		|	СУММА(ВЫБОР
		|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего > 0
		|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоРуб,
		|	СУММА(ВЫБОР
		|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС > 0
		|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаБезНДСРуб,
		|	СУММА(ВЫБОР
		|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС > 0
		|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДСРуб,
		|	СУММА(ВЫБОР
		|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего < 0
		|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего
		|			ИНАЧЕ 0
		|		КОНЕЦ) * -1 КАК ВсегоРубДоИзменения,
		|	СУММА(ВЫБОР
		|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС < 0
		|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) * -1 КАК СуммаБезНДСРубДоИзменения,
		|	СУММА(ВЫБОР
		|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС < 0
		|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) * -1 КАК НДСРубДоИзменения
		|ПОМЕСТИТЬ РегистрСведенийРублевыеСуммыДокументовВВалюте
		|ИЗ
		|	РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
		|ГДЕ
		|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор = &ДокументОснование
		|	И РегистрСведенийРублевыеСуммыДокументовВВалюте.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор,
		|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента,
		|	ВЫБОР
		|		КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ТоварыДоИзменения)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары)
		|		КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.УслугиДоИзменения)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги)
		|		КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.АгентскиеУслугиДоИзменения)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.АгентскиеУслуги)
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор,
		|	НомерСтрокиДокумента,
		|	ТабличнаяЧастьДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КорректировкаРеализацииУслуги.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СтраныМира.НаименованиеПолное КАК НаименованиеПолное,
		|	КорректировкаРеализацииСведенияПрослеживаемости.СтранаПроисхождения КАК СтранаПроисхождения,
		|	"""" КАК СтранаПроисхожденияДоИзменения
		|ПОМЕСТИТЬ СтраныПроисхожденияПоУслугам
		|ИЗ
		|	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.СведенияПрослеживаемости КАК КорректировкаРеализацииСведенияПрослеживаемости
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
		|			ПО КорректировкаРеализацииСведенияПрослеживаемости.СтранаПроисхождения = СтраныМира.Ссылка
		|		ПО КорректировкаРеализацииУслуги.ИдентификаторСтроки = КорректировкаРеализацииСведенияПрослеживаемости.ИдентификаторСтроки
		|ГДЕ
		|	КорректировкаРеализацииСведенияПрослеживаемости.Ссылка = &ДокументОснование
		|	И КорректировкаРеализацииУслуги.Ссылка = &ДокументОснование
		|	И КорректировкаРеализацииСведенияПрослеживаемости.ЭтоСтрокаСИсходнымиРНПТ = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаРеализацииСведенияПрослеживаемости.ИдентификаторСтроки,
		|	"""",
		|	"""",
		|	КорректировкаРеализацииСведенияПрослеживаемости.СтранаПроисхождения
		|ИЗ
		|	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.СведенияПрослеживаемости КАК КорректировкаРеализацииСведенияПрослеживаемости
		|		ПО КорректировкаРеализацииУслуги.ИдентификаторСтроки = КорректировкаРеализацииСведенияПрослеживаемости.ИдентификаторСтроки
		|ГДЕ
		|	КорректировкаРеализацииСведенияПрослеживаемости.Ссылка = &ДокументОснование
		|	И КорректировкаРеализацииСведенияПрослеживаемости.ЭтоСтрокаСИсходнымиРНПТ = ИСТИНА
		|	И КорректировкаРеализацииУслуги.Ссылка = &ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтраныПроисхожденияПоУслугам.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	МАКСИМУМ(СтраныПроисхожденияПоУслугам.НаименованиеПолное) КАК НаименованиеПолное,
		|	МАКСИМУМ(СтраныПроисхожденияПоУслугам.СтранаПроисхождения) КАК СтранаПроисхождения,
		|	МАКСИМУМ(СтраныПроисхожденияПоУслугам.СтранаПроисхожденияДоИзменения) КАК СтранаПроисхожденияДоИзменения,
		|	ИСТИНА КАК ПрослеживаемыйТовар
		|ПОМЕСТИТЬ СтраныПроисхожденияПоУслугамСводно
		|ИЗ
		|	СтраныПроисхожденияПоУслугам КАК СтраныПроисхожденияПоУслугам
		|
		|СГРУППИРОВАТЬ ПО
		|	СтраныПроисхожденияПоУслугам.ИдентификаторСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Ссылка КАК Ссылка,
		|	1 КАК НомерТабЧасти,
		|	ТаблицаНоменклатуры.НомерСтроки КАК НомерСтроки,
		|	ТаблицаНоменклатуры.Номенклатура КАК Товар,
		|	ТаблицаНоменклатуры.Номенклатура.Код КАК ТоварКод,
		|	ТаблицаНоменклатуры.Номенклатура.Артикул КАК ТоварАртикул,
		|	ТаблицаНоменклатуры.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
		|	ТаблицаНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ТаблицаНоменклатуры.СтранаПроисхождения.НаименованиеПолное КАК ПредставлениеСтраны,
		|	ТаблицаНоменклатуры.НомерГТД КАК НомерГТД,
		|	ТаблицаНоменклатуры.НомерГТД.Представление КАК ПредставлениеГТД,
		|   ЕСТЬNULL(СправочникУпаковка.ЕдиницаИзмерения, СправочникНоменклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|	ТаблицаНоменклатуры.СтавкаНДС КАК СтавкаНДС,
		|	ЛОЖЬ КАК ЭтоУслуга,
		|	ВЫБОР
		|		КОГДА Реквизиты.Исправление
		|			ТОГДА ТаблицаНоменклатуры.КоличествоДоКорректировки
		|		ИНАЧЕ ТаблицаНоменклатуры.КоличествоДоИзменения
		|	КОНЕЦ КАК КоличествоДоИзменения,
		|	ТаблицаНоменклатуры.Количество КАК КоличествоПослеИзменения,
		|	ВЫБОР
		|		КОГДА Реквизиты.Исправление
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|						ТОГДА ВЫБОР
		|								КОГДА Реквизиты.СуммаВключаетНДС
		|									ТОГДА ВЫБОР
		|											КОГДА ТаблицаНоменклатуры.КоличествоДоКорректировки = 0
		|													ИЛИ ТаблицаНоменклатуры.СуммаНДСДоКорректировки = 0
		|												ТОГДА ТаблицаНоменклатуры.ЦенаДоКорректировки
		|											ИНАЧЕ ВЫРАЗИТЬ((ТаблицаНоменклатуры.СуммаДоКорректировки - ТаблицаНоменклатуры.СуммаНДСДоКорректировки) / ТаблицаНоменклатуры.КоличествоДоКорректировки КАК ЧИСЛО(15, 2))
		|										КОНЕЦ
		|								ИНАЧЕ ТаблицаНоменклатуры.ЦенаДоКорректировки
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ТаблицаНоменклатуры.КоличествоДоКорректировки = 0
		|								ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|							ИНАЧЕ ВЫРАЗИТЬ((РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения) / ТаблицаНоменклатуры.КоличествоДоКорректировки КАК ЧИСЛО(15, 2))
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|					ТОГДА ВЫБОР
		|							КОГДА Реквизиты.СуммаВключаетНДС
		|								ТОГДА ВЫБОР
		|										КОГДА ТаблицаНоменклатуры.КоличествоДоИзменения = 0
		|												ИЛИ ТаблицаНоменклатуры.СуммаНДСДоИзменения = 0
		|											ТОГДА ТаблицаНоменклатуры.ЦенаДоИзменения
		|										ИНАЧЕ ВЫРАЗИТЬ((ТаблицаНоменклатуры.СуммаДоИзменения - ТаблицаНоменклатуры.СуммаНДСДоИзменения) / ТаблицаНоменклатуры.КоличествоДоИзменения КАК ЧИСЛО(15, 2))
		|									КОНЕЦ
		|							ИНАЧЕ ТаблицаНоменклатуры.ЦенаДоИзменения
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ТаблицаНоменклатуры.КоличествоДоИзменения = 0
		|							ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|						ИНАЧЕ ВЫРАЗИТЬ((РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения) / ТаблицаНоменклатуры.КоличествоДоИзменения КАК ЧИСЛО(15, 2))
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаДоИзменения,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.СуммаВключаетНДС
		|						ТОГДА ВЫБОР
		|								КОГДА ТаблицаНоменклатуры.Количество = 0
		|										ИЛИ ТаблицаНоменклатуры.СуммаНДС = 0
		|									ТОГДА ТаблицаНоменклатуры.Цена
		|								ИНАЧЕ ВЫРАЗИТЬ((ТаблицаНоменклатуры.Сумма - ТаблицаНоменклатуры.СуммаНДС) / ТаблицаНоменклатуры.Количество КАК ЧИСЛО(15, 2))
		|							КОНЕЦ
		|					ИНАЧЕ ТаблицаНоменклатуры.Цена
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ТаблицаНоменклатуры.Количество <> 0
		|					ТОГДА ВЫРАЗИТЬ((РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРуб - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРуб) / ТаблицаНоменклатуры.Количество КАК ЧИСЛО(15, 2))
		|				КОГДА ТаблицаНоменклатуры.КоличествоДоКорректировки <> 0
		|					ТОГДА ВЫРАЗИТЬ((РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения) / ТаблицаНоменклатуры.КоличествоДоКорректировки КАК ЧИСЛО(15, 2))
		|				ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаПослеИзменения,
		|	ВЫБОР
		|		КОГДА Реквизиты.Исправление
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|						ТОГДА ТаблицаНоменклатуры.СуммаНДСДоКорректировки
		|					ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|					ТОГДА ТаблицаНоменклатуры.СуммаНДСДоИзменения
		|				ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|			КОНЕЦ
		|	КОНЕЦ КАК СуммаНДСДоИзменения,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ТаблицаНоменклатуры.СуммаНДС
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРуб
		|	КОНЕЦ КАК СуммаНДСПослеИзменения,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.Исправление
		|						ТОГДА ВЫБОР
		|								КОГДА Реквизиты.СуммаВключаетНДС
		|									ТОГДА ТаблицаНоменклатуры.СуммаДоКорректировки - ТаблицаНоменклатуры.СуммаНДСДоКорректировки
		|								ИНАЧЕ ТаблицаНоменклатуры.СуммаДоКорректировки
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Реквизиты.СуммаВключаетНДС
		|								ТОГДА ТаблицаНоменклатуры.СуммаДоИзменения - ТаблицаНоменклатуры.СуммаНДСДоИзменения
		|							ИНАЧЕ ТаблицаНоменклатуры.СуммаДоИзменения
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаБезНДСРубДоИзменения
		|	КОНЕЦ КАК СтоимостьБезНДСДоИзменения,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.СуммаВключаетНДС
		|						ТОГДА ТаблицаНоменклатуры.Сумма - ТаблицаНоменклатуры.СуммаНДС
		|					ИНАЧЕ ТаблицаНоменклатуры.Сумма
		|				КОНЕЦ
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаБезНДСРуб
		|	КОНЕЦ КАК СтоимостьБезНДСПослеИзменения,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.Исправление
		|						ТОГДА ВЫБОР
		|								КОГДА Реквизиты.СуммаВключаетНДС
		|									ТОГДА ТаблицаНоменклатуры.СуммаДоКорректировки
		|								ИНАЧЕ ТаблицаНоменклатуры.СуммаДоКорректировки + ТаблицаНоменклатуры.СуммаНДСДоКорректировки
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Реквизиты.СуммаВключаетНДС
		|								ТОГДА ТаблицаНоменклатуры.СуммаДоИзменения
		|							ИНАЧЕ ТаблицаНоменклатуры.СуммаДоИзменения + ТаблицаНоменклатуры.СуммаНДСДоИзменения
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения
		|	КОНЕЦ КАК СтоимостьСНДСДоИзменения,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.СуммаВключаетНДС
		|						ТОГДА ТаблицаНоменклатуры.Сумма
		|					ИНАЧЕ ТаблицаНоменклатуры.Сумма + ТаблицаНоменклатуры.СуммаНДС
		|				КОНЕЦ
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРуб
		|	КОНЕЦ КАК СтоимостьСНДСПослеИзменения,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		|			ТОГДА ТаблицаНоменклатуры.КодТНВЭД
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		|	КОНЕЦ КАК ТоварыКодТНВЭД,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		|			ТОГДА ВЫБОР
		|					КОГДА ТаблицаНоменклатуры.КодТНВЭДДоИзменения = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		|						ТОГДА ТаблицаНоменклатуры.КодТНВЭД
		|					ИНАЧЕ ТаблицаНоменклатуры.КодТНВЭДДоИзменения
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		|	КОНЕЦ КАК ТоварыКодТНВЭДДоИзменения,
		|	ТаблицаНоменклатуры.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.Номенклатура ССЫЛКА Справочник.Номенклатура
		|			ТОГДА ВЫРАЗИТЬ(ТаблицаНоменклатуры.Номенклатура КАК Справочник.Номенклатура).КодТНВЭД
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НоменклатураКодТНВЭД,
		|	ТаблицаНоменклатуры.СтранаПроисхожденияДоИзменения КАК СтранаПроисхожденияДоИзменения,
		#Удаление
		|	ТаблицаНоменклатуры.НомерГТДДоИзменения.РегистрационныйНомер КАК РегистрационныйНомерТДДо,
		|	ТаблицаНоменклатуры.НомерГТД.РегистрационныйНомер КАК РегистрационныйНомерТДПосле,
		#КонецУдаления
		#Вставка
		//++ #Б3620 смарт: Шляпников 26.06.2025 / Номер в ГТД в печатной форме УПД и в БП и в УТ
		|	ТаблицаНоменклатуры.НомерГТДДоИзменения КАК РегистрационныйНомерТДДо,
		|	ТаблицаНоменклатуры.НомерГТД КАК РегистрационныйНомерТДПосле,
		//-- #Б3620 смарт: Шляпников 26.06.2025
		#КонецВставки
		|	ТаблицаНоменклатуры.ИдентификаторСтрокиГосконтрактаЕИС КАК ИдентификаторСтрокиГосконтрактаЕИС,
		|	ТаблицаНоменклатуры.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
		|	ВЫБОР
		|		КОГДА Реквизиты.Исправление
		|			ТОГДА ТаблицаНоменклатуры.СуммаАкцизаДоКорректировки
		|		ИНАЧЕ ТаблицаНоменклатуры.СуммаАкцизаДоИзменения
		|	КОНЕЦ КАК СуммаАкцизаДоИзменения,
		|	ТаблицаНоменклатуры.СуммаАкциза КАК СуммаАкцизаПослеИзменения,
		|	ЕСТЬNULL(СправочникУпаковка.Коэффициент, 1) КАК КоэффициентУпаковки
		|ПОМЕСТИТЬ ТаблицаНоменклатуры
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК ТаблицаНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеквизиты КАК Реквизиты
		|		ПО (Реквизиты.Ссылка = ТаблицаНоменклатуры.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
		|		ПО ТаблицаНоменклатуры.Ссылка = РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор
		|			И ТаблицаНоменклатуры.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
		|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныечастиДокументов.Товары))
		|			И (ТаблицаНоменклатуры.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ТаблицаНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК СправочникУпаковка
		|		ПО ТаблицаНоменклатуры.Упаковка = СправочникУпаковка.ССылка
		|			И (СправочникУпаковка.Коэффициент > 0)
		|ГДЕ
		|	ТаблицаНоменклатуры.Ссылка = &ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Ссылка,
		|	2,
		|	ТаблицаНоменклатуры.НомерСтроки,
		|	ТаблицаНоменклатуры.Номенклатура,
		|	ТаблицаНоменклатуры.Номенклатура.Код,
		|	ТаблицаНоменклатуры.Номенклатура.Артикул,
		|	ТаблицаНоменклатуры.Содержание,
		|	ЕСТЬNULL(СтраныПроисхожденияПоУслугамСводно.СтранаПроисхождения, """"),
		|	ЕСТЬNULL(СтраныПроисхожденияПоУслугамСводно.НаименованиеПолное, """"),
		|	"""",
		|	"""",
		|	ВЫРАЗИТЬ(ТаблицаНоменклатуры.Номенклатура КАК Справочник.Номенклатура).ЕдиницаИзмерения,
		|	ТаблицаНоменклатуры.СтавкаНДС,
		|	ИСТИНА,
		|	ВЫБОР
		|		КОГДА Реквизиты.Исправление
		|			ТОГДА ТаблицаНоменклатуры.КоличествоДоКорректировки
		|		ИНАЧЕ ТаблицаНоменклатуры.КоличествоДоИзменения
		|	КОНЕЦ,
		|	ТаблицаНоменклатуры.Количество,
		|	ВЫБОР
		|		КОГДА Реквизиты.Исправление
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|						ТОГДА ВЫБОР
		|								КОГДА Реквизиты.СуммаВключаетНДС
		|									ТОГДА ВЫБОР
		|											КОГДА ТаблицаНоменклатуры.КоличествоДоКорректировки = 0
		|													ИЛИ ТаблицаНоменклатуры.СуммаНДСДоКорректировки = 0
		|												ТОГДА ТаблицаНоменклатуры.ЦенаДоКорректировки
		|											ИНАЧЕ ВЫРАЗИТЬ((ТаблицаНоменклатуры.СуммаДоКорректировки - ТаблицаНоменклатуры.СуммаНДСДоКорректировки) / ТаблицаНоменклатуры.КоличествоДоКорректировки КАК ЧИСЛО(15, 2))
		|										КОНЕЦ
		|								ИНАЧЕ ТаблицаНоменклатуры.ЦенаДоКорректировки
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ТаблицаНоменклатуры.КоличествоДоКорректировки = 0
		|								ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|							ИНАЧЕ ВЫРАЗИТЬ((РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения) / ТаблицаНоменклатуры.КоличествоДоКорректировки КАК ЧИСЛО(15, 2))
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|					ТОГДА ВЫБОР
		|							КОГДА Реквизиты.СуммаВключаетНДС
		|								ТОГДА ВЫБОР
		|										КОГДА ТаблицаНоменклатуры.КоличествоДоИзменения = 0
		|												ИЛИ ТаблицаНоменклатуры.СуммаНДСДоИзменения = 0
		|											ТОГДА ТаблицаНоменклатуры.ЦенаДоИзменения
		|										ИНАЧЕ ВЫРАЗИТЬ((ТаблицаНоменклатуры.СуммаДоИзменения - ТаблицаНоменклатуры.СуммаНДСДоИзменения) / ТаблицаНоменклатуры.КоличествоДоИзменения КАК ЧИСЛО(15, 2))
		|									КОНЕЦ
		|							ИНАЧЕ ТаблицаНоменклатуры.ЦенаДоИзменения
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ТаблицаНоменклатуры.КоличествоДоИзменения = 0
		|							ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|						ИНАЧЕ ВЫРАЗИТЬ((РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения) / ТаблицаНоменклатуры.КоличествоДоИзменения КАК ЧИСЛО(15, 2))
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.СуммаВключаетНДС
		|						ТОГДА ВЫБОР
		|								КОГДА ТаблицаНоменклатуры.Количество = 0
		|										ИЛИ ТаблицаНоменклатуры.СуммаНДС = 0
		|									ТОГДА ТаблицаНоменклатуры.Цена
		|								ИНАЧЕ ВЫРАЗИТЬ((ТаблицаНоменклатуры.Сумма - ТаблицаНоменклатуры.СуммаНДС) / ТаблицаНоменклатуры.Количество КАК ЧИСЛО(15, 2))
		|							КОНЕЦ
		|					ИНАЧЕ ТаблицаНоменклатуры.Цена
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ТаблицаНоменклатуры.Количество <> 0
		|					ТОГДА ВЫРАЗИТЬ((РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРуб - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРуб) / ТаблицаНоменклатуры.Количество КАК ЧИСЛО(15, 2))
		|				КОГДА ТаблицаНоменклатуры.КоличествоДоКорректировки <> 0
		|					ТОГДА ВЫРАЗИТЬ((РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения) / ТаблицаНоменклатуры.КоличествоДоКорректировки КАК ЧИСЛО(15, 2))
		|				ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Реквизиты.Исправление
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|						ТОГДА ТаблицаНоменклатуры.СуммаНДСДоКорректировки
		|					ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|					ТОГДА ТаблицаНоменклатуры.СуммаНДСДоИзменения
		|				ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ТаблицаНоменклатуры.СуммаНДС
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРуб
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.Исправление
		|						ТОГДА ВЫБОР
		|								КОГДА Реквизиты.СуммаВключаетНДС
		|									ТОГДА ТаблицаНоменклатуры.СуммаДоКорректировки - ТаблицаНоменклатуры.СуммаНДСДоКорректировки
		|								ИНАЧЕ ТаблицаНоменклатуры.СуммаДоКорректировки
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Реквизиты.СуммаВключаетНДС
		|								ТОГДА ТаблицаНоменклатуры.СуммаДоИзменения - ТаблицаНоменклатуры.СуммаНДСДоИзменения
		|							ИНАЧЕ ТаблицаНоменклатуры.СуммаДоИзменения
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаБезНДСРубДоИзменения
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.СуммаВключаетНДС
		|						ТОГДА ТаблицаНоменклатуры.Сумма - ТаблицаНоменклатуры.СуммаНДС
		|					ИНАЧЕ ТаблицаНоменклатуры.Сумма
		|				КОНЕЦ
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаБезНДСРуб
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.Исправление
		|						ТОГДА ВЫБОР
		|								КОГДА Реквизиты.СуммаВключаетНДС
		|									ТОГДА ТаблицаНоменклатуры.СуммаДоКорректировки
		|								ИНАЧЕ ТаблицаНоменклатуры.СуммаДоКорректировки + ТаблицаНоменклатуры.СуммаНДСДоКорректировки
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Реквизиты.СуммаВключаетНДС
		|								ТОГДА ТаблицаНоменклатуры.СуммаДоИзменения
		|							ИНАЧЕ ТаблицаНоменклатуры.СуммаДоИзменения + ТаблицаНоменклатуры.СуммаНДСДоИзменения
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.СуммаВключаетНДС
		|						ТОГДА ТаблицаНоменклатуры.Сумма
		|					ИНАЧЕ ТаблицаНоменклатуры.Сумма + ТаблицаНоменклатуры.СуммаНДС
		|				КОНЕЦ
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРуб
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
		|	ТаблицаНоменклатуры.ИдентификаторСтроки,
		|	НЕОПРЕДЕЛЕНО,
		|	ЕСТЬNULL(СтраныПроисхожденияПоУслугамСводно.СтранаПроисхожденияДоИзменения, """"),
		|	"""",
		|	"""",
		|	ТаблицаНоменклатуры.ИдентификаторСтрокиГосконтрактаЕИС,
		|	ЕСТЬNULL(СтраныПроисхожденияПоУслугамСводно.ПрослеживаемыйТовар, ЛОЖЬ),
		|	0,
		|	0,
		|	1
		|ИЗ
		|	Документ.КорректировкаРеализации.Услуги КАК ТаблицаНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеквизиты КАК Реквизиты
		|		ПО (Реквизиты.Ссылка = ТаблицаНоменклатуры.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
		|		ПО ТаблицаНоменклатуры.Ссылка = РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор
		|			И ТаблицаНоменклатуры.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
		|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныечастиДокументов.Услуги))
		|			И (ТаблицаНоменклатуры.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтраныПроисхожденияПоУслугамСводно КАК СтраныПроисхожденияПоУслугамСводно
		|		ПО ТаблицаНоменклатуры.ИдентификаторСтроки = СтраныПроисхожденияПоУслугамСводно.ИдентификаторСтроки
		|ГДЕ
		|	ТаблицаНоменклатуры.Ссылка = &ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Ссылка,
		|	3,
		|	ТаблицаНоменклатуры.НомерСтроки,
		|	ТаблицаНоменклатуры.Номенклатура,
		|	ТаблицаНоменклатуры.Номенклатура.Код,
		|	ТаблицаНоменклатуры.Номенклатура.Артикул,
		|	ТаблицаНоменклатуры.Содержание,
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	ВЫРАЗИТЬ(ТаблицаНоменклатуры.Номенклатура КАК Справочник.Номенклатура).ЕдиницаИзмерения,
		|	ТаблицаНоменклатуры.СтавкаНДС,
		|	ИСТИНА,
		|	ВЫБОР
		|		КОГДА Реквизиты.Исправление
		|			ТОГДА ТаблицаНоменклатуры.КоличествоДоКорректировки
		|		ИНАЧЕ ТаблицаНоменклатуры.КоличествоДоИзменения
		|	КОНЕЦ,
		|	ТаблицаНоменклатуры.Количество,
		|	ВЫБОР
		|		КОГДА Реквизиты.Исправление
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|						ТОГДА ВЫБОР
		|								КОГДА Реквизиты.СуммаВключаетНДС
		|									ТОГДА ВЫБОР
		|											КОГДА ТаблицаНоменклатуры.КоличествоДоКорректировки = 0
		|													ИЛИ ТаблицаНоменклатуры.СуммаНДСДоКорректировки = 0
		|												ТОГДА ТаблицаНоменклатуры.ЦенаДоКорректировки
		|											ИНАЧЕ ВЫРАЗИТЬ((ТаблицаНоменклатуры.СуммаДоКорректировки - ТаблицаНоменклатуры.СуммаНДСДоКорректировки) / ТаблицаНоменклатуры.КоличествоДоКорректировки КАК ЧИСЛО(15, 2))
		|										КОНЕЦ
		|								ИНАЧЕ ТаблицаНоменклатуры.ЦенаДоКорректировки
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ТаблицаНоменклатуры.КоличествоДоКорректировки = 0
		|								ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|							ИНАЧЕ ВЫРАЗИТЬ((РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения) / ТаблицаНоменклатуры.КоличествоДоКорректировки КАК ЧИСЛО(15, 2))
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|					ТОГДА ВЫБОР
		|							КОГДА Реквизиты.СуммаВключаетНДС
		|								ТОГДА ВЫБОР
		|										КОГДА ТаблицаНоменклатуры.КоличествоДоИзменения = 0
		|												ИЛИ ТаблицаНоменклатуры.СуммаНДСДоИзменения = 0
		|											ТОГДА ТаблицаНоменклатуры.ЦенаДоИзменения
		|										ИНАЧЕ ВЫРАЗИТЬ((ТаблицаНоменклатуры.СуммаДоИзменения - ТаблицаНоменклатуры.СуммаНДСДоИзменения) / ТаблицаНоменклатуры.КоличествоДоИзменения КАК ЧИСЛО(15, 2))
		|									КОНЕЦ
		|							ИНАЧЕ ТаблицаНоменклатуры.ЦенаДоИзменения
		|						КОНЕЦ
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ТаблицаНоменклатуры.КоличествоДоИзменения = 0
		|							ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|						ИНАЧЕ ВЫРАЗИТЬ((РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения) / ТаблицаНоменклатуры.КоличествоДоИзменения КАК ЧИСЛО(15, 2))
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.СуммаВключаетНДС
		|						ТОГДА ВЫБОР
		|								КОГДА ТаблицаНоменклатуры.Количество = 0
		|										ИЛИ ТаблицаНоменклатуры.СуммаНДС = 0
		|									ТОГДА ТаблицаНоменклатуры.Цена
		|								ИНАЧЕ ВЫРАЗИТЬ((ТаблицаНоменклатуры.Сумма - ТаблицаНоменклатуры.СуммаНДС) / ТаблицаНоменклатуры.Количество КАК ЧИСЛО(15, 2))
		|							КОНЕЦ
		|					ИНАЧЕ ТаблицаНоменклатуры.Цена
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ТаблицаНоменклатуры.Количество <> 0
		|					ТОГДА ВЫРАЗИТЬ((РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРуб - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРуб) / ТаблицаНоменклатуры.Количество КАК ЧИСЛО(15, 2))
		|				КОГДА ТаблицаНоменклатуры.КоличествоДоКорректировки <> 0
		|					ТОГДА ВЫРАЗИТЬ((РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения) / ТаблицаНоменклатуры.КоличествоДоКорректировки КАК ЧИСЛО(15, 2))
		|				ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения - РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Реквизиты.Исправление
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|						ТОГДА ТаблицаНоменклатуры.СуммаНДСДоКорректировки
		|					ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|					ТОГДА ТаблицаНоменклатуры.СуммаНДСДоИзменения
		|				ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРубДоИзменения
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ТаблицаНоменклатуры.СуммаНДС
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРуб
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.Исправление
		|						ТОГДА ВЫБОР
		|								КОГДА Реквизиты.СуммаВключаетНДС
		|									ТОГДА ТаблицаНоменклатуры.СуммаДоКорректировки - ТаблицаНоменклатуры.СуммаНДСДоКорректировки
		|								ИНАЧЕ ТаблицаНоменклатуры.СуммаДоКорректировки
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Реквизиты.СуммаВключаетНДС
		|								ТОГДА ТаблицаНоменклатуры.СуммаДоИзменения - ТаблицаНоменклатуры.СуммаНДСДоИзменения
		|							ИНАЧЕ ТаблицаНоменклатуры.СуммаДоИзменения
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаБезНДСРубДоИзменения
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.СуммаВключаетНДС
		|						ТОГДА ТаблицаНоменклатуры.Сумма - ТаблицаНоменклатуры.СуммаНДС
		|					ИНАЧЕ ТаблицаНоменклатуры.Сумма
		|				КОНЕЦ
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаБезНДСРуб
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.Исправление
		|						ТОГДА ВЫБОР
		|								КОГДА Реквизиты.СуммаВключаетНДС
		|									ТОГДА ТаблицаНоменклатуры.СуммаДоКорректировки
		|								ИНАЧЕ ТаблицаНоменклатуры.СуммаДоКорректировки + ТаблицаНоменклатуры.СуммаНДСДоКорректировки
		|							КОНЕЦ
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Реквизиты.СуммаВключаетНДС
		|								ТОГДА ТаблицаНоменклатуры.СуммаДоИзменения
		|							ИНАЧЕ ТаблицаНоменклатуры.СуммаДоИзменения + ТаблицаНоменклатуры.СуммаНДСДоИзменения
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРубДоИзменения
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ Реквизиты.БратьСуммыИзРегистраРублевыеСуммы
		|			ТОГДА ВЫБОР
		|					КОГДА Реквизиты.СуммаВключаетНДС
		|						ТОГДА ТаблицаНоменклатуры.Сумма
		|					ИНАЧЕ ТаблицаНоменклатуры.Сумма + ТаблицаНоменклатуры.СуммаНДС
		|				КОНЕЦ
		|		ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРуб
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	"""",
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	ЛОЖЬ,
		|	0,
		|	0,
		|	1
		|ИЗ
		|	Документ.КорректировкаРеализации.АгентскиеУслуги КАК ТаблицаНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеквизиты КАК Реквизиты
		|		ПО (Реквизиты.Ссылка = ТаблицаНоменклатуры.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
		|		ПО ТаблицаНоменклатуры.Ссылка = РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор
		|			И ТаблицаНоменклатуры.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
		|			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныечастиДокументов.АгентскиеУслуги))
		|			И (ТаблицаНоменклатуры.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
		|ГДЕ
		|	ТаблицаНоменклатуры.Ссылка = &ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатуры.НомерТабЧасти КАК НомерТабЧасти,
		|	ТаблицаНоменклатуры.НомерСтроки КАК НомерСтроки,
		|	ТаблицаНоменклатуры.Товар КАК Товар,
		|	ТаблицаНоменклатуры.ТоварКод КАК ТоварКод,
		|	ТаблицаНоменклатуры.ТоварАртикул КАК ТоварАртикул,
		|	ТаблицаНоменклатуры.ТоварНаименование КАК ТоварНаименование,
		|	ТаблицаНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ТаблицаНоменклатуры.ПредставлениеСтраны КАК ПредставлениеСтраны,
		|	ТаблицаНоменклатуры.НомерГТД КАК НомерГТД,
		|	ТаблицаНоменклатуры.ПредставлениеГТД КАК ПредставлениеГТД,
		|	ТаблицаНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВЫРАЗИТЬ(ТаблицаНоменклатуры.КоличествоДоИзменения / ТаблицаНоменклатуры.КоэффициентУпаковки КАК ЧИСЛО(15,3)) КАК КоличествоДоИзменения,
		|	ВЫРАЗИТЬ(ТаблицаНоменклатуры.КоличествоПослеИзменения /  ТаблицаНоменклатуры.КоэффициентУпаковки КАК ЧИСЛО(15,3)) КАК КоличествоПослеИзменения,
		|	ВЫРАЗИТЬ(ТаблицаНоменклатуры.ЦенаДоИзменения * ТаблицаНоменклатуры.КоэффициентУпаковки КАК ЧИСЛО(15,2)) КАК ЦенаДоИзменения,
		|	ВЫРАЗИТЬ(ТаблицаНоменклатуры.ЦенаПослеИзменения * ТаблицаНоменклатуры.КоэффициентУпаковки КАК ЧИСЛО(15,2)) КАК ЦенаПослеИзменения,
		|	ТаблицаНоменклатуры.СтоимостьБезНДСДоИзменения КАК СтоимостьБезНДСДоИзменения,
		|	ТаблицаНоменклатуры.СтоимостьБезНДСПослеИзменения КАК СтоимостьБезНДСПослеИзменения,
		|	ТаблицаНоменклатуры.СуммаНДСПослеИзменения КАК СуммаНДСПослеИзменения,
		|	ТаблицаНоменклатуры.СуммаНДСДоИзменения КАК СуммаНДСДоИзменения,
		|	ТаблицаНоменклатуры.СтоимостьСНДСДоИзменения КАК СтоимостьСНДСДоИзменения,
		|	ТаблицаНоменклатуры.СтоимостьСНДСПослеИзменения КАК СтоимостьСНДСПослеИзменения,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.СтоимостьБезНДСДоИзменения > ТаблицаНоменклатуры.СтоимостьБезНДСПослеИзменения
		|			ТОГДА ТаблицаНоменклатуры.СтоимостьБезНДСДоИзменения - ТаблицаНоменклатуры.СтоимостьБезНДСПослеИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаБезНДСУменьшение,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.СтоимостьБезНДСПослеИзменения > ТаблицаНоменклатуры.СтоимостьБезНДСДоИзменения
		|			ТОГДА ТаблицаНоменклатуры.СтоимостьБезНДСПослеИзменения - ТаблицаНоменклатуры.СтоимостьБезНДСДоИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаБезНДСУвеличение,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.СуммаНДСДоИзменения > ТаблицаНоменклатуры.СуммаНДСПослеИзменения
		|			ТОГДА ТаблицаНоменклатуры.СуммаНДСДоИзменения - ТаблицаНоменклатуры.СуммаНДСПослеИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаНДСУменьшение,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.СуммаНДСПослеИзменения > ТаблицаНоменклатуры.СуммаНДСДоИзменения
		|			ТОГДА ТаблицаНоменклатуры.СуммаНДСПослеИзменения - ТаблицаНоменклатуры.СуммаНДСДоИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаНДСУвеличение,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.СтоимостьСНДСДоИзменения > ТаблицаНоменклатуры.СтоимостьСНДСПослеИзменения
		|			ТОГДА ТаблицаНоменклатуры.СтоимостьСНДСДоИзменения - ТаблицаНоменклатуры.СтоимостьСНДСПослеИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаСНДСУменьшение,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.СтоимостьСНДСПослеИзменения > ТаблицаНоменклатуры.СтоимостьСНДСДоИзменения
		|			ТОГДА ТаблицаНоменклатуры.СтоимостьСНДСПослеИзменения - ТаблицаНоменклатуры.СтоимостьСНДСДоИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаСНДСУвеличение,
		|	ТаблицаНоменклатуры.СтавкаНДС КАК СтавкаНДСДоИзменения,
		|	ТаблицаНоменклатуры.СтавкаНДС КАК СтавкаНДСПослеИзменения,
		|	ТаблицаНоменклатуры.ЭтоУслуга КАК ЭтоУслуга,
		|	ТаблицаНоменклатуры.Ссылка КАК Ссылка,
		|	ТаблицаНоменклатуры.ТоварыКодТНВЭД КАК ТоварКодТНВЭД,
		|	ТаблицаНоменклатуры.ТоварыКодТНВЭДДоИзменения КАК ТоварКодТНВЭДДоИзменения,
		|	ТаблицаНоменклатуры.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаНоменклатуры.НоменклатураКодТНВЭД КАК НоменклатураКодТНВЭД,
		|	ТаблицаНоменклатуры.СтранаПроисхожденияДоИзменения КАК СтранаПроисхожденияДо,
		|	ТаблицаНоменклатуры.РегистрационныйНомерТДДо КАК РегистрационныйНомерТДДо,
		|	ТаблицаНоменклатуры.РегистрационныйНомерТДПосле КАК РегистрационныйНомерТДПосле,
		|	ТаблицаНоменклатуры.ИдентификаторСтрокиГосконтрактаЕИС КАК ИдентификаторСтрокиГосконтрактаЕИС,
		|	ТаблицаНоменклатуры.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
		|	ТаблицаНоменклатуры.СуммаАкцизаДоИзменения КАК СуммаАкцизаДоИзменения,
		|	ТаблицаНоменклатуры.СуммаАкцизаПослеИзменения КАК СуммаАкцизаПослеИзменения,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.СуммаАкцизаДоИзменения > ТаблицаНоменклатуры.СуммаАкцизаПослеИзменения
		|			ТОГДА ТаблицаНоменклатуры.СуммаАкцизаДоИзменения - ТаблицаНоменклатуры.СуммаАкцизаПослеИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаАкцизУменьшение,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.СуммаАкцизаПослеИзменения > ТаблицаНоменклатуры.СуммаАкцизаДоИзменения
		|			ТОГДА ТаблицаНоменклатуры.СуммаАкцизаПослеИзменения - ТаблицаНоменклатуры.СуммаАкцизаДоИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаАкцизУвеличение
		|ПОМЕСТИТЬ ТаблицаДокумента
		|ИЗ
		|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|ГДЕ
		|	(ТаблицаНоменклатуры.КоличествоПослеИзменения <> ТаблицаНоменклатуры.КоличествоДоИзменения
		|			ИЛИ ТаблицаНоменклатуры.СтоимостьБезНДСПослеИзменения <> ТаблицаНоменклатуры.СтоимостьБезНДСДоИзменения
		|			ИЛИ ТаблицаНоменклатуры.СуммаНДСПослеИзменения <> ТаблицаНоменклатуры.СуммаНДСДоИзменения
		|			ИЛИ ТаблицаНоменклатуры.ЦенаПослеИзменения <> ТаблицаНоменклатуры.ЦенаДоИзменения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Ссылка,
		|	ТаблицаДокумента.ШтрихкодУпаковки КАК Штрихкод
		|ИЗ
		|	Документ.КорректировкаРеализации.ШтрихкодыУпаковок КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияПрослеживаемостиДоПосле.НомерТовара КАК НомерТовара,
		|	СУММА(СведенияПрослеживаемостиДоПосле.КоличествоУчетноеДоИзменения) КАК КоличествоУчетноеДоИзменения,
		|	СУММА(СведенияПрослеживаемостиДоПосле.КоличествоУчетноеПослеИзменения) КАК КоличествоУчетноеПослеИзменения,
		|	СУММА(СведенияПрослеживаемостиДоПосле.КоличествоТовараДоИзменения) КАК КоличествоТовараДоИзменения,
		|	СУММА(СведенияПрослеживаемостиДоПосле.КоличествоТовараПослеИзменения) КАК КоличествоТовараПослеИзменения,
		|	СведенияПрослеживаемостиДоПосле.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СУММА(СведенияПрослеживаемостиДоПосле.СуммаПослеИзменения) КАК СуммаПослеИзменения,
		|	СУММА(СведенияПрослеживаемостиДоПосле.СуммаДоИзменения) КАК СуммаДоИзменения
		|ПОМЕСТИТЬ СведенияОПрослеживаемостиПредварительная
		|ИЗ
		|	(ВЫБРАТЬ
		|		КорректировкаРеализацииСведенияПрослеживаемости.РНПТ.Код КАК НомерТовара,
		|		0 КАК КоличествоУчетноеДоИзменения,
		|		КорректировкаРеализацииСведенияПрослеживаемости.Количество КАК КоличествоУчетноеПослеИзменения,
		|		0 КАК КоличествоТовараДоИзменения,
		|		КорректировкаРеализацииСведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоТовараПослеИзменения,
		|		КорректировкаРеализацииСведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|		КорректировкаРеализацииСведенияПрослеживаемости.Сумма КАК СуммаПослеИзменения,
		|		0 КАК СуммаДоИзменения
		|	ИЗ
		|		Документ.КорректировкаРеализации.СведенияПрослеживаемости КАК КорректировкаРеализацииСведенияПрослеживаемости
		|	ГДЕ
		|		КорректировкаРеализацииСведенияПрослеживаемости.Ссылка В
		|				(ВЫБРАТЬ
		|					ТаблицаДокумента.Ссылка
		|				ИЗ
		|					ТаблицаДокумента)
		|		И НЕ КорректировкаРеализацииСведенияПрослеживаемости.ЭтоСтрокаСИсходнымиРНПТ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КорректировкаРеализацииСведенияПрослеживаемости.РНПТ.Код,
		|		КорректировкаРеализацииСведенияПрослеживаемости.Количество,
		|		0,
		|		КорректировкаРеализацииСведенияПрослеживаемости.КоличествоПрослеживаемости,
		|		0,
		|		КорректировкаРеализацииСведенияПрослеживаемости.ИдентификаторСтроки,
		|		0,
		|		КорректировкаРеализацииСведенияПрослеживаемости.Сумма
		|	ИЗ
		|		Документ.КорректировкаРеализации.СведенияПрослеживаемости КАК КорректировкаРеализацииСведенияПрослеживаемости
		|	ГДЕ
		|		КорректировкаРеализацииСведенияПрослеживаемости.Ссылка В
		|				(ВЫБРАТЬ
		|					ТаблицаДокумента.Ссылка
		|				ИЗ
		|					ТаблицаДокумента)
		|		И КорректировкаРеализацииСведенияПрослеживаемости.ЭтоСтрокаСИсходнымиРНПТ) КАК СведенияПрослеживаемостиДоПосле
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияПрослеживаемостиДоПосле.НомерТовара,
		|	СведенияПрослеживаемостиДоПосле.ИдентификаторСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОПрослеживаемостиПредварительная.НомерТовара КАК НомерТовара,
		|	СУММА(СведенияОПрослеживаемостиПредварительная.КоличествоУчетноеДоИзменения) КАК КоличествоУчетноеДоИзменения,
		|	СУММА(СведенияОПрослеживаемостиПредварительная.КоличествоУчетноеПослеИзменения) КАК КоличествоУчетноеПослеИзменения,
		|	СУММА(СведенияОПрослеживаемостиПредварительная.КоличествоТовараДоИзменения) КАК КоличествоТовараДоИзменения,
		|	СУММА(СведенияОПрослеживаемостиПредварительная.КоличествоТовараПослеИзменения) КАК КоличествоТовараПослеИзменения,
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Наименование, ""шт"") КАК ЕдиницаИзмеренияПрослеживаемостиНаименование,
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, ""796"") КАК ЕдиницаИзмеренияПрослеживаемостиКод,
		|	ТаблицаДокумента.Товар КАК Товар,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.ТоварКодТНВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		|			ТОГДА ""--""
		|		ИНАЧЕ ТаблицаДокумента.ТоварКодТНВЭД
		|	КОНЕЦ КАК ТоварКодТНВЭД,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.ТоварКодТНВЭДДоИзменения = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		|			ТОГДА ""--""
		|		ИНАЧЕ ТаблицаДокумента.ТоварКодТНВЭДДоИзменения
		|	КОНЕЦ КАК ТоварКодТНВЭДДоИзменения,
		|	ТаблицаДокумента.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
		|	ТаблицаДокумента.ЕдиницаИзмерения КАК НаименованиеЕдиницыИзмерения,
		|	ТаблицаДокумента.ЦенаДоИзменения КАК ЦенаДоИзменения,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.КоличествоПослеИзменения = 0
		|			ТОГДА ТаблицаДокумента.ЦенаДоИзменения
		|		ИНАЧЕ ТаблицаДокумента.ЦенаПослеИзменения
		|	КОНЕЦ КАК ЦенаПослеИзменения,
		|	ТаблицаДокумента.СтавкаНДСПослеИзменения КАК СтавкаНДСПослеИзменения,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОПрослеживаемостиПредварительная.КоличествоТовараДоИзменения < СведенияОПрослеживаемостиПредварительная.КоличествоТовараПослеИзменения
		|				ТОГДА ВЫРАЗИТЬ(СведенияОПрослеживаемостиПредварительная.КоличествоТовараПослеИзменения - СведенияОПрослеживаемостиПредварительная.КоличествоТовараДоИзменения КАК ЧИСЛО(26, 11))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоТовараУвеличение,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОПрослеживаемостиПредварительная.КоличествоТовараДоИзменения > СведенияОПрослеживаемостиПредварительная.КоличествоТовараПослеИзменения
		|				ТОГДА ВЫРАЗИТЬ(СведенияОПрослеживаемостиПредварительная.КоличествоТовараДоИзменения - СведенияОПрослеживаемостиПредварительная.КоличествоТовараПослеИзменения КАК ЧИСЛО(26, 11))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоТовараУменьшение,
		|	ТаблицаДокумента.СтранаПроисхожденияДо КАК СтранаПроисхожденияДо,
		|	ТаблицаДокумента.Ссылка КАК Ссылка,
		|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ВЫБОР
		|		КОГДА СведенияОПрослеживаемостиПредварительная.СуммаДоИзменения = 0
		|			ТОГДА СведенияОПрослеживаемостиПредварительная.КоличествоТовараДоИзменения * ТаблицаДокумента.ЦенаДоИзменения
		|		ИНАЧЕ СведенияОПрослеживаемостиПредварительная.СуммаДоИзменения
		|	КОНЕЦ КАК СтоимостьБезНалогаДоИзменения,
		|	ВЫБОР
		|		КОГДА СведенияОПрослеживаемостиПредварительная.СуммаПослеИзменения = 0
		|			ТОГДА СведенияОПрослеживаемостиПредварительная.КоличествоТовараПослеИзменения * ТаблицаДокумента.ЦенаПослеИзменения
		|		ИНАЧЕ СведенияОПрослеживаемостиПредварительная.СуммаПослеИзменения
		|	КОНЕЦ КАК СтоимостьБезНалогаПослеИзменения
		|ИЗ
		|	СведенияОПрослеживаемостиПредварительная КАК СведенияОПрослеживаемостиПредварительная
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокумента КАК ТаблицаДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
		|			ПО ТаблицаДокумента.НоменклатураКодТНВЭД = КлассификаторТНВЭД.Ссылка
		|		ПО (ТаблицаДокумента.ИдентификаторСтроки = СведенияОПрослеживаемостиПредварительная.ИдентификаторСтроки)
		|ГДЕ
		|	ТаблицаДокумента.ПрослеживаемыйТовар = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Товар,
		|	СведенияОПрослеживаемостиПредварительная.НомерТовара,
		|	ТаблицаДокумента.ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.ТоварКодТНВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		|			ТОГДА ""--""
		|		ИНАЧЕ ТаблицаДокумента.ТоварКодТНВЭД
		|	КОНЕЦ,
		|	ТаблицаДокумента.СтранаПроисхождения,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.ТоварКодТНВЭДДоИзменения = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		|			ТОГДА ""--""
		|		ИНАЧЕ ТаблицаДокумента.ТоварКодТНВЭДДоИзменения
		|	КОНЕЦ,
		|	ТаблицаДокумента.НомерГТД,
		|	ТаблицаДокумента.СтавкаНДСПослеИзменения,
		|	ТаблицаДокумента.ЦенаДоИзменения,
		|	ТаблицаДокумента.ЦенаПослеИзменения,
		|	ТаблицаДокумента.СтранаПроисхожденияДо,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.КоличествоПослеИзменения = 0
		|			ТОГДА ТаблицаДокумента.ЦенаДоИзменения
		|		ИНАЧЕ ТаблицаДокумента.ЦенаПослеИзменения
		|	КОНЕЦ,
		|	ТаблицаДокумента.Ссылка,
		|	ТаблицаДокумента.ИдентификаторСтроки,
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Наименование, ""шт""),
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, ""796""),
		|	ВЫБОР
		|		КОГДА СведенияОПрослеживаемостиПредварительная.СуммаДоИзменения = 0
		|			ТОГДА СведенияОПрослеживаемостиПредварительная.КоличествоТовараДоИзменения * ТаблицаДокумента.ЦенаДоИзменения
		|		ИНАЧЕ СведенияОПрослеживаемостиПредварительная.СуммаДоИзменения
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СведенияОПрослеживаемостиПредварительная.СуммаПослеИзменения = 0
		|			ТОГДА СведенияОПрослеживаемостиПредварительная.КоличествоТовараПослеИзменения * ТаблицаДокумента.ЦенаПослеИзменения
		|		ИНАЧЕ СведенияОПрослеживаемостиПредварительная.СуммаПослеИзменения
		|	КОНЕЦ";
	Иначе
		ТекстЗапроса = ТекстЗапроса +"ВЫБРАТЬ
		|	""2"" КАК НомерТабЧасти,
		|	ТаблицаКорректировочногоДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаКорректировочногоДокумента.Товар КАК Товар,
		|	ТаблицаКорректировочногоДокумента.ТоварКод КАК ТоварКод,
		|	ТаблицаКорректировочногоДокумента.ТоварАртикул КАК ТоварАртикул,
		|	ТаблицаКорректировочногоДокумента.ТоварНаименование КАК ТоварНаименование,
		|	ТаблицаКорректировочногоДокумента.СтранаПроисхождения КАК СтранаПроисхождения,
		|	"""" КАК ПредставлениеСтраны,
		|	"""" КАК НомерГТД,
		|	"""" КАК ПредставлениеГТД,
		|	ТаблицаКорректировочногоДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаКорректировочногоДокумента.КоличествоДоИзменения КАК КоличествоДоИзменения,
		|	ТаблицаКорректировочногоДокумента.КоличествоПослеИзменения КАК КоличествоПослеИзменения,
		|	ТаблицаКорректировочногоДокумента.ЦенаДоИзменения КАК ЦенаДоИзменения,
		|	ТаблицаКорректировочногоДокумента.ЦенаПослеИзменения КАК ЦенаПослеИзменения,
		|	ТаблицаКорректировочногоДокумента.СтоимостьБезНДСДоИзменения КАК СтоимостьБезНДСДоИзменения,
		|	ТаблицаКорректировочногоДокумента.СтоимостьБезНДСПослеИзменения КАК СтоимостьБезНДСПослеИзменения,
		|	ТаблицаКорректировочногоДокумента.СуммаНДСПослеИзменения КАК СуммаНДСПослеИзменения,
		|	ТаблицаКорректировочногоДокумента.СуммаНДСДоИзменения КАК СуммаНДСДоИзменения,
		|	ТаблицаКорректировочногоДокумента.СтоимостьСНДСДоИзменения КАК СтоимостьСНДСДоИзменения,
		|	ТаблицаКорректировочногоДокумента.СтоимостьСНДСПослеИзменения КАК СтоимостьСНДСПослеИзменения,
		|	ВЫБОР
		|		КОГДА ТаблицаКорректировочногоДокумента.СтоимостьБезНДСДоИзменения > ТаблицаКорректировочногоДокумента.СтоимостьБезНДСПослеИзменения
		|			ТОГДА ТаблицаКорректировочногоДокумента.СтоимостьБезНДСДоИзменения - ТаблицаКорректировочногоДокумента.СтоимостьБезНДСПослеИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаБезНДСУменьшение,
		|	ВЫБОР
		|		КОГДА ТаблицаКорректировочногоДокумента.СтоимостьБезНДСПослеИзменения > ТаблицаКорректировочногоДокумента.СтоимостьБезНДСДоИзменения
		|			ТОГДА ТаблицаКорректировочногоДокумента.СтоимостьБезНДСПослеИзменения - ТаблицаКорректировочногоДокумента.СтоимостьБезНДСДоИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаБезНДСУвеличение,
		|	ВЫБОР
		|		КОГДА ТаблицаКорректировочногоДокумента.СуммаНДСДоИзменения > ТаблицаКорректировочногоДокумента.СуммаНДСПослеИзменения
		|			ТОГДА ТаблицаКорректировочногоДокумента.СуммаНДСДоИзменения - ТаблицаКорректировочногоДокумента.СуммаНДСПослеИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаНДСУменьшение,
		|	ВЫБОР
		|		КОГДА ТаблицаКорректировочногоДокумента.СуммаНДСПослеИзменения > ТаблицаКорректировочногоДокумента.СуммаНДСДоИзменения
		|			ТОГДА ТаблицаКорректировочногоДокумента.СуммаНДСПослеИзменения - ТаблицаКорректировочногоДокумента.СуммаНДСДоИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаНДСУвеличение,
		|	ВЫБОР
		|		КОГДА ТаблицаКорректировочногоДокумента.СтоимостьСНДСДоИзменения > ТаблицаКорректировочногоДокумента.СтоимостьСНДСПослеИзменения
		|			ТОГДА ТаблицаКорректировочногоДокумента.СтоимостьСНДСДоИзменения - ТаблицаКорректировочногоДокумента.СтоимостьСНДСПослеИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаСНДСУменьшение,
		|	ВЫБОР
		|		КОГДА ТаблицаКорректировочногоДокумента.СтоимостьСНДСПослеИзменения > ТаблицаКорректировочногоДокумента.СтоимостьСНДСДоИзменения
		|			ТОГДА ТаблицаКорректировочногоДокумента.СтоимостьСНДСПослеИзменения - ТаблицаКорректировочногоДокумента.СтоимостьСНДСДоИзменения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазницаСНДСУвеличение,
		|	ТаблицаКорректировочногоДокумента.СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,
		|	ТаблицаКорректировочногоДокумента.СтавкаНДСПослеИзменения КАК СтавкаНДСПослеИзменения,
		|	ТаблицаКорректировочногоДокумента.ЭтоУслуга КАК ЭтоУслуга,
		|	ТаблицаКорректировочногоДокумента.Ссылка КАК Ссылка,
		|	ТаблицаКорректировочногоДокумента.ТоварКодТНВЭД КАК ТоварКодТНВЭД,
		|	ТаблицаКорректировочногоДокумента.ТоварКодТНВЭДДоИзменения КАК ТоварКодТНВЭДДоИзменения,
		|	ТаблицаКорректировочногоДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаКорректировочногоДокумента.ТоварКодТНВЭД КАК НоменклатураКодТНВЭД,
		|	ТаблицаКорректировочногоДокумента.СтранаПроисхожденияДоИзменения КАК СтранаПроисхожденияДо,
		|	"""" КАК РегистрационныйНомерТДДо,
		|	"""" КАК РегистрационныйНомерТДПосле,
		|	ТаблицаКорректировочногоДокумента.ИдентификаторСтрокиГосконтрактаЕИС КАК ИдентификаторСтрокиГосконтрактаЕИС,
		|	НЕ ТаблицаКорректировочногоДокумента.ЭтоУслуга КАК ПрослеживаемыйТовар,
		|	ТаблицаКорректировочногоДокумента.РНПТ КАК РНПТ,
		|	0 КАК СуммаАкцизаДоИзменения,
		|	0 КАК СуммаАкцизаПослеИзменения,
		|	0 КАК РазницаАкцизУвеличение,
		|	0 КАК разницаАкцизУменьшение
		|ПОМЕСТИТЬ ТаблицаДокумента
		|ИЗ
		|	&ТаблицаКорректировочногоДокумента КАК ТаблицаКорректировочногоДокумента
		|ГДЕ
		|	(ТаблицаКорректировочногоДокумента.КоличествоПослеИзменения <> ТаблицаКорректировочногоДокумента.КоличествоДоИзменения
		|			ИЛИ ТаблицаКорректировочногоДокумента.СтоимостьБезНДСПослеИзменения <> ТаблицаКорректировочногоДокумента.СтоимостьБезНДСДоИзменения
		|			ИЛИ ТаблицаКорректировочногоДокумента.СуммаНДСПослеИзменения <> ТаблицаКорректировочногоДокумента.СуммаНДСДоИзменения
		|			ИЛИ ТаблицаКорректировочногоДокумента.ЦенаПослеИзменения <> ТаблицаКорректировочногоДокумента.ЦенаДоИзменения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияПрослеживаемостиДоПосле.НомерТовара КАК НомерТовара,
		|	СУММА(СведенияПрослеживаемостиДоПосле.КоличествоУчетноеДоИзменения) КАК КоличествоУчетноеДоИзменения,
		|	СУММА(СведенияПрослеживаемостиДоПосле.КоличествоУчетноеПослеИзменения) КАК КоличествоУчетноеПослеИзменения,
		|	СУММА(СведенияПрослеживаемостиДоПосле.КоличествоТовараДоИзменения) КАК КоличествоТовараДоИзменения,
		|	СУММА(СведенияПрослеживаемостиДоПосле.КоличествоТовараПослеИзменения) КАК КоличествоТовараПослеИзменения,
		|	СведенияПрослеживаемостиДоПосле.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СведенияПрослеживаемостиДоПосле.Номенклатура КАК Номенклатура,
		|	СведенияПрослеживаемостиДоПосле.СтранаПроисхождения КАК СтранаПроисхождения,
		|	СведенияПрослеживаемостиДоПосле.РНПТ КАК РНПТ
		|ПОМЕСТИТЬ СведенияОПрослеживаемостиПредварительная
		|ИЗ
		|	(ВЫБРАТЬ
		|		КорректировкаРеализацииСведенияПрослеживаемости.РНПТ.Код КАК НомерТовара,
		|		0 КАК КоличествоУчетноеДоИзменения,
		|		КорректировкаРеализацииСведенияПрослеживаемости.Количество КАК КоличествоУчетноеПослеИзменения,
		|		0 КАК КоличествоТовараДоИзменения,
		|		КорректировкаРеализацииСведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоТовараПослеИзменения,
		|		КорректировкаРеализацииСведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|		КорректировкаРеализацииСведенияПрослеживаемости.Номенклатура КАК Номенклатура,
		|		КорректировкаРеализацииСведенияПрослеживаемости.СтранаПроисхождения КАК СтранаПроисхождения,
		|		КорректировкаРеализацииСведенияПрослеживаемости.РНПТ КАК РНПТ
		|	ИЗ
		|		Документ.КорректировкаРеализации.СведенияПрослеживаемости КАК КорректировкаРеализацииСведенияПрослеживаемости
		|	ГДЕ
		|		КорректировкаРеализацииСведенияПрослеживаемости.Ссылка В
		|				(ВЫБРАТЬ
		|					ТаблицаДокумента.Ссылка
		|				ИЗ
		|					ТаблицаДокумента)
		|		И НЕ КорректировкаРеализацииСведенияПрослеживаемости.ЭтоСтрокаСИсходнымиРНПТ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КорректировкаРеализацииСведенияПрослеживаемости.РНПТ.Код,
		|		КорректировкаРеализацииСведенияПрослеживаемости.Количество,
		|		0,
		|		КорректировкаРеализацииСведенияПрослеживаемости.КоличествоПрослеживаемости,
		|		0,
		|		КорректировкаРеализацииСведенияПрослеживаемости.ИдентификаторСтроки,
		|		КорректировкаРеализацииСведенияПрослеживаемости.Номенклатура,
		|		КорректировкаРеализацииСведенияПрослеживаемости.СтранаПроисхождения,
		|		КорректировкаРеализацииСведенияПрослеживаемости.РНПТ
		|	ИЗ
		|		Документ.КорректировкаРеализации.СведенияПрослеживаемости КАК КорректировкаРеализацииСведенияПрослеживаемости
		|	ГДЕ
		|		КорректировкаРеализацииСведенияПрослеживаемости.Ссылка В
		|				(ВЫБРАТЬ
		|					ТаблицаДокумента.Ссылка
		|				ИЗ
		|					ТаблицаДокумента)
		|		И КорректировкаРеализацииСведенияПрослеживаемости.ЭтоСтрокаСИсходнымиРНПТ) КАК СведенияПрослеживаемостиДоПосле
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияПрослеживаемостиДоПосле.НомерТовара,
		|	СведенияПрослеживаемостиДоПосле.ИдентификаторСтроки,
		|	СведенияПрослеживаемостиДоПосле.Номенклатура,
		|	СведенияПрослеживаемостиДоПосле.СтранаПроисхождения,
		|	СведенияПрослеживаемостиДоПосле.РНПТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОПрослеживаемостиПредварительная.НомерТовара КАК НомерТовара,
		|	СУММА(СведенияОПрослеживаемостиПредварительная.КоличествоУчетноеДоИзменения) КАК КоличествоУчетноеДоИзменения,
		|	СУММА(СведенияОПрослеживаемостиПредварительная.КоличествоУчетноеПослеИзменения) КАК КоличествоУчетноеПослеИзменения,
		|	СУММА(СведенияОПрослеживаемостиПредварительная.КоличествоТовараДоИзменения) КАК КоличествоТовараДоИзменения,
		|	СУММА(СведенияОПрослеживаемостиПредварительная.КоличествоТовараПослеИзменения) КАК КоличествоТовараПослеИзменения,
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Наименование, ""шт"") КАК ЕдиницаИзмеренияПрослеживаемостиНаименование,
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, ""796"") КАК ЕдиницаИзмеренияПрослеживаемостиКод,
		|	ТаблицаДокумента.Товар КАК Товар,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.ТоварКодТНВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		|			ТОГДА ""--""
		|		ИНАЧЕ ТаблицаДокумента.ТоварКодТНВЭД
		|	КОНЕЦ КАК ТоварКодТНВЭД,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.ТоварКодТНВЭДДоИзменения = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		|			ТОГДА ""--""
		|		ИНАЧЕ ТаблицаДокумента.ТоварКодТНВЭДДоИзменения
		|	КОНЕЦ КАК ТоварКодТНВЭДДоИзменения,
		|	ТаблицаДокумента.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ТаблицаДокумента.ЕдиницаИзмерения КАК НаименованиеЕдиницыИзмерения,
		|	ТаблицаДокумента.ЦенаДоИзменения КАК ЦенаДоИзменения,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.КоличествоПослеИзменения = 0
		|			ТОГДА ТаблицаДокумента.ЦенаДоИзменения
		|		ИНАЧЕ ТаблицаДокумента.ЦенаПослеИзменения
		|	КОНЕЦ КАК ЦенаПослеИзменения,
		|	ТаблицаДокумента.СтавкаНДСПослеИзменения КАК СтавкаНДСПослеИзменения,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОПрослеживаемостиПредварительная.КоличествоТовараДоИзменения < СведенияОПрослеживаемостиПредварительная.КоличествоТовараПослеИзменения
		|				ТОГДА ВЫРАЗИТЬ(СведенияОПрослеживаемостиПредварительная.КоличествоТовараПослеИзменения - СведенияОПрослеживаемостиПредварительная.КоличествоТовараДоИзменения КАК ЧИСЛО(26, 11))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоТовараУвеличение,
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОПрослеживаемостиПредварительная.КоличествоТовараДоИзменения > СведенияОПрослеживаемостиПредварительная.КоличествоТовараПослеИзменения
		|				ТОГДА ВЫРАЗИТЬ(СведенияОПрослеживаемостиПредварительная.КоличествоТовараДоИзменения - СведенияОПрослеживаемостиПредварительная.КоличествоТовараПослеИзменения КАК ЧИСЛО(26, 11))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоТовараУменьшение,
		|	ТаблицаДокумента.СтранаПроисхожденияДо КАК СтранаПроисхожденияДо,
		|	ТаблицаДокумента.Ссылка КАК Ссылка,
		|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
		|	ТаблицаДокумента.СтоимостьБезНДСДоИзменения КАК СтоимостьБезНалогаДоИзменения,
		|	ТаблицаДокумента.СтоимостьБезНДСПослеИзменения КАК СтоимостьБезНалогаПослеИзменения
		|ИЗ
		|	СведенияОПрослеживаемостиПредварительная КАК СведенияОПрослеживаемостиПредварительная
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокумента КАК ТаблицаДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
		|			ПО ТаблицаДокумента.НоменклатураКодТНВЭД = КлассификаторТНВЭД.Ссылка
		|		ПО СведенияОПрослеживаемостиПредварительная.Номенклатура = ТаблицаДокумента.Товар
		|			И СведенияОПрослеживаемостиПредварительная.РНПТ = ТаблицаДокумента.РНПТ
		|			И (СведенияОПрослеживаемостиПредварительная.СтранаПроисхождения = ЕСТЬNULL(ТаблицаДокумента.СтранаПроисхождения, ТаблицаДокумента.СтранаПроисхожденияДо))
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Товар,
		|	СведенияОПрослеживаемостиПредварительная.НомерТовара,
		|	ТаблицаДокумента.ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.ТоварКодТНВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		|			ТОГДА ""--""
		|		ИНАЧЕ ТаблицаДокумента.ТоварКодТНВЭД
		|	КОНЕЦ,
		|	ТаблицаДокумента.СтранаПроисхождения,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.ТоварКодТНВЭДДоИзменения = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		|			ТОГДА ""--""
		|		ИНАЧЕ ТаблицаДокумента.ТоварКодТНВЭДДоИзменения
		|	КОНЕЦ,
		|	ТаблицаДокумента.СтавкаНДСПослеИзменения,
		|	ТаблицаДокумента.ЦенаДоИзменения,
		|	ТаблицаДокумента.ЦенаПослеИзменения,
		|	ТаблицаДокумента.СтранаПроисхожденияДо,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.КоличествоПослеИзменения = 0
		|			ТОГДА ТаблицаДокумента.ЦенаДоИзменения
		|		ИНАЧЕ ТаблицаДокумента.ЦенаПослеИзменения
		|	КОНЕЦ,
		|	ТаблицаДокумента.Ссылка,
		|	ТаблицаДокумента.ИдентификаторСтроки,
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Наименование, ""шт""),
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, ""796""),
		|	ТаблицаДокумента.НомерГТД,
		|	ТаблицаДокумента.СтоимостьБезНДСДоИзменения,
		|	ТаблицаДокумента.СтоимостьБезНДСПослеИзменения";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

&ИзменениеИКонтроль("ПолучитьТаблицуСведенийСоглашенияОбИзмененииСтоимости")
Функция смарт_ПолучитьТаблицуСведенийСоглашенияОбИзмененииСтоимости(Знач СписокДокументов)

	ТаблицаСведений = ПечатьТорговыхДокументов.ПолучитьОписаниеСоглашенияОбИзмененииСтоимости();

	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("СписокДокументов", СписокДокументов);
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить());

	Запрос.Текст = ПолучитьТекстЗапросаДляФормированияТаблицыСведенийСоглашенияОбИзмененииСтоимости();

	РезультатыЗапроса = Запрос.ВыполнитьПакет();

	ВалютаРегУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	РеквизитыВалютыРегУчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВалютаРегУчета, "Код, Наименование");

	Выборка = РезультатыЗапроса[2].Выбрать();
	СтрокиДокументов = РезультатыЗапроса[3].Выгрузить();
	СтрокиДокументов.Индексы.Добавить("Документ");

	Пока Выборка.Следующий() Цикл

		СведенияОДокументе = ТаблицаСведений.Добавить();
		ЗаполнитьЗначенияСвойств(СведенияОДокументе, Выборка);

		СведенияОДокументе.Валюта             = ВалютаРегУчета;
		СведенияОДокументе.ВалютаКод          = РеквизитыВалютыРегУчета.Код;
		СведенияОДокументе.ВалютаНаименование = РеквизитыВалютыРегУчета.Наименование;

		ТаблицаДокумента = ПечатьТорговыхДокументов.ПолучитьОписаниеТаблицыСоглашенияОбИзмененииСтоимости();

		Отбор = Новый Структура("Документ", Выборка.Документ);
		СтрокиДокумента = СтрокиДокументов.НайтиСтроки(Отбор);

		НуженПересчетВРубли = Ложь;
		Если Выборка.Валюта <> ВалютаРегУчета
			И ЗначениеЗаполнено(Выборка.ИсправляемыйДокументРеализации) Тогда
			ДатаПолученияКурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ИсправляемыйДокументРеализации, "Дата");
			КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Выборка.Валюта, ДатаПолученияКурса);
			НуженПересчетВРубли = Истина;
		КонецЕсли;

		ЕстьТовары = Ложь;
		ЕстьУслуги = Ложь;

		Для Каждого Строка Из СтрокиДокумента Цикл

			СтрокаТаблицыДокумента = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыДокумента, Строка);

			Если НуженПересчетВРубли Тогда
				Если Строка.СуществуютЗаписиРублевыхСумм Тогда

					СтрокаТаблицыДокумента.СуммаНДС						= Строка.НДСВРублях;
					СтрокаТаблицыДокумента.СуммаНДСДоКорректировки		= Строка.НДСВРубляхДоКорректировки;

					СтрокаТаблицыДокумента.СуммаБезНДС 					= Строка.ВсегоВРублях - Строка.НДСВРублях;
					СтрокаТаблицыДокумента.СуммаБезНДСДоКорректировки 	= Строка.ВсегоВРубляхДоКорректировки - Строка.НДСВРубляхДоКорректировки;

				Иначе
					Кратность = ?(КурсВалюты.Кратность = 0, 1, КурсВалюты.Кратность);

					СтрокаТаблицыДокумента.СуммаНДС						= Строка.СуммаНДС * КурсВалюты.Курс / Кратность;;
					СтрокаТаблицыДокумента.СуммаНДСДоКорректировки 		= Строка.СуммаНДСДоКорректировки * КурсВалюты.Курс / Кратность;;

					СтрокаТаблицыДокумента.СуммаБезНДС					= (Строка.СуммаБезНДС + Строка.СуммаНДС) * КурсВалюты.Курс / Кратность - СтрокаТаблицыДокумента.СуммаНДС;
					СтрокаТаблицыДокумента.СуммаБезНДСДоКорректировки	= 
					(Строка.СуммаБезНДСДоКорректировки + Строка.СуммаНДСДоКорректировки) * КурсВалюты.Курс / Кратность - СтрокаТаблицыДокумента.СуммаНДСДоКорректировки;

				КонецЕсли;

				СтрокаТаблицыДокумента.Цена = ?(СтрокаТаблицыДокумента.Количество = 0, СтрокаТаблицыДокумента.СуммаБезНДС, СтрокаТаблицыДокумента.СуммаБезНДС / СтрокаТаблицыДокумента.Количество);
				СтрокаТаблицыДокумента.ЦенаДоКорректировки = ?(СтрокаТаблицыДокумента.КоличествоДоКорректировки = 0, СтрокаТаблицыДокумента.СуммаБезНДСДоКорректировки, 
				СтрокаТаблицыДокумента.СуммаБезНДСДоКорректировки / СтрокаТаблицыДокумента.КоличествоДоКорректировки);
			КонецЕсли;

			СтрокаТаблицыДокумента.СуммаСНДС 				= СтрокаТаблицыДокумента.СуммаБезНДС + СтрокаТаблицыДокумента.СуммаНДС;
			СтрокаТаблицыДокумента.СуммаСНДСДоКорректировки = СтрокаТаблицыДокумента.СуммаБезНДСДоКорректировки + СтрокаТаблицыДокумента.СуммаНДСДоКорректировки;

			ЕстьТовары = ЕстьТовары ИЛИ Строка.ТабличнаяЧасть = Перечисления.ТабличныеЧастиДокументов.Товары;
			ЕстьУслуги = ЕстьУслуги ИЛИ Строка.ТабличнаяЧасть = Перечисления.ТабличныеЧастиДокументов.Услуги 
			ИЛИ Строка.ТабличнаяЧасть = Перечисления.ТабличныеЧастиДокументов.АгентскиеУслуги;

		КонецЦикла;

		СведенияОДокументе.ТаблицаДокумента = ТаблицаДокумента;

		СведенияОДокументе.ЗаголовокДокументаОснования = ОпределитьТипДокументаОснованияДляЗаголовка(ЕстьТовары, ЕстьУслуги, Выборка.ВидОперации, Выборка.ИсправляемыйДокументРеализации);
        #Вставка
		//++ #5266 смарт: Тимофеева 25.12.2025 / Изменить шаблон Соглашение об изменении стоимости в БП
		Если ТипЗнч(Выборка.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Документ, "Дата, Номер");
			СведенияОДокументе.НомерДокумента 	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыДокумента.Номер, Истина, Ложь);
			СведенияОДокументе.ДатаДокумента 	= РеквизитыДокумента.Дата;
		
			СтруктураОтбора = Новый Структура;
			СчетФактура = УчетНДСПереопределяемый.НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(Выборка.ДокументОснование,,, СтруктураОтбора);
			Если ЗначениеЗаполнено(СчетФактура) Тогда
				СведенияОДокументе.ЗаголовокДокументаОснования = "к УПД";
				РеквизитыСчетФактуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, "Дата, Номер");
				СведенияОДокументе.НомерИсходногоДокумента 	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыСчетФактуры.Номер, Истина, Ложь);
				СведенияОДокументе.ДатаИсходногоДокумента 	= РеквизитыСчетФактуры.Дата;
			КонецЕсли;
		КонецЕсли;
		//-- #5266 смарт: Тимофеева 25.12.2025
		#КонецВставки
		ПорядокЗаполнения = Новый Структура("ЗаполнятьРуководителя, ЗаполнятьГлавногоБухгалтера, ЗаполнятьКладовщика");
		ПечатьТорговыхДокументов.ЗаполнитьДанныеОтветственныхЛиц(СведенияОДокументе, ПорядокЗаполнения);

	КонецЦикла;

	Возврат ТаблицаСведений;

КонецФункции

#КонецОбласти