#Область ОбработчикиСобытийФормы

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартВидМаркировки", "Список",, 1, "Список.Ссылка.смартВидМаркировки");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартОбязательнаяМаркировка", "Список",, 2, "Список.Ссылка.смартОбязательнаяМаркировка");
	смартФормированиеИнтерфейса.СздПоле(ЭтаФорма, "смартЭкспериментальныйРежимМаркировки", "Список",, 2, "Список.Ссылка.смартЭкспериментальныйРежимМаркировки");
	
КонецПроцедуры

#КонецОбласти