
&ИзменениеИКонтроль("ОбщиеПараметрыБазовойФункциональности")
Функция смарт_ОбщиеПараметрыБазовойФункциональности(ВернутьЗакешированноеЗначение)

	Если ВернутьЗакешированноеЗначение Тогда
		Возврат СтандартныеПодсистемыПовтИсп.ОбщиеПараметрыБазовойФункциональности();
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("ИмяФормыПерсональныхНастроек", "");
	Результат.Вставить("ЗапрашиватьПодтверждениеПриЗавершенииПрограммы", Истина);
	Результат.Вставить("РекомендуемыйОбъемОперативнойПамяти", 4);
	Результат.Вставить("МинимальнаяВерсияПлатформы", МинимальнаяВерсияПлатформы());
	Результат.Вставить("РекомендуемаяВерсияПлатформы", Результат.МинимальнаяВерсияПлатформы);
	Результат.Вставить("ВыводитьПолныйСтекПриОшибкеДлительнойОперации", Ложь);
	Результат.Вставить("ОтключитьИдентификаторыОбъектовМетаданных", Ложь);
	// Устарело, следует использовать свойства МинимальнаяВерсияПлатформы и РекомендуемаяВерсияПлатформы:
	Результат.Вставить("МинимальноНеобходимаяВерсияПлатформы", "");
	Результат.Вставить("РаботаВПрограммеЗапрещена", Ложь); // Блокировать запуск, если версия ниже минимальной.
	
	ОбщегоНазначенияПереопределяемый.ПриОпределенииОбщихПараметровБазовойФункциональности(Результат);
	Результат.МинимальнаяВерсияПлатформы = НомерСборкиПоТекущейВерсииПлатформы(Результат.МинимальнаяВерсияПлатформы);
	Результат.РекомендуемаяВерсияПлатформы = НомерСборкиПоТекущейВерсииПлатформы(Результат.РекомендуемаяВерсияПлатформы);
	
	УточнитьМинимальнуюВерсиюПлатформыИзСервиса(Результат);
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, Результат.МинимальнаяВерсияПлатформы) < 0
		И ЭтоВерсияЗащищенногоПрограммногоКомплекса(СистемнаяИнформация.ВерсияПриложения) Тогда
		Результат.МинимальнаяВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;
		Результат.РекомендуемаяВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;
	КонецЕсли;
	
	Минимальная   = Результат.МинимальнаяВерсияПлатформы;
	Рекомендуемая = Результат.РекомендуемаяВерсияПлатформы;
	Если МинимальнаяИРекомендуемаяВерсияПлатформыЗаполненаНеПравильно(Минимальная, Рекомендуемая) Тогда
		ТекстСообщения = НСтр("ru = 'Указанные в %1 минимальная и рекомендуемая версии платформы не соответствуют следующим требованиям:
			| - минимальная версия должна быть заполнена;
			| - минимальная версия не должна быть меньше минимальной версии БСП (см. %2);
			| - минимальная версия не должна быть меньше рекомендуемой версии.
			|Минимальная версия: %3
			|Минимальная версия БСП: %4
			|Рекомендуемая версия: %5'",
			КодОсновногоЯзыка());
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
			"ОбщегоНазначенияПереопределяемый.ПриОпределенииОбщихПараметровБазовойФункциональности",
			"ОбщегоНазначения.МинимальнаяВерсияПлатформы",
			Минимальная, НомерСборкиПоТекущейВерсииПлатформы(МинимальнаяВерсияПлатформы()), Рекомендуемая);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Базовая функциональность'", КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Предупреждение,,, 
			ТекстСообщения);		
	КонецЕсли;
	
	// Обратная совместимость.
	МинимальноНеобходимаяВерсияПлатформы = Результат.МинимальноНеобходимаяВерсияПлатформы;
	Если ЗначениеЗаполнено(МинимальноНеобходимаяВерсияПлатформы) Тогда
		Если Результат.РаботаВПрограммеЗапрещена Тогда
			Результат.МинимальнаяВерсияПлатформы   = МинимальноНеобходимаяВерсияПлатформы;
			Результат.РекомендуемаяВерсияПлатформы = "";
		Иначе
			Результат.РекомендуемаяВерсияПлатформы = МинимальноНеобходимаяВерсияПлатформы;
			Результат.МинимальнаяВерсияПлатформы   = "";
		КонецЕсли;
	Иначе
		Текущая = СистемнаяИнформация.ВерсияПриложения;
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Минимальная, Текущая) > 0 Тогда
			Результат.МинимальноНеобходимаяВерсияПлатформы = Минимальная;
			Результат.РаботаВПрограммеЗапрещена = Истина;
		Иначе
			Результат.МинимальноНеобходимаяВерсияПлатформы = Рекомендуемая;
			Результат.РаботаВПрограммеЗапрещена = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	УточнитьВерсиюПлатформы(Результат);
	
	#Вставка
	//++ # смарт: Каратеев 30.09.2024 / Отключение проверки версии платформы
	Результат.МинимальноНеобходимаяВерсияПлатформы = ИнтернетПоддержкаПользователей.ТекущаяВерсияПлатформы1СПредприятие();
	Результат.РекомендуемаяВерсияПлатформы = Результат.МинимальноНеобходимаяВерсияПлатформы;
	Результат.МинимальнаяВерсияПлатформы = Результат.МинимальноНеобходимаяВерсияПлатформы;
	//++ # смарт: Каратеев 30.09.2024
	#КонецВставки
	
	Возврат Результат;
	
КонецФункции
