
#Область ПеренесеноСДоработкамиСмарт
	
&После("ДополнитьДокументПодписьюИПечатью")
Процедура смарт_ДополнитьДокументПодписьюИПечатьюПосле(ТабДокумент, ВыборкаУПД, ОбъектыПечати, ПараметрыПечати)
	//на подписи
	Попытка
		Если ТипЗнч(ВыборкаУПД.Ссылка.ДокументОснование) = ТипЗнч(Документы.ПередачаТоваров.Пустаяссылка()) Тогда
			Рис = ТабДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			Рис.Высота=55;
			Рис.Ширина=155;
			Рис.Верх = 140;
			Рис.Лево = 80;
			Рис.РазмерКартинки = РазмерКартинки.Пропорционально; 
			Рис.ВыводитьНаПечать = Истина;
			Рис.Узор = ТипУзораТабличногоДокумента.БезУзора;
			Рис.ГраницаСверху = Ложь;
			Рис.ГраницаСнизу = Ложь;
			Рис.ГраницаСлева = Ложь;
			Рис.ГраницаСправа = Ложь;
			Рис.Картинка = БиблиотекаКартинок.смарт_КартинкаБезвозмезднаяПередача;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

#КонецОбласти