
//&Вместо("СоответствиеСтарыхИНовыхДанныхТЧ")
//Функция смарт_СоответствиеСтарыхИНовыхДанныхТЧ(ТабличнаяЧастьОбъектаПослеОбработки, ТабличнаяЧастьОбъектаДоОбработки, МассивКлючевыхПолей)
////++ #1284 смарт: Фролов 13.01.2023 //Исправить ошибку синхронизации деклараций в БП  
//	
//	СоответствиеСтрокНовойТЧСтрокамСтаройТЧ = Новый Соответствие;
//	
//	Для Каждого СтрокаНовойТЧ Из ТабличнаяЧастьОбъектаПослеОбработки Цикл
//		
//		НайденнаяСтрокаСтаройТЧ = Неопределено;
//		
//		СтруктураПоиска = Новый Структура;
//		Для Каждого КлючевоеПоле Из МассивКлючевыхПолей Цикл
//			СтруктураПоиска.Вставить(КлючевоеПоле, СтрокаНовойТЧ[КлючевоеПоле]);
//		КонецЦикла;
//		
//		НайденныеСтрокиНовойТЧ = ТабличнаяЧастьОбъектаПослеОбработки.НайтиСтроки(СтруктураПоиска);
//		
//		//Если НайденныеСтрокиНовойТЧ.Количество() = 1 Тогда
//		//	
//		//	НайденныеСтрокиСтаройТЧ = ТабличнаяЧастьОбъектаДоОбработки.НайтиСтроки(СтруктураПоиска);
//		//	
//		//	Если НайденныеСтрокиСтаройТЧ.Количество() = 1 Тогда
//		//		НайденнаяСтрокаСтаройТЧ = НайденныеСтрокиСтаройТЧ[0];
//		//	КонецЕсли;
//		//	
//		//КонецЕсли;
//		//
//		//СоответствиеСтрокНовойТЧСтрокамСтаройТЧ.Вставить(СтрокаНовойТЧ, НайденнаяСтрокаСтаройТЧ);
//		
//		Если НайденныеСтрокиНовойТЧ.Количество() = 1 Тогда
//			
//			НайденныеСтрокиСтаройТЧ = ТабличнаяЧастьОбъектаДоОбработки.НайтиСтроки(СтруктураПоиска);
//			
//			Если НайденныеСтрокиСтаройТЧ.Количество() = 1 Тогда
//				НайденнаяСтрокаСтаройТЧ = НайденныеСтрокиСтаройТЧ[0];
//			КонецЕсли; 
//			
//		ИначеЕсли НайденныеСтрокиНовойТЧ.Количество() > 1 Тогда
//			
//			КолНов=НайденныеСтрокиНовойТЧ.Количество();
//			НайденныеСтрокиСтаройТЧ = ТабличнаяЧастьОбъектаДоОбработки.НайтиСтроки(СтруктураПоиска);
//			
//			Если НайденныеСтрокиСтаройТЧ.Количество() = КолНов Тогда
//				Для каждого Стр Из НайденныеСтрокиСтаройТЧ Цикл
//					Если СтрокаНовойТЧ.НомерСтроки =  Стр.НомерСтроки Тогда
//						НайденнаяСтрокаСтаройТЧ = Стр;                 
//					КонецЕсли;	
//				КонецЦикла;
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//		СоответствиеСтрокНовойТЧСтрокамСтаройТЧ.Вставить(СтрокаНовойТЧ, НайденнаяСтрокаСтаройТЧ);
//		
//	КонецЦикла;
//	
//	Возврат СоответствиеСтрокНовойТЧСтрокамСтаройТЧ;
//	
//КонецФункции //-- #1284 смарт: Фролов 13.01.2023
//			 


