#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ТекстЗапросаДанныеДляПечатиСчетовФактур")
Функция смарт_ТекстЗапросаДанныеДляПечатиСчетовФактур(НомераТаблиц, ЕстьПередачаТоваровВСоставеРабот)
	
	НомераТаблиц.Вставить("ВременнаяТаблицаНаличиеТоваров", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты",                      НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ШтрихкодыУпаковок",              НомераТаблиц.Количество());

	Если ЕстьПередачаТоваровВСоставеРабот Тогда
		НомераТаблиц.Вставить("ТаблицаУслуг",                      НомераТаблиц.Количество());
	Иначе
		НомераТаблиц.Вставить("ВТ_РублевыеСуммыДокументовВВалюте", НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_ДанныеПоСтранеПроисхождения",    НомераТаблиц.Количество());
	КонецЕсли;
	
	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента",      НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СведенияОПрослеживаемости",      НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаТовары.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ НаличиеТоваров
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Склад КАК Склад,
	|	Реквизиты.ПодразделениеОрганизации КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация.ИНН
	|		ИНАЧЕ Реквизиты.Организация.ИНН
	|	КОНЕЦ КАК ИННпоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Грузоотправитель
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация
	|		ИНАЧЕ ""он же""
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.Контрагент.ИНН КАК ИННпокупателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель.ОбособленноеПодразделение
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент = Реквизиты.Контрагент
	|				И Реквизиты.Грузополучатель.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Грузополучатель
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК ОбособленноеПодразделениеПокупателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Грузополучатель
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Представление КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.Руководитель КАК Исполнитель,
	|	Реквизиты.ЗаРуководителяНаОсновании КАК ИсполнительНаОсновании,
	|	Реквизиты.ОтпускПроизвел КАК ОтпускПроизвел,
	|	Реквизиты.ДоверенностьНомер КАК ДоверенностьНомер,
	|	Реквизиты.ДоверенностьДата КАК ДоверенностьДата,
	|	Реквизиты.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	Реквизиты.ДоверенностьЧерезКого КАК ДоверенностьЧерезКого,
	|	Реквизиты.ЗаЗаказчикаНаОсновании КАК ЗаЗаказчикаНаОсновании,
	|	ВЫБОР
	|		КОГДА НаличиеТоваров.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьТовары,
	|	Реквизиты.АдресДоставки КАК АдресДоставки,
	|	Реквизиты.СведенияОТранспортировкеИГрузе КАК СведенияОТранспортировкеИГрузе,
	|	Реквизиты.ОтветственныйЗаОформление КАК ОтветственныйЗаОформление,
	|	Реквизиты.СопроводительныеДокументы КАК СопроводительныеДокументы,
	|	Реквизиты.Перевозчик КАК Перевозчик,
	|	Реквизиты.ПеревозкаАвтотранспортом КАК ПеревозкаАвтотранспортом,
	|	Реквизиты.БанковскийСчетОрганизации КАК БанковскийСчетПродавца,
	|	Реквизиты.ЭтапГосконтрактаЕИС КАК ЭтапГосконтрактаЕИС,
	|	Реквизиты.ОснованиеПередачи КАК ОснованиеПередачи,
	|	Реквизиты.РежимЗаполненияОснованияПередачи КАК РежимЗаполненияОснованияПередачи
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаличиеТоваров КАК НаличиеТоваров
	|		ПО Реквизиты.Ссылка = НаличиеТоваров.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.ШтрихкодУпаковки КАК Штрихкод
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТоваровИСМП КАК ДокументыПрямогоОбмена
	|		ПО ТаблицаДокумента.Ссылка = ДокументыПрямогоОбмена.ДокументОснование
	|			И (НЕ ДокументыПрямогоОбмена.ПометкаУдаления)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &ДокументОснование
	|	И ДокументыПрямогоОбмена.Ссылка ЕСТЬ NULL" + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	Если Не ЕстьПередачаТоваровВСоставеРабот Тогда 
		ТекстЗапроса = Текстзапроса 
		+"ВЫБРАТЬ
		 |	РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		 |	РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
		 |	РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего КАК Всего,
		 |	РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС КАК НДС,
		 |	РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС КАК НалоговаяБазаНДС
		 |ПОМЕСТИТЬ РегистрСведенийРублевыеСуммыДокументовВВалюте
		 |ИЗ
		 |	РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
		 |ГДЕ
		 |	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор = &ДокументОснование
		 |
		 |ИНДЕКСИРОВАТЬ ПО
		 |	НомерСтрокиДокумента,
		 |	ТабличнаяЧастьДокумента
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	РеализацияТоваровУслугУслуги.ИдентификаторСтроки КАК ИдентификаторСтроки,
		 |	МАКСИМУМ(РеализацияТоваровУслугСведенияПрослеживаемости.СтранаПроисхождения) КАК СтранаПроисхождения,
		 |	МАКСИМУМ(СтраныМира.НаименованиеПолное) КАК НаименованиеПолное
		 |ПОМЕСТИТЬ ВТ_ДанныеПоСтранеПроисхождения
		 |ИЗ
		 |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.СведенияПрослеживаемости КАК РеализацияТоваровУслугСведенияПрослеживаемости
		 |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
		 |			ПО РеализацияТоваровУслугСведенияПрослеживаемости.СтранаПроисхождения = СтраныМира.Ссылка
		 |		ПО РеализацияТоваровУслугУслуги.ИдентификаторСтроки = РеализацияТоваровУслугСведенияПрослеживаемости.ИдентификаторСтроки
		 |ГДЕ
		 |	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка = &ДокументОснование
		 |	И РеализацияТоваровУслугУслуги.Ссылка = &ДокументОснование
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	РеализацияТоваровУслугУслуги.ИдентификаторСтроки
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	1 КАК НомерТабЧасти,
		 |	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
		 |	ТаблицаТовары.Номенклатура КАК Товар,
		 |	ТаблицаТовары.Номенклатура.Код КАК ТоварКод,
		 |	ТаблицаТовары.Номенклатура.Артикул КАК ТоварАртикул,
		 |	ТаблицаТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
		 |	ТаблицаТовары.СтранаПроисхождения КАК СтранаПроисхождения,
		 |	ТаблицаТовары.СтранаПроисхождения.НаименованиеПолное КАК ПредставлениеСтраны,
		 |	ТаблицаТовары.НомерГТД КАК НомерГТД,
		 |	ТаблицаТовары.НомерГТД.Представление КАК ПредставлениеГТД,
		 #Удаление
		 |	ТаблицаТовары.НомерГТД.РегистрационныйНомер КАК РегистрационныйНомерТД,
		 #КонецУдаления
		 #Вставка
		//++ #Б3620 смарт: Шляпников 26.06.2025 / Номер в ГТД в печатной форме УПД и в БП и в УТ
		|	ТаблицаТовары.НомерГТД.Представление КАК РегистрационныйНомерТД,
		//-- #Б3620 смарт: Шляпников 26.06.2025
		#КонецВставки
		 |	ЕСТЬNULL(СправочникУпаковка.ЕдиницаИзмерения, СправочникНоменклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения, 	
		 |  ВЫРАЗИТЬ(ТаблицаТовары.Количество / ЕСТЬNULL(СправочникУпаковка.Коэффициент, 1) КАК ЧИСЛО(15,3)) КАК Количество, 
		 |	ВЫРАЗИТЬ(ТаблицаТовары.Цена * ЕСТЬNULL(СправочникУпаковка.Коэффициент, 1) КАК ЧИСЛО(15, 2)) КАК Цена, 
		 |	ТаблицаТовары.Сумма КАК Сумма,
		 |	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
		 |	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
		 |	ЛОЖЬ КАК ЭтоУслуга,
		 |	ТаблицаТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
		 |	ТаблицаТовары.Ссылка КАК Ссылка,
		 |	ЕСТЬNULL(ТаблицаТовары.СчетУчета.Забалансовый, ЛОЖЬ) КАК ЭтоКомиссия,
		 |	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0) КАК ВсегоРуб,
		 |	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0) КАК НДСРуб,
		 |	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0) КАК СуммаБезНДСРуб,
		 |	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК КонтрагентСводныйСФ,
		 |	НЕОПРЕДЕЛЕНО КАК ПериодичностьУслуги,
		 |	ВЫБОР
		 |		КОГДА ТаблицаТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		 |			ТОГДА ТаблицаТовары.КодТНВЭД
		 |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		 |	КОНЕЦ КАК ТоварКодТНВЭД,
		 |	ТаблицаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		 |	ТаблицаТовары.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
		 |	ТаблицаТовары.ИдентификаторСтрокиГосконтрактаЕИС КАК ИдентификаторСтрокиГосконтрактаЕИС,
		 |	ТаблицаТовары.НалоговаяБазаНДС КАК НалоговаяБазаНДС,
		 |	ТаблицаТовары.СуммаАкциза КАК СуммаАкциза
		 |ПОМЕСТИТЬ ТаблицаДокумента
		 |ИЗ
		 |	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
		 |		ПО ТаблицаТовары.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
		 |			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Товары))
		 |			И (ТаблицаТовары.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
		 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		 |		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
		 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК СправочникУпаковка
		 |		ПО ТаблицаТовары.Упаковка = СправочникУпаковка.Ссылка
		 |			И (СправочникУпаковка.Коэффициент > 0)
		 |ГДЕ
		 |	ТаблицаТовары.Ссылка = &ДокументОснование
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	2,
		 |	ТаблицаУслуги.НомерСтроки,
		 |	ТаблицаУслуги.Номенклатура,
		 |	ТаблицаУслуги.Номенклатура.Код,
		 |	ТаблицаУслуги.Номенклатура.КодОКВЭД2,
		 |	ТаблицаУслуги.Содержание,
		 |	ЕСТЬNULL(ВТ_ДанныеПоСтранеПроисхождения.СтранаПроисхождения, """"),
		 |	ЕСТЬNULL(ВТ_ДанныеПоСтранеПроисхождения.НаименованиеПолное, """"),
		 |	"""",
		 |	"""",
		 |	"""",
		 |	ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения,
		 |	ТаблицаУслуги.Количество,
		 |	ТаблицаУслуги.Цена,
		 |	ТаблицаУслуги.Сумма,
		 |	ТаблицаУслуги.СуммаНДС,
		 |	ТаблицаУслуги.СтавкаНДС,
		 |	ИСТИНА,
		 |	ТаблицаУслуги.Ссылка.СуммаВключаетНДС,
		 |	ТаблицаУслуги.Ссылка,
		 |	ЛОЖЬ,
		 |	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0),
		 |	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0),
		 |	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0),
		 |	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
		 |	НЕОПРЕДЕЛЕНО,
		 |	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
		 |	ТаблицаУслуги.ИдентификаторСтроки,
		 |	НЕОПРЕДЕЛЕНО,
		 |	ТаблицаУслуги.ИдентификаторСтрокиГосконтрактаЕИС,
		 |	0,
		 |	0
		 |ИЗ
		 |	Документ.РеализацияТоваровУслуг.Услуги КАК ТаблицаУслуги
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
		 |		ПО ТаблицаУслуги.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
		 |			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
		 |			И (ТаблицаУслуги.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
		 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоСтранеПроисхождения КАК ВТ_ДанныеПоСтранеПроисхождения
		 |		ПО ТаблицаУслуги.ИдентификаторСтроки = ВТ_ДанныеПоСтранеПроисхождения.ИдентификаторСтроки
		 |ГДЕ
		 |	ТаблицаУслуги.Ссылка = &ДокументОснование
		 |	И ТаблицаУслуги.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	3,
		 |	ТаблицаАгентскиеУслуги.НомерСтроки,
		 |	ТаблицаАгентскиеУслуги.Номенклатура,
		 |	ТаблицаАгентскиеУслуги.Номенклатура.Код,
		 |	ТаблицаАгентскиеУслуги.Номенклатура.КодОКВЭД2,
		 |	ТаблицаАгентскиеУслуги.Содержание,
		 |	"""",
		 |	"""",
		 |	"""",
		 |	"""",
		 |	"""",
		 |	ТаблицаАгентскиеУслуги.Номенклатура.ЕдиницаИзмерения,
		 |	ТаблицаАгентскиеУслуги.Количество,
		 |	ТаблицаАгентскиеУслуги.Цена,
		 |	ТаблицаАгентскиеУслуги.Сумма,
		 |	ТаблицаАгентскиеУслуги.СуммаНДС,
		 |	ТаблицаАгентскиеУслуги.СтавкаНДС,
		 |	ИСТИНА,
		 |	ТаблицаАгентскиеУслуги.Ссылка.СуммаВключаетНДС,
		 |	ТаблицаАгентскиеУслуги.Ссылка,
		 |	ИСТИНА,
		 |	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего, 0),
		 |	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС, 0),
		 |	ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС, 0),
		 |	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
		 |	НЕОПРЕДЕЛЕНО,
		 |	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка),
		 |	НЕОПРЕДЕЛЕНО,
		 |	НЕОПРЕДЕЛЕНО,
		 |	НЕОПРЕДЕЛЕНО,
		 |	0,
		 |	0
		 |ИЗ
		 |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК ТаблицаАгентскиеУслуги
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
		 |		ПО ТаблицаАгентскиеУслуги.НомерСтроки = РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
		 |			И (РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.АгентскиеУслуги))
		 |			И (ТаблицаАгентскиеУслуги.Ссылка.ВалютаДокумента <> &ВалютаРеглУчета)
		 |ГДЕ
		 |	ТаблицаАгентскиеУслуги.Ссылка = &ДокументОснование
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	РеализацияТоваровУслугСведенияПрослеживаемости.РНПТ.Код КАК НомерТовара,
		 |	РеализацияТоваровУслугСведенияПрослеживаемости.Количество КАК КоличествоУчетное,
		 |	РеализацияТоваровУслугСведенияПрослеживаемости.КоличествоПрослеживаемости КАК Количество,
		 |	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Наименование, ""шт"") КАК ЕдиницаИзмеренияПрослеживаемостиНаименование,
		 |	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, ""796"") КАК ЕдиницаИзмеренияПрослеживаемостиКод,
		 |	ТаблицаДокумента.Товар КАК Товар,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.ТоварКодТНВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
		 |			ТОГДА ""--""
		 |		ИНАЧЕ ТаблицаДокумента.ТоварКодТНВЭД
		 |	КОНЕЦ КАК ТоварКодТНВЭД,
		 |	ТаблицаДокумента.СтранаПроисхождения КАК СтранаПроисхождения,
		 |	ТаблицаДокумента.НомерГТД КАК НомерГТД,
		 |	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.СуммаВключаетНДС
		 |			ТОГДА ВЫБОР
		 |					КОГДА ТаблицаДокумента.Количество = 0
		 |						ТОГДА 0
		 |					КОГДА ТаблицаДокумента.СуммаНДС = 0
		 |						ТОГДА ТаблицаДокумента.Цена
		 |					ИНАЧЕ ВЫРАЗИТЬ((ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС) / ТаблицаДокумента.Количество КАК ЧИСЛО(15, 2))
		 |				КОНЕЦ
		 |		ИНАЧЕ ТаблицаДокумента.Цена
		 |	КОНЕЦ КАК Цена,
		 |	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
		 |	ТаблицаДокумента.КонтрагентСводныйСФ КАК КонтрагентСводныйСФ,
		 |	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		 |	ТаблицаДокумента.НомерТабЧасти КАК НомерТабЧасти,
		 |	ТаблицаДокумента.Ссылка КАК Ссылка,
		 |	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
		 |	ТаблицаДокумента.НалоговаяБазаНДС КАК НалоговаяБазаНДС,
		 |	ВЫБОР
		 |		КОГДА РеализацияТоваровУслугСведенияПрослеживаемости.Сумма = 0
		 |			ТОГДА ВЫБОР
		 |					КОГДА ТаблицаДокумента.СуммаВключаетНДС
		 |						ТОГДА ВЫРАЗИТЬ(РеализацияТоваровУслугСведенияПрослеживаемости.Количество * (ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС) / ТаблицаДокумента.Количество КАК ЧИСЛО(15, 2))
		 |					ИНАЧЕ РеализацияТоваровУслугСведенияПрослеживаемости.Количество * ТаблицаДокумента.Цена
		 |				КОНЕЦ
		 |		ИНАЧЕ РеализацияТоваровУслугСведенияПрослеживаемости.Сумма
		 |	КОНЕЦ КАК СтоимостьБезНалога
		 |ИЗ
		 |	Документ.РеализацияТоваровУслуг.СведенияПрослеживаемости КАК РеализацияТоваровУслугСведенияПрослеживаемости
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокумента КАК ТаблицаДокумента
		 |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
		 |			ПО ТаблицаДокумента.НоменклатураКодТНВЭД = КлассификаторТНВЭД.Ссылка
		 |		ПО (ТаблицаДокумента.ИдентификаторСтроки = РеализацияТоваровУслугСведенияПрослеживаемости.ИдентификаторСтроки)
		 |			И РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка = ТаблицаДокумента.Ссылка";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		|	Таблица.НомерСтроки КАК НомерСтроки,
		|	Таблица.Товар КАК Товар,
		|	Таблица.ТоварКод КАК ТоварКод,
		|	Таблица.ТоварНаименование КАК ТоварНаименование,
		|	Таблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Таблица.Количество КАК Количество,
		|	Таблица.Цена КАК Цена,
		|	Таблица.Сумма КАК Сумма,
		|	Таблица.СуммаНДС КАК СуммаНДС,
		|	Таблица.СтавкаНДС КАК СтавкаНДС,
		|	Таблица.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	&ДокументОснование КАК Ссылка,
		|	Таблица.ТоварКодТНВЭД КАК ТоварКодТНВЭД,
		|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	Таблица.СтранаПроисхождения КАК СтранаПроисхождения,
		|	Таблица.СтранаПроисхождения КАК СтранаПроисхожденияПредставление,
		|	Таблица.РНПТ КАК РНПТ,
		|	Таблица.ВсегоРуб КАК ВсегоРуб,
		|	Таблица.НДСРуб КАК НДСРуб,
		|	Таблица.СуммаБезНДСРуб КАК СуммаБезНДСРуб
		|ПОМЕСТИТЬ ТаблицаОС
		|ИЗ
		|	&ТаблицаДокумента КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК НомерТабЧасти,
		|	НЕОПРЕДЕЛЕНО КАК ТоварАртикул,
		|	"""" КАК НомерГТД,
		|	"""" КАК ПредставлениеГТД,
		|	"""" КАК РегистрационныйНомерТД,
		|	ТаблицаОС.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОС.Количество КАК Количество,
		|	ТаблицаОС.Цена КАК Цена,
		|	ТаблицаОС.Сумма КАК Сумма,
		|	ТаблицаОС.СуммаНДС КАК СуммаНДС,
		|	ТаблицаОС.СтавкаНДС КАК СтавкаНДС,
		|	ВЫБОР
		|		КОГДА ТаблицаОС.РНПТ = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоУслуга,
		|	ЛОЖЬ КАК ЭтоКомиссия,
		|	ТаблицаОС.ВсегоРуб КАК ВсегоРуб,
		|	ТаблицаОС.СуммаБезНДСРуб КАК СуммаБезНДСРуб,
		|	ТаблицаОС.НДСРуб КАК НДСРуб,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК КонтрагентСводныйСФ,
		|	НЕОПРЕДЕЛЕНО КАК ПериодичностьУслуги,
		|	ТаблицаОС.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаОС.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ТаблицаОС.СтранаПроисхожденияПредставление КАК СтранаПроисхожденияПредставление,
		|	ТаблицаОС.Товар КАК Товар,
		|	ТаблицаОС.ТоварКод КАК ТоварКод,
		|	ТаблицаОС.ТоварНаименование КАК ТоварНаименование,
		|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
		|	ТаблицаОС.Ссылка КАК Ссылка,
		|	КлассификаторТНВЭД.Код КАК ТоварКодТНВЭД,
		|	ТаблицаОС.РНПТ КАК РНПТ,
		|	ТаблицаОС.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	0 КАК НалоговаяБазаНДС,
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Наименование, """") КАК ЕдиницаИзмеренияПрослеживаемостиНаименование,
		|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, """") КАК ЕдиницаИзмеренияПрослеживаемостиКод,
		|	0 КАК СуммаАкциза
		|ПОМЕСТИТЬ ТаблицаДокумента
		|ИЗ
		|	ТаблицаОС КАК ТаблицаОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
		|		ПО ТаблицаОС.ТоварКодТНВЭД = КлассификаторТНВЭД.Ссылка
		|{УПОРЯДОЧИТЬ ПО
		|	НомерСтроки}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугСведенияПрослеживаемости.РНПТ.Код КАК НомерТовара,
		|	РеализацияТоваровУслугСведенияПрослеживаемости.Количество КАК КоличествоУчетное,
		|	РеализацияТоваровУслугСведенияПрослеживаемости.КоличествоПрослеживаемости КАК Количество,
		|	ТаблицаДокумента.ЕдиницаИзмеренияПрослеживаемостиНаименование КАК ЕдиницаИзмеренияПрослеживаемостиНаименование,
		|	ТаблицаДокумента.ЕдиницаИзмеренияПрослеживаемостиКод КАК ЕдиницаИзмеренияПрослеживаемостиКод,
		|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
		|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаДокумента.КонтрагентСводныйСФ КАК КонтрагентСводныйСФ,
		|	ТаблицаДокумента.НомерТабЧасти КАК НомерТабЧасти,
		|	ТаблицаДокумента.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ТаблицаДокумента.Ссылка КАК Ссылка,
		|	ТаблицаДокумента.ТоварКодТНВЭД КАК ТоварКодТНВЭД,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Товар КАК Товар,
		|	ТаблицаДокумента.Цена КАК Цена,
		|	ТаблицаДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаДокумента.Сумма КАК СтоимостьБезНалога
		|ИЗ
		|	ТаблицаДокумента КАК ТаблицаДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.СведенияПрослеживаемости КАК РеализацияТоваровУслугСведенияПрослеживаемости
		|		ПО ТаблицаДокумента.Ссылка = РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка
		|			И ТаблицаДокумента.ИдентификаторСтроки = РеализацияТоваровУслугСведенияПрослеживаемости.ИдентификаторСтроки
		|			И ТаблицаДокумента.Товар = РеализацияТоваровУслугСведенияПрослеживаемости.Номенклатура
		|			И ТаблицаДокумента.СтранаПроисхождения = РеализацияТоваровУслугСведенияПрослеживаемости.СтранаПроисхождения
		|			И ТаблицаДокумента.РНПТ = РеализацияТоваровУслугСведенияПрослеживаемости.РНПТ";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

#КонецОбласти

#Область ДоработкиСмарт

// Фролов+
Функция смартЕстьВозможностьПодписатьДокумент(Ссылка,Счет,СчетФактура)Экспорт 
	ДанныеВозврата=Новый Структура("Результат,Ошибки",Истина,Новый Массив);
	Если Не Ссылка.Проведен Тогда
		ДанныеВозврата.Результат=Ложь;
		ДанныеВозврата.Ошибки.Добавить("Документ "+Ссылка+" не проведен.");
	КонецЕсли;	
	Если Счет.Пустая() Тогда 
		ДанныеВозврата.Результат=Ложь;
		ДанныеВозврата.Ошибки.Добавить("Нет счета покупателя.");
	КонецЕсли;
	Если Не Счет.Проведен Тогда 
		ДанныеВозврата.Результат=Ложь;
		ДанныеВозврата.Ошибки.Добавить("Счет покупателя "+Счет+" не проведен.");
	КонецЕсли;
	Если СчетФактура.Пустая() Тогда 
		ДанныеВозврата.Результат=Ложь;
		ДанныеВозврата.Ошибки.Добавить("Не выставлен счет фактура.");
	КонецЕсли;
	Если Не СчетФактура.Проведен Тогда 
		ДанныеВозврата.Результат=Ложь;
		ДанныеВозврата.Ошибки.Добавить("Счет фактура выданный "+СчетФактура+" не проведен.");
	КонецЕсли;
	
	Возврат ДанныеВозврата; 
КонецФункции

// Фролов+
Процедура смартУстановитьПодписавшегоДокумент(Ссылка)Экспорт 
	МЗ=РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МЗ.Объект=Ссылка;
	МЗ.Значение=ПараметрыСеанса.ТекущийПользователь;//Пользователи.ТекущийПользователь();
	МЗ.Свойство=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ПодписавшийДокумент");
	
	УстановитьПривилегированныйРежим(Истина);
	МЗ.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

// Фролов+
Функция смартПолучитьПодписавшегоДокумент(Ссылка)Экспорт 
	Запрос=Новый Запрос("Выбрать Первые 1 Значение ИЗ РегистрСведений.ДополнительныеСведения ГДЕ Объект=&Ссылка И Свойство.Имя=""ПодписавшийДокумент""");
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		Возврат Рез.Значение;
	КонецЕсли;	
	Возврат Неопределено;
КонецФункции	

// Фролов+
Процедура смартДобавитьРеквизитОтветственныйЗаПодписьДокумента(Ссылка,Форма,Куда,ПередЧем,Нов=Ложь)Экспорт
	Если Нов Тогда
		Ответственный=ПараметрыСеанса.ТекущийПользователь;//Пользователи.ТекущийПользователь();
	Иначе
		Ответственный=смартПолучитьПодписавшегоДокумент(Ссылка);
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ОтветственныйЗаПодпись")=Неопределено Тогда  
		М=Новый Массив;
		М.Добавить(Новый РеквизитФормы("ОтветственныйЗаПодпись",Новый ОписаниеТипов("СправочникСсылка.Пользователи")));
		Форма.ИзменитьРеквизиты(М);
		
		Эл=Форма.Элементы.Вставить("ОтветственныйЗаПодпись",Тип("ПолеФормы"),Куда,ПередЧем);
		Эл.Вид=ВидПоляФормы.ПолеНадписи;
		Эл.Гиперссылка=Истина;
		Эл.ПутьКДанным="ОтветственныйЗаПодпись";
		Эл.Заголовок="Ответственный за подпись";		
	КонецЕсли;
	Форма.ОтветственныйЗаПодпись=Ответственный;
КонецПроцедуры

// Фролов+
Процедура смартУбратьРеквизитФормы(Форма,Имя)Экспорт 
	Эл=Форма.Элементы.Найти(Имя);
	Если Не Эл=Неопределено Тогда 
		Форма.Элементы.Удалить(Эл);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,Имя) Тогда 
		М=Новый Массив;
		М.Добавить(Имя);
		Форма.ИзменитьРеквизиты(,М);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти