#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("РеквизитыДокумента")
Функция смарт_РеквизитыДокумента(СтруктураПараметров, Выборка, КэшМетаданных, СчетаИсключения)

	ПараметрыПредставления = Новый Структура;
	ПараметрыПредставления.Вставить("Представление", "");
	ПараметрыПредставления.Вставить("НомерДокумента", "");
	ПараметрыПредставления.Вставить("ДатаДокумента", "");
	ПараметрыПредставления.Вставить("НаименованиеОперации", "");

	// Представление документа
	Если СтруктураПараметров.ВыводитьПолныеНазванияДокументов Тогда

		МетаданныеДокумента = ПолучитьМетаданныеДокумента(Выборка.Документ, КэшМетаданных);
		ПараметрыПредставления.Представление = МетаданныеДокумента.Представление();
		Если Выборка.ЭтоУниверсальныйДокумент Тогда
			Если Выборка.ЭтоКорректировочныйДокумент Тогда
				ПараметрыПредставления.Представление = ПараметрыПредставления.Представление + ", УКД";
			Иначе
				ПараметрыПредставления.Представление = ПараметрыПредставления.Представление + ", УПД";
			КонецЕсли;
		КонецЕсли;

	Иначе

		ПредставлениеОперации = ПредставлениеХозяйственнойОперации(Выборка, СчетаИсключения);
		ЗаполнитьЗначенияСвойств(ПараметрыПредставления, ПредставлениеОперации);

	КонецЕсли;

	Если Выборка.НомерВходящегоДокумента = Неопределено Тогда
		Если ПараметрыПредставления.Представление = НСтр("ru='Продажа'")
			И ТипЗнч(Выборка.Документ) <> Тип("ДокументСсылка.ОперацияБух") Тогда
			ПараметрыПредставления.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Ложь);
		Иначе
			ПараметрыПредставления.НомерДокумента = "";
		КонецЕсли;
	Иначе
		Если (Выборка.НомерВходящегоДокумента = "" И ПараметрыПредставления.Представление = НСтр("ru='Оплата'"))
			ИЛИ СтрНайти(ПараметрыПредставления.Представление, НСтр("ru='разницы'")) > 0 Тогда
			ПараметрыПредставления.НомерДокумента = "";
		Иначе
			Если ЗначениеЗаполнено(Выборка.ЦифровойИндексОбособленногоПодразделения) Тогда
				ПараметрыПредставления.НомерДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1/%2'"),
				Формат(Выборка.НомерВходящегоДокумента, "ЧН=_______"), Выборка.ЦифровойИндексОбособленногоПодразделения);
			Иначе
				
				#Вставка
				//++ #Б5364 смарт: Шляпников 16.01.2026 / Номера документов в актах сверок в БП
				Если ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					ПараметрыПредставления.НомерДокумента = ПолучитьНомерСФ(Выборка.Документ);
				Иначе
					ПараметрыПредставления.НомерДокумента = Формат(Выборка.НомерВходящегоДокумента, "ЧН=_______");
				КонецЕсли;
				//-- #Б5364 смарт: Шляпников 16.01.2026
				#КонецВставки
				#Удаление
				ПараметрыПредставления.НомерДокумента = Формат(Выборка.НомерВходящегоДокумента, "ЧН=_______");
				#КонецУдаления
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// Дата документа
	Если Выборка.ДатаВходящегоДокумента = Неопределено Или Выборка.ДатаВходящегоДокумента = '00010101' Тогда
		ПараметрыПредставления.ДатаДокумента = Выборка.Дата;
	Иначе
		ПараметрыПредставления.ДатаДокумента = Выборка.ДатаВходящегоДокумента;
	КонецЕсли;

	Возврат ПараметрыПредставления;

КонецФункции

#КонецОбласти

#Область ДоработкиСмарт

Функция ПолучитьНомерСФ(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Номер КАК Номер,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.НомерИсправления КАК НомерИсправления,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.НомерПлатежноРасчетногоДокумента КАК НомерПлатежноРасчетногоДокумента,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.НомерДокументаАвансаКомитента КАК НомерДокументаАвансаКомитента,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.НомерСчетаФактурыПродавца КАК НомерСчетаФактурыПродавца,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Ссылка <> NULL Тогда
		Возврат ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);
	КонецЕсли;
	
	Возврат Документ.Номер;
	
КонецФункции

#КонецОбласти