
#Область ПеренесеноСДоработкамиСмарт

&Перед("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//смартКаратеев ++
	//Дозаполнение реквизитов после создания документа правилами обмена.
	//Изменения сделаны в этом модуле, чтобы не затрагивать типовые правила обмена EnterpriseData

	//Код независим
	//Реквизиты зависимы
	Если ОбменДанными.Загрузка
		И ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПоступленияОтПродажПоПлатежнымКартамИБанковскимКредитам
		И СтрНачинаетсяС(ЭтотОбъект.НазначениеПлатежа,"Возмещение оплаты товаров и услуг Мерчант") Тогда
		
		//++ #6010 смарт: Тимофеева 30.03.2026 /  Синхронизация оплаты по эквайринговым операциям УТ-БП
		Если ЭтотОбъект.Дата < Дата(2026,1,1,0,0,0) Тогда
		//-- #6010 смарт: Тимофеева 30.03.2026
		
		ЭтотОбъект.СубконтоКт1 = ?(ЭтотОбъект.СубконтоКт1 = Неопределено,Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("ЦБ-Р00040",Истина),ЭтотОбъект.СубконтоКт1);
		ЭтотОбъект.СубконтоКт2 = ?(ЭтотОбъект.СубконтоКт2 = Неопределено,ЭтотОбъект.Контрагент,ЭтотОбъект.СубконтоКт2);
		ЭтотОбъект.СубконтоКт3 = ?(ЭтотОбъект.СубконтоКт3 = Неопределено,Справочники.Субконто.НайтиПоКоду("ОП-000008"),ЭтотОбъект.СубконтоКт3);
		ЭтотОбъект.СчетУчетаРасчетовСКонтрагентом = ?(ЭтотОбъект.СчетУчетаРасчетовСКонтрагентом = Неопределено
													ИЛИ ЭтотОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка()
													,ПланыСчетов.Хозрасчетный.НайтиПоРеквизиту("КодБыстрогоВыбора","9102"),ЭтотОбъект.СчетУчетаРасчетовСКонтрагентом);
			
		//++ #6010 смарт: Тимофеева 30.03.2026 /  Синхронизация оплаты по эквайринговым операциям УТ-БП
		Иначе  
			
			Если НЕ ЭтотОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками Тогда
				ЭтотОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками; 
				ЭтотОбъект.СубконтоКт1 = ЭтотОбъект.Контрагент;
			
				ПараметрыДоговора = ПечатьДоговоров.ПараметрыДоговора();
				ПараметрыДоговора.Организация = ЭтотОбъект.Организация;
				ПараметрыДоговора.Владелец = ЭтотОбъект.Контрагент;
   				ПараметрыДоговора.Номер = "Мерчант";			
				ЭтотОбъект.СубконтоКт2 = ПечатьДоговоров.НайтиДоговорПоПараметрам(ПараметрыДоговора);
		    КонецЕсли;        			
		КонецЕсли;
		//-- #6010 смарт: Тимофеева 30.03.2026
	
	КонецЕсли;
	//Каратеев --
	
КонецПроцедуры
	
#КонецОбласти