#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть") Тогда
		Товары.Очистить();
		ШтрихкодыУпаковок.Очистить();
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	ВидПродукции                  = ?(ЗначениеЗаполнено(ВидПродукции), ВидПродукции, Перечисления.ВидыПродукцииИС.Пиво);
	
	ПараметрыУказанияДанныхПоМОДВЭлектронномДокументе = ЭлектронноеВзаимодействиеИСМП.ПараметрыУказанияДанныхПоМОДВЭлектронномДокументеУПД_5_02(ВидПродукции, Дата, Истина);
	ЭтоИндивидуальныйПредприниматель                  = ОбщегоНазначенияИСВызовСервера.ПартнерОрганизацияЭтоИндивидуальныйПредприниматель(Организация);
	ПараметрыУказанияМОД                              = ПараметрыУказанияДанныхПоМОДВЭлектронномДокументе.ПараметрыУказанияМОДПоВидамПродукции.Получить(ВидПродукции);
	
	Если Не ПараметрыУказанияМОД = Неопределено Тогда
		
		ТребуетсяУказаниеФИАСГрузоотправителя = ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДОтправителя
			И ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДИндивидуальныхПредпринимателей
			И ЭтоИндивидуальныйПредприниматель
			
			Или ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДОтправителя
			И ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДЮридическихЛиц
			И Не ЭтоИндивидуальныйПредприниматель;
			
		ТребуетсяУказаниеФИАСГрузополучателя = ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДПолучателя
			И ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДИндивидуальныхПредпринимателей
			И ЭтоИндивидуальныйПредприниматель
			
			Или ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДПолучателя
			И ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДЮридическихЛиц
			И Не ЭтоИндивидуальныйПредприниматель;
		
		Если Не ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДПолучателя
			Или Не ПараметрыУказанияМОД.ТребуетсяУказаниеКодаФИАСПоМОДЮридическихЛиц
			Или ЭтоИндивидуальныйПредприниматель Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("Получатель");
			
		КонецЕсли;
		
		Если Не ТребуетсяУказаниеФИАСГрузополучателя Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ПолучательАдрес");
			МассивНепроверяемыхРеквизитов.Добавить("ПолучательКодФИАС");
			
		КонецЕсли;
		
		Если Не ТребуетсяУказаниеФИАСГрузоотправителя Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ОтправительАдрес");
			МассивНепроверяемыхРеквизитов.Добавить("ОтправительКодФИАС");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыУказанияДанныхПоМОДВЭлектронномДокументе.ТребуетсяУказаниеПеревозочныхДокументов
		И Не ЗначениеЗаполнено(ИдентификаторЭлектронногоПеревозочногоДокумента)
		И Не (ЗначениеЗаполнено(НомерПеревозочногоДокумента) И ЗначениеЗаполнено(ДатаПеревозочногоДокумента)) Тогда
		
		ТекстОшибки = НСтр("ru = 'Укажите данные ТТН или электронного перевозочного документа.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,
			ЭтотОбъект,
			"ИдентификаторЭлектронногоПеревозочногоДокумента",,
			Отказ);
		
	КонецЕсли;
	
	ТекущееСостояние      = РегистрыСведений.СтатусыДокументовИСМП.ТекущееСостояние(Ссылка);
	СтатусыДанныеПереданы = Документы.ПеремещениеМеждуМОДИСМП.СтатусыДанныеПереданы();
	
	Если СтатусыДанныеПереданы.Найти(ТекущееСостояние.Статус) <> Неопределено Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидПродукции");
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиИСМП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование           = Неопределено;
	НомерПеревозочногоДокумента = "";
	ДатаПеревозочногоДокумента  = Дата(1, 1, 1);
	НомерТранспортногоСредства  = "";
	ИдентификаторЗаявки         = "";
	ИдентификаторРазрешения     = "";
	
	ШтрихкодыУпаковок.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеИСМП.ДанныеЗаполненияПеремещениеМеждуМОД_ИСМП(Организация);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

// Заполнить коды ФИАС по переданному документу по адресам отправителя и получателя.
// 
Процедура ЗаполнитьКодыФИАСПоАдресамОтправителяПолучателя() Экспорт
	
	Если ЗначениеЗаполнено(ОтправительАдрес) Тогда
		
		ОтправительКодФИАС =
			ОбщегоНазначенияИСМП.ИдентификаторФИАСПоДаннымАдреса(ОтправительАдрес).Идентификатор;
		ЭлектронноеВзаимодействиеИСМП.ВыполнитьУточнениеКодаФИАСПоМОДам(ОтправительКодФИАС, ОтправительАдресСтрокой);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолучательАдрес) Тогда
		
		ПолучательКодФИАС =
			ОбщегоНазначенияИСМП.ИдентификаторФИАСПоДаннымАдреса(ПолучательАдрес).Идентификатор;
		ЭлектронноеВзаимодействиеИСМП.ВыполнитьУточнениеКодаФИАСПоМОДам(ПолучательКодФИАС, ПолучательАдресСтрокой);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли